*** crates/ap-math/src/control.rs:101:10: replace += with *= in update_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with *= in update_pos_vel_accel
@@ -93,17 +93,17 @@
     limit: f32,
     pos_error: f32,
     vel_error: f32,
 ) {
     let mut delta_pos = *vel * dt + accel * 0.5 * sq(dt);
     if is_positive(delta_pos * limit) && is_positive(pos_error * limit) {
         delta_pos = 0.0;
     }
-    *pos += Postype::from(delta_pos);
+    *pos *= /* ~ changed by cargo-mutants ~ */ Postype::from(delta_pos);
 
     update_vel_accel(vel, accel, dt, limit, vel_error);
 }
 
 /// Move an acceleration toward a target without exceeding a jerk limit,
 /// upstream `shape_accel`.
 ///
 /// # Errors

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (1619182) panicked at crates/ap-math/src/control.rs:1065:9:
settled at 0, wanted 100

failures:
    control::tests::a_position_demand_is_tracked_and_settles

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
