*** crates/ap-math/src/control.rs:120:8: delete ! in shape_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in shape_accel
@@ -112,17 +112,17 @@
 /// raises an internal error and returns, leaving `accel` untouched; so does
 /// this, and says so.
 pub fn shape_accel(
     accel_desired: f32,
     accel: &mut f32,
     jerk_max: f32,
     dt: f32,
 ) -> Result<(), ShapeError> {
-    if !is_positive(jerk_max) {
+    if  /* ~ changed by cargo-mutants ~ */is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }
     if is_positive(dt) {
         let accel_delta = constrain_value(accel_desired - *accel, -jerk_max * dt, jerk_max * dt);
         *accel += accel_delta;
     }
     Ok(())
 }

---- control::tests::a_bad_jerk_limit_is_refused_and_changes_nothing stdout ----

thread 'control::tests::a_bad_jerk_limit_is_refused_and_changes_nothing' (1622192) panicked at crates/ap-math/src/control.rs:1006:9:
assertion `left == right` failed
  left: Ok(())
 right: Err(JerkNotPositive)

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (1622215) panicked at crates/ap-math/src/control.rs:1038:83:
valid: JerkNotPositive

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (1622214) panicked at crates/ap-math/src/control.rs:1061:14:
valid: JerkNotPositive

failures:
    control::tests::a_bad_jerk_limit_is_refused_and_changes_nothing
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::a_velocity_demand_is_tracked_within_the_limits
    control::tests::acceleration_approaches_its_target_at_the_jerk_limit
    control::tests::an_angle_demand_turns_the_short_way

test result: FAILED. 141 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
