*** crates/ap-math/src/control.rs:124:57: replace - with / in shape_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace - with / in shape_accel
@@ -116,17 +116,17 @@
     accel: &mut f32,
     jerk_max: f32,
     dt: f32,
 ) -> Result<(), ShapeError> {
     if !is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }
     if is_positive(dt) {
-        let accel_delta = constrain_value(accel_desired - *accel, -jerk_max * dt, jerk_max * dt);
+        let accel_delta = constrain_value(accel_desired / /* ~ changed by cargo-mutants ~ */ *accel, -jerk_max * dt, jerk_max * dt);
         *accel += accel_delta;
     }
     Ok(())
 }
 
 /// Shape an acceleration to track a velocity demand, upstream
 /// `shape_vel_accel`.
 ///

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (3410397) panicked at crates/ap-math/src/control.rs:953:9:
settled at 585.812856586133, wanted 100

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (3410398) panicked at crates/ap-math/src/control.rs:927:13:
acceleration 3.0999992 left its limits

---- control::tests::acceleration_approaches_its_target_at_the_jerk_limit stdout ----

thread 'control::tests::acceleration_approaches_its_target_at_the_jerk_limit' (3410407) panicked at crates/ap-math/src/control.rs:886:9:
40.336864

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::a_velocity_demand_is_tracked_within_the_limits
    control::tests::acceleration_approaches_its_target_at_the_jerk_limit

test result: FAILED. 143 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
