*** crates/ap-math/src/control.rs:124:92: replace * with + in shape_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with + in shape_accel
@@ -116,17 +116,17 @@
     accel: &mut f32,
     jerk_max: f32,
     dt: f32,
 ) -> Result<(), ShapeError> {
     if !is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }
     if is_positive(dt) {
-        let accel_delta = constrain_value(accel_desired - *accel, -jerk_max * dt, jerk_max * dt);
+        let accel_delta = constrain_value(accel_desired - *accel, -jerk_max * dt, jerk_max + /* ~ changed by cargo-mutants ~ */ dt);
         *accel += accel_delta;
     }
     Ok(())
 }
 
 /// Shape an acceleration to track a velocity demand, upstream
 /// `shape_vel_accel`.
 ///

---- control::tests::acceleration_approaches_its_target_at_the_jerk_limit stdout ----

thread 'control::tests::acceleration_approaches_its_target_at_the_jerk_limit' (1632777) panicked at crates/ap-math/src/control.rs:992:9:
assertion `left == right` failed: 5 m/s^3 for 0.1 s is 0.5 m/s^2
  left: 5.1
 right: 0.5

failures:
    control::tests::acceleration_approaches_its_target_at_the_jerk_limit

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
