*** crates/ap-math/src/control.rs:125:16: replace += with -= in shape_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with -= in shape_accel
@@ -117,17 +117,17 @@
     jerk_max: f32,
     dt: f32,
 ) -> Result<(), ShapeError> {
     if !is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }
     if is_positive(dt) {
         let accel_delta = constrain_value(accel_desired - *accel, -jerk_max * dt, jerk_max * dt);
-        *accel += accel_delta;
+        *accel -= /* ~ changed by cargo-mutants ~ */ accel_delta;
     }
     Ok(())
 }
 
 /// Shape an acceleration to track a velocity demand, upstream
 /// `shape_vel_accel`.
 ///
 /// The correction gain is derived from the limits rather than tuned:

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (3421118) panicked at crates/ap-math/src/control.rs:953:9:
settled at -45022.68781794742, wanted 100

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (3421119) panicked at crates/ap-math/src/control.rs:927:13:
acceleration -3.0999992 left its limits

---- control::tests::acceleration_approaches_its_target_at_the_jerk_limit stdout ----

thread 'control::tests::acceleration_approaches_its_target_at_the_jerk_limit' (3421120) panicked at crates/ap-math/src/control.rs:880:9:
assertion `left == right` failed: 5 m/s^3 for 0.1 s is 0.5 m/s^2
  left: -0.5
 right: 0.5

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::a_velocity_demand_is_tracked_within_the_limits
    control::tests::acceleration_approaches_its_target_at_the_jerk_limit
    control::tests::an_angle_demand_turns_the_short_way

test result: FAILED. 142 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
