*** crates/ap-math/src/control.rs:125:16: replace += with *= in shape_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with *= in shape_accel
@@ -117,17 +117,17 @@
     jerk_max: f32,
     dt: f32,
 ) -> Result<(), ShapeError> {
     if !is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }
     if is_positive(dt) {
         let accel_delta = constrain_value(accel_desired - *accel, -jerk_max * dt, jerk_max * dt);
-        *accel += accel_delta;
+        *accel *= /* ~ changed by cargo-mutants ~ */ accel_delta;
     }
     Ok(())
 }
 
 /// Shape an acceleration to track a velocity demand, upstream
 /// `shape_vel_accel`.
 ///
 /// The correction gain is derived from the limits rather than tuned:

---- control::tests::acceleration_approaches_its_target_at_the_jerk_limit stdout ----

thread 'control::tests::acceleration_approaches_its_target_at_the_jerk_limit' (1638577) panicked at crates/ap-math/src/control.rs:992:9:
assertion `left == right` failed: 5 m/s^3 for 0.1 s is 0.5 m/s^2
  left: 0.0
 right: 0.5

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (1638576) panicked at crates/ap-math/src/control.rs:1045:9:
should have arrived, got 0

---- control::tests::an_angle_demand_turns_the_short_way stdout ----

thread 'control::tests::an_angle_demand_turns_the_short_way' (1638578) panicked at crates/ap-math/src/control.rs:1108:9:
the short way from 3.0 to -3.0 is forwards, got 0

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::a_velocity_demand_is_tracked_within_the_limits
    control::tests::acceleration_approaches_its_target_at_the_jerk_limit
    control::tests::an_angle_demand_turns_the_short_way

test result: FAILED. 142 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
