*** crates/ap-math/src/control.rs:155:35: delete ! in shape_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in shape_vel_accel
@@ -147,17 +147,17 @@
     vel: f32,
     accel: &mut f32,
     accel_min: f32,
     accel_max: f32,
     jerk_max: f32,
     dt: f32,
     limit_total_accel: bool,
 ) -> Result<(), ShapeError> {
-    if !is_negative(accel_min) || !is_positive(accel_max) {
+    if !is_negative(accel_min) ||  /* ~ changed by cargo-mutants ~ */is_positive(accel_max) {
         return Err(ShapeError::AccelLimitsMalformed);
     }
     if !is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }
 
     let vel_error = vel_desired - vel;

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (4032581) panicked at crates/ap-math/src/control.rs:926:83:
valid: AccelLimitsMalformed

---- control::tests::malformed_limits_are_refused stdout ----

thread 'control::tests::malformed_limits_are_refused' (4032592) panicked at crates/ap-math/src/control.rs:910:9:
assertion `left == right` failed
  left: Err(AccelLimitsMalformed)
 right: Err(JerkNotPositive)

failures:
    control::tests::a_velocity_demand_is_tracked_within_the_limits
    control::tests::malformed_limits_are_refused

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
