*** crates/ap-math/src/control.rs:155:5: replace shape_vel_accel -> Result<(), ShapeError> with Ok(())

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace shape_vel_accel -> Result<(), ShapeError> with Ok(())
@@ -147,40 +147,17 @@
     vel: f32,
     accel: &mut f32,
     accel_min: f32,
     accel_max: f32,
     jerk_max: f32,
     dt: f32,
     limit_total_accel: bool,
 ) -> Result<(), ShapeError> {
-    if !is_negative(accel_min) || !is_positive(accel_max) {
-        return Err(ShapeError::AccelLimitsMalformed);
-    }
-    if !is_positive(jerk_max) {
-        return Err(ShapeError::JerkNotPositive);
-    }
-
-    let vel_error = vel_desired - vel;
-
-    let kpa = if is_positive(vel_error) {
-        jerk_max / accel_max
-    } else {
-        jerk_max / -accel_min
-    };
-
-    let mut accel_target = sqrt_controller(vel_error, kpa, jerk_max, dt);
-    accel_target = constrain_value(accel_target, accel_min, accel_max);
-    accel_target += accel_desired;
-
-    if limit_total_accel {
-        accel_target = constrain_value(accel_target, accel_min, accel_max);
-    }
-
-    shape_accel(accel_target, accel, jerk_max, dt)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Shape an acceleration to track a position demand, upstream
 /// `shape_pos_vel_accel`.
 ///
 /// Works in the *correction frame*: the feedforward velocity is subtracted out
 /// first, so the square-root controller sees only the part of the motion it is
 /// responsible for. That is what lets a moving target be tracked without the

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (4026873) panicked at crates/ap-math/src/control.rs:910:9:
should have arrived, got 0

---- control::tests::malformed_limits_are_refused stdout ----

thread 'control::tests::malformed_limits_are_refused' (4026879) panicked at crates/ap-math/src/control.rs:882:9:
assertion `left == right` failed: accel_min must be negative
  left: Ok(())
 right: Err(AccelLimitsMalformed)

failures:
    control::tests::a_velocity_demand_is_tracked_within_the_limits
    control::tests::malformed_limits_are_refused

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
