*** crates/ap-math/src/control.rs:162:33: replace - with + in shape_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace - with + in shape_vel_accel
@@ -154,17 +154,17 @@
 ) -> Result<(), ShapeError> {
     if !is_negative(accel_min) || !is_positive(accel_max) {
         return Err(ShapeError::AccelLimitsMalformed);
     }
     if !is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }
 
-    let vel_error = vel_desired - vel;
+    let vel_error = vel_desired + /* ~ changed by cargo-mutants ~ */ vel;
 
     let kpa = if is_positive(vel_error) {
         jerk_max / accel_max
     } else {
         jerk_max / -accel_min
     };
 
     let mut accel_target = sqrt_controller(vel_error, kpa, jerk_max, dt);

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (1648701) panicked at crates/ap-math/src/control.rs:1045:9:
should have arrived, got 29.565264

failures:
    control::tests::a_velocity_demand_is_tracked_within_the_limits

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
