*** crates/ap-math/src/control.rs:172:18: replace += with *= in shape_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with *= in shape_vel_accel
@@ -164,17 +164,17 @@
     let kpa = if is_positive(vel_error) {
         jerk_max / accel_max
     } else {
         jerk_max / -accel_min
     };
 
     let mut accel_target = sqrt_controller(vel_error, kpa, jerk_max, dt);
     accel_target = constrain_value(accel_target, accel_min, accel_max);
-    accel_target += accel_desired;
+    accel_target *= /* ~ changed by cargo-mutants ~ */ accel_desired;
 
     if limit_total_accel {
         accel_target = constrain_value(accel_target, accel_min, accel_max);
     }
 
     shape_accel(accel_target, accel, jerk_max, dt)
 }

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (1662972) panicked at crates/ap-math/src/control.rs:1045:9:
should have arrived, got 0

failures:
    control::tests::a_velocity_demand_is_tracked_within_the_limits

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
