*** crates/ap-math/src/control.rs:209:29: replace || with && in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace || with && in shape_pos_vel_accel
@@ -201,17 +201,17 @@
     vel_min: f32,
     vel_max: f32,
     accel_min: f32,
     accel_max: f32,
     jerk_max: f32,
     dt: f32,
     limit_total: bool,
 ) -> Result<(), ShapeError> {
-    if is_positive(vel_min) || is_negative(vel_max) {
+    if is_positive(vel_min) && /* ~ changed by cargo-mutants ~ */ is_negative(vel_max) {
         return Err(ShapeError::VelLimitsMalformed);
     }
     if !is_negative(accel_min) || !is_positive(accel_max) {
         return Err(ShapeError::AccelLimitsMalformed);
     }
     if !is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }

*** result: Success
