*** crates/ap-math/src/control.rs:212:35: delete ! in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in shape_pos_vel_accel
@@ -204,17 +204,17 @@
     accel_max: f32,
     jerk_max: f32,
     dt: f32,
     limit_total: bool,
 ) -> Result<(), ShapeError> {
     if is_positive(vel_min) || is_negative(vel_max) {
         return Err(ShapeError::VelLimitsMalformed);
     }
-    if !is_negative(accel_min) || !is_positive(accel_max) {
+    if !is_negative(accel_min) ||  /* ~ changed by cargo-mutants ~ */is_positive(accel_max) {
         return Err(ShapeError::AccelLimitsMalformed);
     }
     if !is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }
 
     #[allow(
         clippy::cast_possible_truncation,

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (1671635) panicked at crates/ap-math/src/control.rs:1061:14:
valid: AccelLimitsMalformed

---- control::tests::an_angle_demand_turns_the_short_way stdout ----

thread 'control::tests::an_angle_demand_turns_the_short_way' (1671639) panicked at crates/ap-math/src/control.rs:1106:10:
valid: AccelLimitsMalformed

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::an_angle_demand_turns_the_short_way

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
