*** crates/ap-math/src/control.rs:215:8: delete ! in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in shape_pos_vel_accel
@@ -207,17 +207,17 @@
     limit_total: bool,
 ) -> Result<(), ShapeError> {
     if is_positive(vel_min) || is_negative(vel_max) {
         return Err(ShapeError::VelLimitsMalformed);
     }
     if !is_negative(accel_min) || !is_positive(accel_max) {
         return Err(ShapeError::AccelLimitsMalformed);
     }
-    if !is_positive(jerk_max) {
+    if  /* ~ changed by cargo-mutants ~ */is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }
 
     #[allow(
         clippy::cast_possible_truncation,
         reason = "upstream assigns the postype_t difference to a float; positions \
 are far apart in absolute terms and close in relative ones, which is the whole \
 reason the subtraction happens at the wider width first"

---- control::tests::an_angle_demand_turns_the_short_way stdout ----

thread 'control::tests::an_angle_demand_turns_the_short_way' (1673461) panicked at crates/ap-math/src/control.rs:1106:10:
valid: JerkNotPositive

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (1673457) panicked at crates/ap-math/src/control.rs:1061:14:
valid: JerkNotPositive

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::an_angle_demand_turns_the_short_way

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
