*** crates/ap-math/src/control.rs:225:34: replace - with / in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace - with / in shape_pos_vel_accel
@@ -217,17 +217,17 @@
     }
 
     #[allow(
         clippy::cast_possible_truncation,
         reason = "upstream assigns the postype_t difference to a float; positions \
 are far apart in absolute terms and close in relative ones, which is the whole \
 reason the subtraction happens at the wider width first"
     )]
-    let pos_error = (pos_desired - pos) as f32;
+    let pos_error = (pos_desired / /* ~ changed by cargo-mutants ~ */ pos) as f32;
 
     // The acceleration allowance is taken from the direction of travel: a
     // positive position error is closed by decelerating, which uses accel_min.
     let (accel_lim, k_v) = if is_positive(pos_error) {
         let lim = -accel_min;
         (lim, jerk_max / lim)
     } else {
         let lim = accel_max;

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (1679076) panicked at crates/ap-math/src/control.rs:1065:9:
settled at 86.11403381912487, wanted 100

failures:
    control::tests::a_position_demand_is_tracked_and_settles

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
