*** crates/ap-math/src/control.rs:231:24: replace / with * in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in shape_pos_vel_accel
@@ -223,17 +223,17 @@
 reason the subtraction happens at the wider width first"
     )]
     let pos_error = (pos_desired - pos) as f32;
 
     // The acceleration allowance is taken from the direction of travel: a
     // positive position error is closed by decelerating, which uses accel_min.
     let (accel_lim, k_v) = if is_positive(pos_error) {
         let lim = -accel_min;
-        (lim, jerk_max / lim)
+        (lim, jerk_max * /* ~ changed by cargo-mutants ~ */ lim)
     } else {
         let lim = accel_max;
         (lim, jerk_max / lim)
     };
 
     // Correction frame: remove the feedforward velocity.
     let vel_corr = vel - vel_desired;

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (4069544) panicked at crates/ap-math/tests/control_parity.rs:176:17:
loop position at step 318: 13.91929458914774 against upstream 13.919293747232132

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
