*** crates/ap-math/src/control.rs:238:24: replace - with + in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace - with + in shape_pos_vel_accel
@@ -230,17 +230,17 @@
         let lim = -accel_min;
         (lim, jerk_max / lim)
     } else {
         let lim = accel_max;
         (lim, jerk_max / lim)
     };
 
     // Correction frame: remove the feedforward velocity.
-    let vel_corr = vel - vel_desired;
+    let vel_corr = vel + /* ~ changed by cargo-mutants ~ */ vel_desired;
 
     let mut vel_corr_cmd = sqrt_controller(pos_error, k_v, accel_lim, dt);
     let accel_corr_cmd = sqrt_controller_accel(pos_error, vel_corr_cmd, vel_corr, k_v, accel_lim);
     vel_corr_cmd += accel_corr_cmd / k_v;
 
     if is_negative(vel_min) {
         vel_corr_cmd = vel_corr_cmd.max(vel_min);
     }

*** result: Success
