*** crates/ap-math/src/control.rs:238:24: replace - with / in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace - with / in shape_pos_vel_accel
@@ -230,17 +230,17 @@
         let lim = -accel_min;
         (lim, jerk_max / lim)
     } else {
         let lim = accel_max;
         (lim, jerk_max / lim)
     };
 
     // Correction frame: remove the feedforward velocity.
-    let vel_corr = vel - vel_desired;
+    let vel_corr = vel / /* ~ changed by cargo-mutants ~ */ vel_desired;
 
     let mut vel_corr_cmd = sqrt_controller(pos_error, k_v, accel_lim, dt);
     let accel_corr_cmd = sqrt_controller_accel(pos_error, vel_corr_cmd, vel_corr, k_v, accel_lim);
     vel_corr_cmd += accel_corr_cmd / k_v;
 
     if is_negative(vel_min) {
         vel_corr_cmd = vel_corr_cmd.max(vel_min);
     }

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (3474178) panicked at crates/ap-math/src/control.rs:953:9:
settled at 0.014999998256826075, wanted 100

failures:
    control::tests::a_position_demand_is_tracked_and_settles

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
