*** crates/ap-math/src/control.rs:242:18: replace += with -= in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with -= in shape_pos_vel_accel
@@ -234,17 +234,17 @@
         (lim, jerk_max / lim)
     };
 
     // Correction frame: remove the feedforward velocity.
     let vel_corr = vel - vel_desired;
 
     let mut vel_corr_cmd = sqrt_controller(pos_error, k_v, accel_lim, dt);
     let accel_corr_cmd = sqrt_controller_accel(pos_error, vel_corr_cmd, vel_corr, k_v, accel_lim);
-    vel_corr_cmd += accel_corr_cmd / k_v;
+    vel_corr_cmd -= /* ~ changed by cargo-mutants ~ */ accel_corr_cmd / k_v;
 
     if is_negative(vel_min) {
         vel_corr_cmd = vel_corr_cmd.max(vel_min);
     }
     if is_positive(vel_max) {
         vel_corr_cmd = vel_corr_cmd.min(vel_max);
     }

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (4078481) panicked at crates/ap-math/src/control.rs:953:9:
settled at 96.88464158229863, wanted 100

failures:
    control::tests::a_position_demand_is_tracked_and_settles

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
