*** crates/ap-math/src/control.rs:242:18: replace += with *= in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with *= in shape_pos_vel_accel
@@ -234,17 +234,17 @@
         (lim, jerk_max / lim)
     };
 
     // Correction frame: remove the feedforward velocity.
     let vel_corr = vel - vel_desired;
 
     let mut vel_corr_cmd = sqrt_controller(pos_error, k_v, accel_lim, dt);
     let accel_corr_cmd = sqrt_controller_accel(pos_error, vel_corr_cmd, vel_corr, k_v, accel_lim);
-    vel_corr_cmd += accel_corr_cmd / k_v;
+    vel_corr_cmd *= /* ~ changed by cargo-mutants ~ */ accel_corr_cmd / k_v;
 
     if is_negative(vel_min) {
         vel_corr_cmd = vel_corr_cmd.max(vel_min);
     }
     if is_positive(vel_max) {
         vel_corr_cmd = vel_corr_cmd.min(vel_max);
     }

---- control::tests::an_angle_demand_turns_the_short_way stdout ----

thread 'control::tests::an_angle_demand_turns_the_short_way' (1693065) panicked at crates/ap-math/src/control.rs:1108:9:
the short way from 3.0 to -3.0 is forwards, got 0

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (1693060) panicked at crates/ap-math/src/control.rs:1065:9:
settled at 0, wanted 100

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::an_angle_demand_turns_the_short_way

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
