*** crates/ap-math/src/control.rs:242:36: replace / with % in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with % in shape_pos_vel_accel
@@ -234,17 +234,17 @@
         (lim, jerk_max / lim)
     };
 
     // Correction frame: remove the feedforward velocity.
     let vel_corr = vel - vel_desired;
 
     let mut vel_corr_cmd = sqrt_controller(pos_error, k_v, accel_lim, dt);
     let accel_corr_cmd = sqrt_controller_accel(pos_error, vel_corr_cmd, vel_corr, k_v, accel_lim);
-    vel_corr_cmd += accel_corr_cmd / k_v;
+    vel_corr_cmd += accel_corr_cmd % /* ~ changed by cargo-mutants ~ */ k_v;
 
     if is_negative(vel_min) {
         vel_corr_cmd = vel_corr_cmd.max(vel_min);
     }
     if is_positive(vel_max) {
         vel_corr_cmd = vel_corr_cmd.min(vel_max);
     }

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (3479161) panicked at crates/ap-math/tests/control_parity.rs:176:17:
loop position at step 925: 74.36403650878447 against upstream 74.36404097168224

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
