*** crates/ap-math/src/control.rs:262:40: replace - with + in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace - with + in shape_pos_vel_accel
@@ -254,17 +254,17 @@
         if is_negative(vel_min) {
             vel_target = vel_target.max(vel_min);
         }
         if is_positive(vel_max) {
             vel_target = vel_target.min(vel_max);
         }
     }
 
-    let mut accel_target = (vel_target - vel) * k_v;
+    let mut accel_target = (vel_target + /* ~ changed by cargo-mutants ~ */ vel) * k_v;
     accel_target = constrain_value(accel_target, accel_min, accel_max);
     accel_target += accel_desired;
 
     if limit_total {
         accel_target = constrain_value(accel_target, accel_min, accel_max);
     }
 
     shape_accel(accel_target, accel, jerk_max, dt)

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (3491080) panicked at crates/ap-math/src/control.rs:953:9:
settled at 1336.9771768012502, wanted 100

failures:
    control::tests::a_position_demand_is_tracked_and_settles

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
