*** crates/ap-math/src/control.rs:297:5: replace shape_angle_vel_accel -> Result<(), ShapeError> with Ok(())

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace shape_angle_vel_accel -> Result<(), ShapeError> with Ok(())
@@ -289,32 +289,17 @@
     angle_accel: &mut f32,
     angle_vel_min: f32,
     angle_vel_max: f32,
     angle_accel_max: f32,
     angle_jerk_max: f32,
     dt: f32,
     limit_total: bool,
 ) -> Result<(), ShapeError> {
-    let angle_desired_wrapped = angle + wrap_pi(angle_desired - angle);
-    shape_pos_vel_accel(
-        Postype::from(angle_desired_wrapped),
-        angle_vel_desired,
-        angle_accel_desired,
-        Postype::from(angle),
-        angle_vel,
-        angle_accel,
-        angle_vel_min,
-        angle_vel_max,
-        -angle_accel_max,
-        angle_accel_max,
-        angle_jerk_max,
-        dt,
-        limit_total,
-    )
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Proportional near the target, square-root far from it. Upstream
 /// `sqrt_controller`.
 ///
 /// The square-root branch returns the speed from which `second_ord_lim` of
 /// deceleration would stop exactly at the target. The two branches meet at
 /// `linear_dist = second_ord_lim / p²`, and the `linear_dist / 2` term inside

---- control::tests::an_angle_demand_turns_the_short_way stdout ----

thread 'control::tests::an_angle_demand_turns_the_short_way' (3499376) panicked at crates/ap-math/src/control.rs:981:9:
the short way from 3.0 to -3.0 is forwards, got 0

failures:
    control::tests::an_angle_demand_turns_the_short_way

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
