*** crates/ap-math/src/control.rs:327:5: replace sqrt_controller -> f32 with -1.0

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace sqrt_controller -> f32 with -1.0
@@ -319,44 +319,17 @@
 /// deceleration would stop exactly at the target. The two branches meet at
 /// `linear_dist = second_ord_lim / p²`, and the `linear_dist / 2` term inside
 /// the square root is what makes the join continuous rather than merely close.
 ///
 /// With a positive `dt` the result is clamped so the correction cannot
 /// overshoot the whole error in one step.
 #[must_use]
 pub fn sqrt_controller(error: f32, p: f32, second_ord_lim: f32, dt: f32) -> f32 {
-    let correction_rate = if is_negative(second_ord_lim) || is_zero(second_ord_lim) {
-        // No acceleration limit: purely proportional.
-        error * p
-    } else if is_zero(p) {
-        // No proportional gain: purely square-root.
-        if is_positive(error) {
-            safe_sqrt(2.0 * second_ord_lim * error)
-        } else if is_negative(error) {
-            -safe_sqrt(2.0 * second_ord_lim * -error)
-        } else {
-            0.0
-        }
-    } else {
-        let linear_dist = second_ord_lim / sq(p);
-        if error > linear_dist {
-            safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
-        } else if error < -linear_dist {
-            -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
-        } else {
-            error * p
-        }
-    };
-
-    if is_positive(dt) {
-        constrain_value(correction_rate, -error.abs() / dt, error.abs() / dt)
-    } else {
-        correction_rate
-    }
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// The error that would produce a given output, upstream
 /// `inv_sqrt_controller`.
 ///
 /// Used to work out how far ahead of a stop the braking must begin — see
 /// [`stopping_distance`], which is this function under another name.
 #[must_use]

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (3512134) panicked at crates/ap-math/src/control.rs:906:9:
should have arrived, got -9.9551325

---- control::tests::an_angle_demand_turns_the_short_way stdout ----

thread 'control::tests::an_angle_demand_turns_the_short_way' (3512136) panicked at crates/ap-math/src/control.rs:969:9:
the short way from 3.0 to -3.0 is forwards, got -0.049999997

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (3512132) panicked at crates/ap-math/src/control.rs:926:9:
settled at -15.650893683726736, wanted 100

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::a_velocity_demand_is_tracked_within_the_limits
    control::tests::an_angle_demand_turns_the_short_way
    control::tests::far_from_the_target_it_is_a_braking_profile
    control::tests::near_the_target_it_is_a_p_controller
    control::tests::the_inverse_round_trips
    control::tests::the_response_is_symmetric

test result: FAILED. 139 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
