*** crates/ap-math/src/control.rs:329:15: replace * with / in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in sqrt_controller
@@ -321,17 +321,17 @@
 /// the square root is what makes the join continuous rather than merely close.
 ///
 /// With a positive `dt` the result is clamped so the correction cannot
 /// overshoot the whole error in one step.
 #[must_use]
 pub fn sqrt_controller(error: f32, p: f32, second_ord_lim: f32, dt: f32) -> f32 {
     let correction_rate = if is_negative(second_ord_lim) || is_zero(second_ord_lim) {
         // No acceleration limit: purely proportional.
-        error * p
+        error / /* ~ changed by cargo-mutants ~ */ p
     } else if is_zero(p) {
         // No proportional gain: purely square-root.
         if is_positive(error) {
             safe_sqrt(2.0 * second_ord_lim * error)
         } else if is_negative(error) {
             -safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (3517281) panicked at crates/ap-math/tests/control_parity.rs:225:17:
sqrt_controller in row `sqrt,3245342720,0,3212836864,0,0,0,2147483648,0`: -inf against upstream -0

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
