*** crates/ap-math/src/control.rs:333:27: replace * with / in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in sqrt_controller
@@ -325,17 +325,17 @@
 #[must_use]
 pub fn sqrt_controller(error: f32, p: f32, second_ord_lim: f32, dt: f32) -> f32 {
     let correction_rate = if is_negative(second_ord_lim) || is_zero(second_ord_lim) {
         // No acceleration limit: purely proportional.
         error * p
     } else if is_zero(p) {
         // No proportional gain: purely square-root.
         if is_positive(error) {
-            safe_sqrt(2.0 * second_ord_lim * error)
+            safe_sqrt(2.0 / /* ~ changed by cargo-mutants ~ */ second_ord_lim * error)
         } else if is_negative(error) {
             -safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
         if error > linear_dist {

---- control::tests::far_from_the_target_it_is_a_braking_profile stdout ----

thread 'control::tests::far_from_the_target_it_is_a_braking_profile' (4125643) panicked at crates/ap-math/src/control.rs:808:9:
10

failures:
    control::tests::far_from_the_target_it_is_a_braking_profile

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
