*** crates/ap-math/src/control.rs:335:13: delete - in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete - in sqrt_controller
@@ -327,17 +327,17 @@
     let correction_rate = if is_negative(second_ord_lim) || is_zero(second_ord_lim) {
         // No acceleration limit: purely proportional.
         error * p
     } else if is_zero(p) {
         // No proportional gain: purely square-root.
         if is_positive(error) {
             safe_sqrt(2.0 * second_ord_lim * error)
         } else if is_negative(error) {
-            -safe_sqrt(2.0 * second_ord_lim * -error)
+             /* ~ changed by cargo-mutants ~ */safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
         if error > linear_dist {
             safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
         } else if error < -linear_dist {

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (3525685) panicked at crates/ap-math/tests/control_parity.rs:225:17:
sqrt_controller in row `sqrt,3245342720,0,1056964608,0,0,0,3229081334,0`: 3.8729835 against upstream -3.8729835

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
