*** crates/ap-math/src/control.rs:340:42: replace / with % in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with % in sqrt_controller
@@ -332,17 +332,17 @@
         if is_positive(error) {
             safe_sqrt(2.0 * second_ord_lim * error)
         } else if is_negative(error) {
             -safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0
         }
     } else {
-        let linear_dist = second_ord_lim / sq(p);
+        let linear_dist = second_ord_lim % /* ~ changed by cargo-mutants ~ */ sq(p);
         if error > linear_dist {
             safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
         } else if error < -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (4138909) panicked at crates/ap-math/src/control.rs:854:13:
10 became 13.416408 and came back as 10.25

failures:
    control::tests::the_inverse_round_trips

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
