*** crates/ap-math/src/control.rs:341:18: replace > with < in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace > with < in sqrt_controller
@@ -333,17 +333,17 @@
             safe_sqrt(2.0 * second_ord_lim * error)
         } else if is_negative(error) {
             -safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
-        if error > linear_dist {
+        if error < /* ~ changed by cargo-mutants ~ */ linear_dist {
             safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
         } else if error < -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (3541604) panicked at crates/ap-math/src/control.rs:953:9:
settled at 114.99994472511102, wanted 100

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (3541606) panicked at crates/ap-math/src/control.rs:933:9:
should have arrived, got 4.564643

---- control::tests::near_the_target_it_is_a_p_controller stdout ----

thread 'control::tests::near_the_target_it_is_a_p_controller' (3541661) panicked at crates/ap-math/src/control.rs:797:9:
assertion `left == right` failed
  left: 0.0
 right: 2.0

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::a_velocity_demand_is_tracked_within_the_limits
    control::tests::near_the_target_it_is_a_p_controller
    control::tests::the_inverse_round_trips
    control::tests::the_response_is_symmetric

test result: FAILED. 141 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
