*** crates/ap-math/src/control.rs:342:44: replace * with / in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in sqrt_controller
@@ -334,17 +334,17 @@
         } else if is_negative(error) {
             -safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
         if error > linear_dist {
-            safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
+            safe_sqrt(2.0 * second_ord_lim / /* ~ changed by cargo-mutants ~ */ (error - linear_dist / 2.0))
         } else if error < -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };
 
     if is_positive(dt) {

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (4146527) panicked at crates/ap-math/src/control.rs:953:9:
settled at 1.5805780064615647, wanted 100

---- control::tests::the_response_is_symmetric stdout ----

thread 'control::tests::the_response_is_symmetric' (4146577) panicked at crates/ap-math/src/control.rs:831:13:
at 10: 1.5118579 and -13.228757

---- control::tests::the_two_regimes_join_continuously stdout ----

thread 'control::tests::the_two_regimes_join_continuously' (4146578) panicked at crates/ap-math/src/control.rs:819:9:
a step at the join: 4.9998 then 3.99984

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::the_inverse_round_trips
    control::tests::the_response_is_symmetric
    control::tests::the_two_regimes_join_continuously

test result: FAILED. 142 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
