*** crates/ap-math/src/control.rs:342:67: replace / with * in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in sqrt_controller
@@ -334,17 +334,17 @@
         } else if is_negative(error) {
             -safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
         if error > linear_dist {
-            safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
+            safe_sqrt(2.0 * second_ord_lim * (error - linear_dist * /* ~ changed by cargo-mutants ~ */ 2.0))
         } else if error < -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };
 
     if is_positive(dt) {

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (1770957) panicked at crates/ap-math/src/control.rs:1045:9:
should have arrived, got 3.214643

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (1770971) panicked at crates/ap-math/src/control.rs:966:13:
10 became 10 and came back as 6.25

---- control::tests::the_two_regimes_join_continuously stdout ----

thread 'control::tests::the_two_regimes_join_continuously' (1770976) panicked at crates/ap-math/src/control.rs:931:9:
a step at the join: 4.9998 then 0

failures:
    control::tests::a_velocity_demand_is_tracked_within_the_limits
    control::tests::the_inverse_round_trips
    control::tests::the_response_is_symmetric
    control::tests::the_two_regimes_join_continuously

test result: FAILED. 142 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
