*** crates/ap-math/src/control.rs:343:27: delete - in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete - in sqrt_controller
@@ -335,17 +335,17 @@
             -safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
         if error > linear_dist {
             safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
-        } else if error < -linear_dist {
+        } else if error <  /* ~ changed by cargo-mutants ~ */linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };
 
     if is_positive(dt) {
         constrain_value(correction_rate, -error.abs() / dt, error.abs() / dt)

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (3564416) panicked at crates/ap-math/src/control.rs:933:9:
should have arrived, got 4.5599976

---- control::tests::near_the_target_it_is_a_p_controller stdout ----

thread 'control::tests::near_the_target_it_is_a_p_controller' (3564424) panicked at crates/ap-math/src/control.rs:797:9:
assertion `left == right` failed
  left: -0.0
 right: 2.0

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (3564430) panicked at crates/ap-math/src/control.rs:854:13:
0.5 became -0 and came back as -0

failures:
    control::tests::a_velocity_demand_is_tracked_within_the_limits
    control::tests::an_angle_demand_turns_the_short_way
    control::tests::near_the_target_it_is_a_p_controller
    control::tests::the_inverse_round_trips
    control::tests::the_two_regimes_join_continuously

test result: FAILED. 141 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
