*** crates/ap-math/src/control.rs:344:13: delete - in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete - in sqrt_controller
@@ -336,17 +336,17 @@
         } else {
             0.0
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
         if error > linear_dist {
             safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
         } else if error < -linear_dist {
-            -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
+             /* ~ changed by cargo-mutants ~ */safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };
 
     if is_positive(dt) {
         constrain_value(correction_rate, -error.abs() / dt, error.abs() / dt)
     } else {

---- control::tests::the_response_is_symmetric stdout ----

thread 'control::tests::the_response_is_symmetric' (3567268) panicked at crates/ap-math/src/control.rs:831:13:
at 10: 13.228757 and 13.228757

failures:
    control::tests::the_response_is_symmetric

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
