*** crates/ap-math/src/control.rs:346:19: replace * with / in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in sqrt_controller
@@ -338,17 +338,17 @@
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
         if error > linear_dist {
             safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
         } else if error < -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
-            error * p
+            error / /* ~ changed by cargo-mutants ~ */ p
         }
     };
 
     if is_positive(dt) {
         constrain_value(correction_rate, -error.abs() / dt, error.abs() / dt)
     } else {
         correction_rate
     }

---- control::tests::near_the_target_it_is_a_p_controller stdout ----

thread 'control::tests::near_the_target_it_is_a_p_controller' (4187192) panicked at crates/ap-math/src/control.rs:797:9:
assertion `left == right` failed
  left: 0.5
 right: 2.0

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (4187201) panicked at crates/ap-math/src/control.rs:854:13:
0.5 became 0.25 and came back as 0.125

---- control::tests::the_two_regimes_join_continuously stdout ----

thread 'control::tests::the_two_regimes_join_continuously' (4187205) panicked at crates/ap-math/src/control.rs:819:9:
a step at the join: 1.24995 then 5.0002

failures:
    control::tests::near_the_target_it_is_a_p_controller
    control::tests::the_inverse_round_trips
    control::tests::the_two_regimes_join_continuously

test result: FAILED. 143 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
