*** crates/ap-math/src/control.rs:351:42: delete - in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete - in sqrt_controller
@@ -343,17 +343,17 @@
         } else if error < -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };
 
     if is_positive(dt) {
-        constrain_value(correction_rate, -error.abs() / dt, error.abs() / dt)
+        constrain_value(correction_rate,  /* ~ changed by cargo-mutants ~ */error.abs() / dt, error.abs() / dt)
     } else {
         correction_rate
     }
 }
 
 /// The error that would produce a given output, upstream
 /// `inv_sqrt_controller`.
 ///

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (3592468) panicked at crates/ap-math/src/control.rs:953:9:
settled at 281.75835453061836, wanted 100

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (3592469) panicked at crates/ap-math/src/control.rs:933:9:
should have arrived, got 29.561264

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::a_velocity_demand_is_tracked_within_the_limits

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
