*** crates/ap-math/src/control.rs:351:55: replace / with * in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in sqrt_controller
@@ -343,17 +343,17 @@
         } else if error < -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };
 
     if is_positive(dt) {
-        constrain_value(correction_rate, -error.abs() / dt, error.abs() / dt)
+        constrain_value(correction_rate, -error.abs() * /* ~ changed by cargo-mutants ~ */ dt, error.abs() / dt)
     } else {
         correction_rate
     }
 }
 
 /// The error that would produce a given output, upstream
 /// `inv_sqrt_controller`.
 ///

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (4190329) panicked at crates/ap-math/tests/control_parity.rs:225:17:
sqrt_controller in row `sqrt,3245342720,0,1056964608,992204554,0,0,3229081334,0`: -0.037499998 against upstream -3.8729835

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
