*** crates/ap-math/src/control.rs:351:73: replace / with % in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with % in sqrt_controller
@@ -343,17 +343,17 @@
         } else if error < -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };
 
     if is_positive(dt) {
-        constrain_value(correction_rate, -error.abs() / dt, error.abs() / dt)
+        constrain_value(correction_rate, -error.abs() / dt, error.abs() % /* ~ changed by cargo-mutants ~ */ dt)
     } else {
         correction_rate
     }
 }
 
 /// The error that would produce a given output, upstream
 /// `inv_sqrt_controller`.
 ///

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (1807589) panicked at crates/ap-math/src/control.rs:1045:9:
should have arrived, got 0.009996397

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (1807587) panicked at crates/ap-math/src/control.rs:1065:9:
settled at 0.00000377518910851804, wanted 100

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::a_velocity_demand_is_tracked_within_the_limits

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
