*** crates/ap-math/src/control.rs:364:27: replace && with || in inv_sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace && with || in inv_sqrt_controller
@@ -356,17 +356,17 @@
 
 /// The error that would produce a given output, upstream
 /// `inv_sqrt_controller`.
 ///
 /// Used to work out how far ahead of a stop the braking must begin — see
 /// [`stopping_distance`], which is this function under another name.
 #[must_use]
 pub fn inv_sqrt_controller(output: f32, p: f32, d_max: f32) -> f32 {
-    if is_positive(d_max) && is_zero(p) {
+    if is_positive(d_max) || /* ~ changed by cargo-mutants ~ */ is_zero(p) {
         return (output * output) / (2.0 * d_max);
     }
     if (is_negative(d_max) || is_zero(d_max)) && !is_zero(p) {
         return output / p;
     }
     if (is_negative(d_max) || is_zero(d_max)) && is_zero(p) {
         return 0.0;
     }

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (9935) panicked at crates/ap-math/src/control.rs:854:13:
0.5 became 1 and came back as 0.05

failures:
    control::tests::the_inverse_round_trips

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
