*** crates/ap-math/src/control.rs:364:5: replace inv_sqrt_controller -> f32 with 0.0

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace inv_sqrt_controller -> f32 with 0.0
@@ -356,38 +356,17 @@
 
 /// The error that would produce a given output, upstream
 /// `inv_sqrt_controller`.
 ///
 /// Used to work out how far ahead of a stop the braking must begin — see
 /// [`stopping_distance`], which is this function under another name.
 #[must_use]
 pub fn inv_sqrt_controller(output: f32, p: f32, d_max: f32) -> f32 {
-    if is_positive(d_max) && is_zero(p) {
-        return (output * output) / (2.0 * d_max);
-    }
-    if (is_negative(d_max) || is_zero(d_max)) && !is_zero(p) {
-        return output / p;
-    }
-    if (is_negative(d_max) || is_zero(d_max)) && is_zero(p) {
-        return 0.0;
-    }
-
-    let linear_velocity = d_max / p;
-    if output.abs() < linear_velocity {
-        return output / p;
-    }
-
-    let linear_dist = d_max / sq(p);
-    let stopping_dist = (linear_dist * 0.5) + sq(output) / (2.0 * d_max);
-    if is_positive(output) {
-        stopping_dist
-    } else {
-        -stopping_dist
-    }
+    0.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// The rate of change [`sqrt_controller`] implies, upstream
 /// `sqrt_controller_accel`.
 ///
 /// Differentiating the controller's own response with respect to time, via the
 /// chain rule and the actual closing rate. In the linear region the slope is
 /// `p`; in the square-root region it is `second_ord_lim / |rate_cmd|`.

---- control::tests::stopping_distance_grows_with_the_square_of_speed stdout ----

thread 'control::tests::stopping_distance_grows_with_the_square_of_speed' (4766) panicked at crates/ap-math/src/control.rs:847:9:
expected about four times, got NaN

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (4772) panicked at crates/ap-math/src/control.rs:833:13:
0.5 became 1 and came back as 0

failures:
    control::tests::stopping_distance_grows_with_the_square_of_speed
    control::tests::the_inverse_round_trips

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
