*** crates/ap-math/src/control.rs:365:24: replace * with + in inv_sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with + in inv_sqrt_controller
@@ -357,17 +357,17 @@
 /// The error that would produce a given output, upstream
 /// `inv_sqrt_controller`.
 ///
 /// Used to work out how far ahead of a stop the braking must begin — see
 /// [`stopping_distance`], which is this function under another name.
 #[must_use]
 pub fn inv_sqrt_controller(output: f32, p: f32, d_max: f32) -> f32 {
     if is_positive(d_max) && is_zero(p) {
-        return (output * output) / (2.0 * d_max);
+        return (output + /* ~ changed by cargo-mutants ~ */ output) / (2.0 * d_max);
     }
     if (is_negative(d_max) || is_zero(d_max)) && !is_zero(p) {
         return output / p;
     }
     if (is_negative(d_max) || is_zero(d_max)) && is_zero(p) {
         return 0.0;
     }

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (15796) panicked at crates/ap-math/tests/control_parity.rs:225:17:
inv_sqrt_controller in row `inv,3248488448,0,1056964608,0,0,0,1137180672,1137180672`: -40 against upstream 400

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
