*** crates/ap-math/src/control.rs:368:23: replace / with % in inv_sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with % in inv_sqrt_controller
@@ -360,17 +360,17 @@
 /// Used to work out how far ahead of a stop the braking must begin — see
 /// [`stopping_distance`], which is this function under another name.
 #[must_use]
 pub fn inv_sqrt_controller(output: f32, p: f32, d_max: f32) -> f32 {
     if is_positive(d_max) && is_zero(p) {
         return (output * output) / (2.0 * d_max);
     }
     if (is_negative(d_max) || is_zero(d_max)) && !is_zero(p) {
-        return output / p;
+        return output % /* ~ changed by cargo-mutants ~ */ p;
     }
     if (is_negative(d_max) || is_zero(d_max)) && is_zero(p) {
         return 0.0;
     }
 
     let linear_velocity = d_max / p;
     if output.abs() < linear_velocity {
         return output / p;

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (26590) panicked at crates/ap-math/tests/control_parity.rs:225:17:
inv_sqrt_controller in row `inv,3248488448,1056964608,3212836864,0,0,0,3256877056,3256877056`: -0 against upstream -40

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
