*** crates/ap-math/src/control.rs:370:47: replace && with || in inv_sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace && with || in inv_sqrt_controller
@@ -362,17 +362,17 @@
 #[must_use]
 pub fn inv_sqrt_controller(output: f32, p: f32, d_max: f32) -> f32 {
     if is_positive(d_max) && is_zero(p) {
         return (output * output) / (2.0 * d_max);
     }
     if (is_negative(d_max) || is_zero(d_max)) && !is_zero(p) {
         return output / p;
     }
-    if (is_negative(d_max) || is_zero(d_max)) && is_zero(p) {
+    if (is_negative(d_max) || is_zero(d_max)) || /* ~ changed by cargo-mutants ~ */ is_zero(p) {
         return 0.0;
     }
 
     let linear_velocity = d_max / p;
     if output.abs() < linear_velocity {
         return output / p;
     }

*** result: Success
