*** crates/ap-math/src/control.rs:374:33: replace / with * in inv_sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in inv_sqrt_controller
@@ -366,17 +366,17 @@
     }
     if (is_negative(d_max) || is_zero(d_max)) && !is_zero(p) {
         return output / p;
     }
     if (is_negative(d_max) || is_zero(d_max)) && is_zero(p) {
         return 0.0;
     }
 
-    let linear_velocity = d_max / p;
+    let linear_velocity = d_max * /* ~ changed by cargo-mutants ~ */ p;
     if output.abs() < linear_velocity {
         return output / p;
     }
 
     let linear_dist = d_max / sq(p);
     let stopping_dist = (linear_dist * 0.5) + sq(output) / (2.0 * d_max);
     if is_positive(output) {
         stopping_dist

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (3627718) panicked at crates/ap-math/src/control.rs:854:13:
10 became 13.228757 and came back as 6.6143785

failures:
    control::tests::the_inverse_round_trips

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
