*** crates/ap-math/src/control.rs:375:21: replace < with > in inv_sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace < with > in inv_sqrt_controller
@@ -367,17 +367,17 @@
     if (is_negative(d_max) || is_zero(d_max)) && !is_zero(p) {
         return output / p;
     }
     if (is_negative(d_max) || is_zero(d_max)) && is_zero(p) {
         return 0.0;
     }
 
     let linear_velocity = d_max / p;
-    if output.abs() < linear_velocity {
+    if output.abs() > /* ~ changed by cargo-mutants ~ */ linear_velocity {
         return output / p;
     }
 
     let linear_dist = d_max / sq(p);
     let stopping_dist = (linear_dist * 0.5) + sq(output) / (2.0 * d_max);
     if is_positive(output) {
         stopping_dist
     } else {

---- control::tests::stopping_distance_grows_with_the_square_of_speed stdout ----

thread 'control::tests::stopping_distance_grows_with_the_square_of_speed' (3630958) panicked at crates/ap-math/src/control.rs:868:9:
expected about four times, got 2

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (3630967) panicked at crates/ap-math/src/control.rs:854:13:
0.5 became 1 and came back as 1.3

failures:
    control::tests::stopping_distance_grows_with_the_square_of_speed
    control::tests::the_inverse_round_trips

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
