*** crates/ap-math/src/control.rs:375:21: replace < with <= in inv_sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace < with <= in inv_sqrt_controller
@@ -367,17 +367,17 @@
     if (is_negative(d_max) || is_zero(d_max)) && !is_zero(p) {
         return output / p;
     }
     if (is_negative(d_max) || is_zero(d_max)) && is_zero(p) {
         return 0.0;
     }
 
     let linear_velocity = d_max / p;
-    if output.abs() < linear_velocity {
+    if output.abs() <= /* ~ changed by cargo-mutants ~ */ linear_velocity {
         return output / p;
     }
 
     let linear_dist = d_max / sq(p);
     let stopping_dist = (linear_dist * 0.5) + sq(output) / (2.0 * d_max);
     if is_positive(output) {
         stopping_dist
     } else {

*** result: Success
