*** crates/ap-math/src/control.rs:379:29: replace / with % in inv_sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with % in inv_sqrt_controller
@@ -371,17 +371,17 @@
         return 0.0;
     }
 
     let linear_velocity = d_max / p;
     if output.abs() < linear_velocity {
         return output / p;
     }
 
-    let linear_dist = d_max / sq(p);
+    let linear_dist = d_max % /* ~ changed by cargo-mutants ~ */ sq(p);
     let stopping_dist = (linear_dist * 0.5) + sq(output) / (2.0 * d_max);
     if is_positive(output) {
         stopping_dist
     } else {
         -stopping_dist
     }
 }

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (1852906) panicked at crates/ap-math/src/control.rs:966:13:
10 became 13.228757 and came back as 9.750001

failures:
    control::tests::the_inverse_round_trips

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
