*** crates/ap-math/src/control.rs:380:65: replace * with + in inv_sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with + in inv_sqrt_controller
@@ -372,17 +372,17 @@
     }
 
     let linear_velocity = d_max / p;
     if output.abs() < linear_velocity {
         return output / p;
     }
 
     let linear_dist = d_max / sq(p);
-    let stopping_dist = (linear_dist * 0.5) + sq(output) / (2.0 * d_max);
+    let stopping_dist = (linear_dist * 0.5) + sq(output) / (2.0 + /* ~ changed by cargo-mutants ~ */ d_max);
     if is_positive(output) {
         stopping_dist
     } else {
         -stopping_dist
     }
 }
 
 /// The rate of change [`sqrt_controller`] implies, upstream

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (3652743) panicked at crates/ap-math/src/control.rs:854:13:
10 became 13.228757 and came back as 15.833335

failures:
    control::tests::the_inverse_round_trips

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
