*** crates/ap-math/src/control.rs:405:30: replace * with / in sqrt_controller_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in sqrt_controller_accel
@@ -397,17 +397,17 @@
 #[must_use]
 pub fn sqrt_controller_accel(
     error: f32,
     rate_cmd: f32,
     rate_state: f32,
     p: f32,
     second_ord_lim: f32,
 ) -> f32 {
-    if !is_positive(rate_cmd * rate_state) {
+    if !is_positive(rate_cmd / /* ~ changed by cargo-mutants ~ */ rate_state) {
         return 0.0;
     }
     if !is_positive(second_ord_lim) {
         return -p * rate_state;
     }
     if !is_positive(p) {
         if is_zero(rate_cmd) {
             return 0.0;

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (3667731) panicked at crates/ap-math/tests/control_parity.rs:225:17:
loop angle accel in row `loop_angle,414,0,0,0,0,0,1079123296,953893336`: -0.0007028511 against upstream 0.00010454998

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
