*** crates/ap-math/src/control.rs:405:5: replace sqrt_controller_accel -> f32 with -1.0

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace sqrt_controller_accel -> f32 with -1.0
@@ -397,37 +397,17 @@
 #[must_use]
 pub fn sqrt_controller_accel(
     error: f32,
     rate_cmd: f32,
     rate_state: f32,
     p: f32,
     second_ord_lim: f32,
 ) -> f32 {
-    if !is_positive(rate_cmd * rate_state) {
-        return 0.0;
-    }
-    if !is_positive(second_ord_lim) {
-        return -p * rate_state;
-    }
-    if !is_positive(p) {
-        if is_zero(rate_cmd) {
-            return 0.0;
-        }
-        return -(second_ord_lim / rate_cmd.abs()) * rate_state;
-    }
-
-    let linear_dist = second_ord_lim / sq(p);
-    if error.abs() <= linear_dist {
-        return -p * rate_state;
-    }
-    if is_zero(rate_cmd) {
-        return 0.0;
-    }
-    -(second_ord_lim / rate_cmd.abs()) * rate_state
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// How far it takes to stop from a velocity, upstream `stopping_distance`.
 ///
 /// Literally [`inv_sqrt_controller`]: the distance at which the controller
 /// would command exactly this speed is the distance it needs to shed it.
 #[must_use]
 pub fn stopping_distance(velocity: f32, p: f32, accel_max: f32) -> f32 {

---- control::tests::the_implied_rate_is_zero_when_moving_away stdout ----

thread 'control::tests::the_implied_rate_is_zero_when_moving_away' (68032) panicked at crates/ap-math/src/control.rs:985:9:
assertion `left == right` failed
  left: -1.0
 right: 0.0

failures:
    control::tests::the_implied_rate_is_zero_when_moving_away

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
