*** crates/ap-math/src/control.rs:405:8: delete ! in sqrt_controller_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in sqrt_controller_accel
@@ -397,17 +397,17 @@
 #[must_use]
 pub fn sqrt_controller_accel(
     error: f32,
     rate_cmd: f32,
     rate_state: f32,
     p: f32,
     second_ord_lim: f32,
 ) -> f32 {
-    if !is_positive(rate_cmd * rate_state) {
+    if  /* ~ changed by cargo-mutants ~ */is_positive(rate_cmd * rate_state) {
         return 0.0;
     }
     if !is_positive(second_ord_lim) {
         return -p * rate_state;
     }
     if !is_positive(p) {
         if is_zero(rate_cmd) {
             return 0.0;

---- control::tests::the_implied_rate_is_zero_when_moving_away stdout ----

thread 'control::tests::the_implied_rate_is_zero_when_moving_away' (1876142) panicked at crates/ap-math/src/control.rs:1117:9:
assertion `left == right` failed
  left: 10.0
 right: 0.0

failures:
    control::tests::the_implied_rate_is_zero_when_moving_away

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
