*** crates/ap-math/src/control.rs:409:19: replace * with / in sqrt_controller_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in sqrt_controller_accel
@@ -401,17 +401,17 @@
     rate_state: f32,
     p: f32,
     second_ord_lim: f32,
 ) -> f32 {
     if !is_positive(rate_cmd * rate_state) {
         return 0.0;
     }
     if !is_positive(second_ord_lim) {
-        return -p * rate_state;
+        return -p / /* ~ changed by cargo-mutants ~ */ rate_state;
     }
     if !is_positive(p) {
         if is_zero(rate_cmd) {
             return 0.0;
         }
         return -(second_ord_lim / rate_cmd.abs()) * rate_state;
     }

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (78596) panicked at crates/ap-math/tests/control_parity.rs:225:17:
sqrt_controller_accel in row `sqrt_accel,3242196992,3231711232,3231711232,1056964608,3212836864,0,1075838976,0`: 0.1 against upstream 2.5

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
