*** crates/ap-math/src/control.rs:411:8: delete ! in sqrt_controller_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in sqrt_controller_accel
@@ -403,17 +403,17 @@
     second_ord_lim: f32,
 ) -> f32 {
     if !is_positive(rate_cmd * rate_state) {
         return 0.0;
     }
     if !is_positive(second_ord_lim) {
         return -p * rate_state;
     }
-    if !is_positive(p) {
+    if  /* ~ changed by cargo-mutants ~ */is_positive(p) {
         if is_zero(rate_cmd) {
             return 0.0;
         }
         return -(second_ord_lim / rate_cmd.abs()) * rate_state;
     }
 
     let linear_dist = second_ord_lim / sq(p);
     if error.abs() <= linear_dist {

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (3675519) panicked at crates/ap-math/tests/control_parity.rs:225:17:
sqrt_controller_accel in row `sqrt_accel,3242196992,3231711232,3231711232,0,1056964608,0,1056964608,0`: 0 against upstream 0.5

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
