*** crates/ap-math/src/control.rs:415:16: delete - in sqrt_controller_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete - in sqrt_controller_accel
@@ -407,17 +407,17 @@
     }
     if !is_positive(second_ord_lim) {
         return -p * rate_state;
     }
     if !is_positive(p) {
         if is_zero(rate_cmd) {
             return 0.0;
         }
-        return -(second_ord_lim / rate_cmd.abs()) * rate_state;
+        return  /* ~ changed by cargo-mutants ~ */(second_ord_lim / rate_cmd.abs()) * rate_state;
     }
 
     let linear_dist = second_ord_lim / sq(p);
     if error.abs() <= linear_dist {
         return -p * rate_state;
     }
     if is_zero(rate_cmd) {
         return 0.0;

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (88786) panicked at crates/ap-math/tests/control_parity.rs:225:17:
sqrt_controller_accel in row `sqrt_accel,3242196992,3231711232,3231711232,0,1056964608,0,1056964608,0`: -0.5 against upstream 0.5

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
