*** crates/ap-math/src/control.rs:419:20: replace <= with > in sqrt_controller_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace <= with > in sqrt_controller_accel
@@ -411,17 +411,17 @@
     if !is_positive(p) {
         if is_zero(rate_cmd) {
             return 0.0;
         }
         return -(second_ord_lim / rate_cmd.abs()) * rate_state;
     }
 
     let linear_dist = second_ord_lim / sq(p);
-    if error.abs() <= linear_dist {
+    if error.abs() > /* ~ changed by cargo-mutants ~ */ linear_dist {
         return -p * rate_state;
     }
     if is_zero(rate_cmd) {
         return 0.0;
     }
     -(second_ord_lim / rate_cmd.abs()) * rate_state
 }

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (1902892) panicked at crates/ap-math/tests/control_parity.rs:239:17:
sqrt_controller_accel in row `sqrt_accel,3242196992,3231711232,3231711232,1056964608,1056964608,0,1056964608,0`: 2.5 against upstream 0.5

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
