*** crates/ap-math/src/control.rs:420:16: delete - in sqrt_controller_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete - in sqrt_controller_accel
@@ -412,17 +412,17 @@
         if is_zero(rate_cmd) {
             return 0.0;
         }
         return -(second_ord_lim / rate_cmd.abs()) * rate_state;
     }
 
     let linear_dist = second_ord_lim / sq(p);
     if error.abs() <= linear_dist {
-        return -p * rate_state;
+        return  /* ~ changed by cargo-mutants ~ */p * rate_state;
     }
     if is_zero(rate_cmd) {
         return 0.0;
     }
     -(second_ord_lim / rate_cmd.abs()) * rate_state
 }
 
 /// How far it takes to stop from a velocity, upstream `stopping_distance`.

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (101190) panicked at crates/ap-math/tests/control_parity.rs:225:17:
sqrt_controller_accel in row `sqrt_accel,0,3231711232,3231711232,1056964608,1056964608,0,1075838976,0`: -2.5 against upstream 2.5

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
