*** crates/ap-math/src/control.rs:420:19: replace * with / in sqrt_controller_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in sqrt_controller_accel
@@ -412,17 +412,17 @@
         if is_zero(rate_cmd) {
             return 0.0;
         }
         return -(second_ord_lim / rate_cmd.abs()) * rate_state;
     }
 
     let linear_dist = second_ord_lim / sq(p);
     if error.abs() <= linear_dist {
-        return -p * rate_state;
+        return -p / /* ~ changed by cargo-mutants ~ */ rate_state;
     }
     if is_zero(rate_cmd) {
         return 0.0;
     }
     -(second_ord_lim / rate_cmd.abs()) * rate_state
 }
 
 /// How far it takes to stop from a velocity, upstream `stopping_distance`.

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (97466) panicked at crates/ap-math/src/control.rs:954:9:
should have stopped, still moving at -0.32186353

failures:
    control::tests::a_position_demand_is_tracked_and_settles

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
