*** crates/ap-math/src/control.rs:425:22: replace / with % in sqrt_controller_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with % in sqrt_controller_accel
@@ -417,17 +417,17 @@
 
     let linear_dist = second_ord_lim / sq(p);
     if error.abs() <= linear_dist {
         return -p * rate_state;
     }
     if is_zero(rate_cmd) {
         return 0.0;
     }
-    -(second_ord_lim / rate_cmd.abs()) * rate_state
+    -(second_ord_lim % /* ~ changed by cargo-mutants ~ */ rate_cmd.abs()) * rate_state
 }
 
 /// How far it takes to stop from a velocity, upstream `stopping_distance`.
 ///
 /// Literally [`inv_sqrt_controller`]: the distance at which the controller
 /// would command exactly this speed is the distance it needs to shed it.
 #[must_use]
 pub fn stopping_distance(velocity: f32, p: f32, accel_max: f32) -> f32 {

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (1918046) panicked at crates/ap-math/tests/control_parity.rs:239:17:
sqrt_controller_accel in row `sqrt_accel,3242196992,3231711232,3231711232,1056964608,1056964608,0,1056964608,0`: 2.5 against upstream 0.5

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
