*** crates/ap-math/src/control.rs:425:40: replace * with / in sqrt_controller_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in sqrt_controller_accel
@@ -417,17 +417,17 @@
 
     let linear_dist = second_ord_lim / sq(p);
     if error.abs() <= linear_dist {
         return -p * rate_state;
     }
     if is_zero(rate_cmd) {
         return 0.0;
     }
-    -(second_ord_lim / rate_cmd.abs()) * rate_state
+    -(second_ord_lim / rate_cmd.abs()) / /* ~ changed by cargo-mutants ~ */ rate_state
 }
 
 /// How far it takes to stop from a velocity, upstream `stopping_distance`.
 ///
 /// Literally [`inv_sqrt_controller`]: the distance at which the controller
 /// would command exactly this speed is the distance it needs to shed it.
 #[must_use]
 pub fn stopping_distance(velocity: f32, p: f32, accel_max: f32) -> f32 {

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (104481) panicked at crates/ap-math/src/control.rs:953:9:
settled at 0.014999998256826075, wanted 100

failures:
    control::tests::a_position_demand_is_tracked_and_settles

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
