*** crates/ap-math/src/control.rs:434:5: replace stopping_distance -> f32 with 0.0

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace stopping_distance -> f32 with 0.0
@@ -426,17 +426,17 @@
 }
 
 /// How far it takes to stop from a velocity, upstream `stopping_distance`.
 ///
 /// Literally [`inv_sqrt_controller`]: the distance at which the controller
 /// would command exactly this speed is the distance it needs to shed it.
 #[must_use]
 pub fn stopping_distance(velocity: f32, p: f32, accel_max: f32) -> f32 {
-    inv_sqrt_controller(velocity, p, accel_max)
+    0.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// The fastest travel possible in a direction, given separate horizontal and
 /// vertical limits. Upstream `kinematic_limit`.
 ///
 /// A multirotor can usually move faster sideways than it can climb, and faster
 /// down than up. So the speed available along a diagonal is not either limit
 /// but whichever binds first — and which one that is depends on the slope of

---- control::tests::stopping_distance_grows_with_the_square_of_speed stdout ----

thread 'control::tests::stopping_distance_grows_with_the_square_of_speed' (1918039) panicked at crates/ap-math/src/control.rs:980:9:
expected about four times, got NaN

failures:
    control::tests::stopping_distance_grows_with_the_square_of_speed

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
