*** crates/ap-math/src/control.rs:455:24: replace || with && in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace || with && in kinematic_limit_xyz
@@ -447,17 +447,17 @@
 #[must_use]
 pub fn kinematic_limit_xyz(
     segment_length_xy: f32,
     segment_length_z: f32,
     max_xy: f32,
     max_z_neg: f32,
     max_z_pos: f32,
 ) -> f32 {
-    if is_zero(max_xy) || is_zero(max_z_pos) || is_zero(max_z_neg) {
+    if is_zero(max_xy) && /* ~ changed by cargo-mutants ~ */ is_zero(max_z_pos) || is_zero(max_z_neg) {
         return 0.0;
     }
 
     let max_xy = max_xy.abs();
     let max_z_pos = max_z_pos.abs();
     let max_z_neg = max_z_neg.abs();
 
     let length = safe_sqrt(sq(segment_length_xy) + sq(segment_length_z));

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (3719133) panicked at crates/ap-math/tests/control_parity.rs:225:17:
kinematic_limit in row `kin,3007036718,2147483648,3212836864,0,1073741824,1077936128,0,0`: 2 against upstream 0

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
