*** crates/ap-math/src/control.rs:455:46: replace || with && in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace || with && in kinematic_limit_xyz
@@ -447,17 +447,17 @@
 #[must_use]
 pub fn kinematic_limit_xyz(
     segment_length_xy: f32,
     segment_length_z: f32,
     max_xy: f32,
     max_z_neg: f32,
     max_z_pos: f32,
 ) -> f32 {
-    if is_zero(max_xy) || is_zero(max_z_pos) || is_zero(max_z_neg) {
+    if is_zero(max_xy) || is_zero(max_z_pos) && /* ~ changed by cargo-mutants ~ */ is_zero(max_z_neg) {
         return 0.0;
     }
 
     let max_xy = max_xy.abs();
     let max_z_pos = max_z_pos.abs();
     let max_z_neg = max_z_neg.abs();
 
     let length = safe_sqrt(sq(segment_length_xy) + sq(segment_length_z));

---- control::tests::a_degenerate_direction_or_limit_gives_zero stdout ----

thread 'control::tests::a_degenerate_direction_or_limit_gives_zero' (1928061) panicked at crates/ap-math/src/control.rs:1149:9:
assertion `left == right` failed
  left: 4.242641
 right: 0.0

failures:
    control::tests::a_degenerate_direction_or_limit_gives_zero

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
