*** crates/ap-math/src/control.rs:455:5: replace kinematic_limit_xyz -> f32 with -1.0

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace kinematic_limit_xyz -> f32 with -1.0
@@ -447,57 +447,17 @@
 #[must_use]
 pub fn kinematic_limit_xyz(
     segment_length_xy: f32,
     segment_length_z: f32,
     max_xy: f32,
     max_z_neg: f32,
     max_z_pos: f32,
 ) -> f32 {
-    if is_zero(max_xy) || is_zero(max_z_pos) || is_zero(max_z_neg) {
-        return 0.0;
-    }
-
-    let max_xy = max_xy.abs();
-    let max_z_pos = max_z_pos.abs();
-    let max_z_neg = max_z_neg.abs();
-
-    let length = safe_sqrt(sq(segment_length_xy) + sq(segment_length_z));
-    if !is_positive(length) {
-        return 0.0;
-    }
-    let segment_length_xy = segment_length_xy / length;
-    let segment_length_z = segment_length_z / length;
-
-    if is_zero(segment_length_xy) {
-        // Straight up or straight down: the vertical limit is the answer, and
-        // which one depends on the direction.
-        return if is_positive(segment_length_z) {
-            max_z_pos
-        } else {
-            max_z_neg
-        };
-    }
-    if is_zero(segment_length_z) {
-        return max_xy;
-    }
-
-    // Which limit binds is decided by comparing the direction's slope against
-    // the slope the two limits themselves describe.
-    let slope = segment_length_z / segment_length_xy;
-    if is_positive(slope) {
-        if slope.abs() < max_z_pos / max_xy {
-            return max_xy / segment_length_xy;
-        }
-        return (max_z_pos / segment_length_z).abs();
-    }
-    if slope.abs() < max_z_neg / max_xy {
-        return max_xy / segment_length_xy;
-    }
-    (max_z_neg / segment_length_z).abs()
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// [`kinematic_limit_xyz`] for a direction vector, upstream's `Vector3f`
 /// overload of `kinematic_limit`.
 #[must_use]
 pub fn kinematic_limit(direction: Vector3f, max_xy: f32, max_z_neg: f32, max_z_pos: f32) -> f32 {
     if is_zero(direction.x * direction.x + direction.y * direction.y + direction.z * direction.z) {
         return 0.0;

---- control::tests::a_degenerate_direction_or_limit_gives_zero stdout ----

thread 'control::tests::a_degenerate_direction_or_limit_gives_zero' (120144) panicked at crates/ap-math/src/control.rs:993:9:
assertion `left == right` failed
  left: -1.0
 right: 0.0

---- control::tests::climbing_and_descending_differ stdout ----

thread 'control::tests::climbing_and_descending_differ' (120151) panicked at crates/ap-math/src/control.rs:1030:9:
a higher climb limit should allow more: -1 vs -1

---- control::tests::the_binding_limit_decides_on_a_diagonal stdout ----

thread 'control::tests::the_binding_limit_decides_on_a_diagonal' (120157) panicked at crates/ap-math/src/control.rs:1010:9:
along a shallow slope, faster than 5: -1

failures:
    control::tests::a_degenerate_direction_or_limit_gives_zero
    control::tests::climbing_and_descending_differ
    control::tests::the_binding_limit_decides_on_a_diagonal
    control::tests::the_pure_axes_return_their_own_limits
    spline::tests::the_destination_speed_can_only_be_lowered

test result: FAILED. 141 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
