*** crates/ap-math/src/control.rs:464:8: delete ! in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in kinematic_limit_xyz
@@ -456,17 +456,17 @@
         return 0.0;
     }
 
     let max_xy = max_xy.abs();
     let max_z_pos = max_z_pos.abs();
     let max_z_neg = max_z_neg.abs();
 
     let length = safe_sqrt(sq(segment_length_xy) + sq(segment_length_z));
-    if !is_positive(length) {
+    if  /* ~ changed by cargo-mutants ~ */is_positive(length) {
         return 0.0;
     }
     let segment_length_xy = segment_length_xy / length;
     let segment_length_z = segment_length_z / length;
 
     if is_zero(segment_length_xy) {
         // Straight up or straight down: the vertical limit is the answer, and
         // which one depends on the direction.

---- control::tests::climbing_and_descending_differ stdout ----

thread 'control::tests::climbing_and_descending_differ' (3723098) panicked at crates/ap-math/src/control.rs:1070:9:
a higher climb limit should allow more: 0 vs 0

---- control::tests::the_pure_axes_return_their_own_limits stdout ----

thread 'control::tests::the_pure_axes_return_their_own_limits' (3723112) panicked at crates/ap-math/src/control.rs:1013:9:
assertion `left == right` failed
  left: 0.0
 right: 5.0

---- control::tests::the_binding_limit_decides_on_a_diagonal stdout ----

thread 'control::tests::the_binding_limit_decides_on_a_diagonal' (3723108) panicked at crates/ap-math/src/control.rs:1050:9:
along a shallow slope, faster than 5: 0

failures:
    control::tests::climbing_and_descending_differ
    control::tests::the_binding_limit_decides_on_a_diagonal
    control::tests::the_pure_axes_return_their_own_limits
    spline::tests::the_destination_speed_can_only_be_lowered
    spline::tests::the_target_walks_the_curve_to_the_end

test result: FAILED. 141 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
