*** crates/ap-math/src/control.rs:467:47: replace / with * in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in kinematic_limit_xyz
@@ -459,17 +459,17 @@
     let max_xy = max_xy.abs();
     let max_z_pos = max_z_pos.abs();
     let max_z_neg = max_z_neg.abs();
 
     let length = safe_sqrt(sq(segment_length_xy) + sq(segment_length_z));
     if !is_positive(length) {
         return 0.0;
     }
-    let segment_length_xy = segment_length_xy / length;
+    let segment_length_xy = segment_length_xy * /* ~ changed by cargo-mutants ~ */ length;
     let segment_length_z = segment_length_z / length;
 
     if is_zero(segment_length_xy) {
         // Straight up or straight down: the vertical limit is the answer, and
         // which one depends on the direction.
         return if is_positive(segment_length_z) {
             max_z_pos
         } else {

---- control::tests::climbing_and_descending_differ stdout ----

thread 'control::tests::climbing_and_descending_differ' (3727158) panicked at crates/ap-math/src/control.rs:1070:9:
a higher climb limit should allow more: 0.9805807 vs 0.9805807

---- control::tests::only_the_direction_matters_not_its_length stdout ----

thread 'control::tests::only_the_direction_matters_not_its_length' (3727162) panicked at crates/ap-math/src/control.rs:1082:9:
0.14142136 and 0.0014142136

---- control::tests::the_binding_limit_decides_on_a_diagonal stdout ----

thread 'control::tests::the_binding_limit_decides_on_a_diagonal' (3727164) panicked at crates/ap-math/src/control.rs:1050:9:
along a shallow slope, faster than 5: 0.049751863

failures:
    control::tests::climbing_and_descending_differ
    control::tests::only_the_direction_matters_not_its_length
    control::tests::the_binding_limit_decides_on_a_diagonal

test result: FAILED. 143 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
