*** crates/ap-math/src/control.rs:485:34: replace / with * in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in kinematic_limit_xyz
@@ -477,17 +477,17 @@
         };
     }
     if is_zero(segment_length_z) {
         return max_xy;
     }
 
     // Which limit binds is decided by comparing the direction's slope against
     // the slope the two limits themselves describe.
-    let slope = segment_length_z / segment_length_xy;
+    let slope = segment_length_z * /* ~ changed by cargo-mutants ~ */ segment_length_xy;
     if is_positive(slope) {
         if slope.abs() < max_z_pos / max_xy {
             return max_xy / segment_length_xy;
         }
         return (max_z_pos / segment_length_z).abs();
     }
     if slope.abs() < max_z_neg / max_xy {
         return max_xy / segment_length_xy;

---- control::tests::climbing_and_descending_differ stdout ----

thread 'control::tests::climbing_and_descending_differ' (3733093) panicked at crates/ap-math/src/control.rs:1070:9:
a higher climb limit should allow more: 25.495098 vs 25.495098

---- control::tests::the_binding_limit_decides_on_a_diagonal stdout ----

thread 'control::tests::the_binding_limit_decides_on_a_diagonal' (3733100) panicked at crates/ap-math/src/control.rs:1057:9:
steeper should be slower: 50.249374

failures:
    control::tests::climbing_and_descending_differ
    control::tests::the_binding_limit_decides_on_a_diagonal

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
