*** crates/ap-math/src/control.rs:487:24: replace < with == in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace < with == in kinematic_limit_xyz
@@ -479,17 +479,17 @@
     if is_zero(segment_length_z) {
         return max_xy;
     }
 
     // Which limit binds is decided by comparing the direction's slope against
     // the slope the two limits themselves describe.
     let slope = segment_length_z / segment_length_xy;
     if is_positive(slope) {
-        if slope.abs() < max_z_pos / max_xy {
+        if slope.abs() == /* ~ changed by cargo-mutants ~ */ max_z_pos / max_xy {
             return max_xy / segment_length_xy;
         }
         return (max_z_pos / segment_length_z).abs();
     }
     if slope.abs() < max_z_neg / max_xy {
         return max_xy / segment_length_xy;
     }
     (max_z_neg / segment_length_z).abs()

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (1949764) panicked at crates/ap-math/tests/control_parity.rs:239:17:
kinematic_limit in row `kin,1064781546,0,1048871918,1084227584,1073741824,1077936128,1084597481,0`: 11.591108 against upstream 5.1763806

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
