*** crates/ap-math/src/control.rs:487:24: replace < with > in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace < with > in kinematic_limit_xyz
@@ -479,17 +479,17 @@
     if is_zero(segment_length_z) {
         return max_xy;
     }
 
     // Which limit binds is decided by comparing the direction's slope against
     // the slope the two limits themselves describe.
     let slope = segment_length_z / segment_length_xy;
     if is_positive(slope) {
-        if slope.abs() < max_z_pos / max_xy {
+        if slope.abs() > /* ~ changed by cargo-mutants ~ */ max_z_pos / max_xy {
             return max_xy / segment_length_xy;
         }
         return (max_z_pos / segment_length_z).abs();
     }
     if slope.abs() < max_z_neg / max_xy {
         return max_xy / segment_length_xy;
     }
     (max_z_neg / segment_length_z).abs()

---- control::tests::the_binding_limit_decides_on_a_diagonal stdout ----

thread 'control::tests::the_binding_limit_decides_on_a_diagonal' (3738661) panicked at crates/ap-math/src/control.rs:1057:9:
steeper should be slower: 50.249374

failures:
    control::tests::the_binding_limit_decides_on_a_diagonal

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
