*** crates/ap-math/src/control.rs:487:36: replace / with % in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with % in kinematic_limit_xyz
@@ -479,17 +479,17 @@
     if is_zero(segment_length_z) {
         return max_xy;
     }
 
     // Which limit binds is decided by comparing the direction's slope against
     // the slope the two limits themselves describe.
     let slope = segment_length_z / segment_length_xy;
     if is_positive(slope) {
-        if slope.abs() < max_z_pos / max_xy {
+        if slope.abs() < max_z_pos % /* ~ changed by cargo-mutants ~ */ max_xy {
             return max_xy / segment_length_xy;
         }
         return (max_z_pos / segment_length_z).abs();
     }
     if slope.abs() < max_z_neg / max_xy {
         return max_xy / segment_length_xy;
     }
     (max_z_neg / segment_length_z).abs()

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (1955525) panicked at crates/ap-math/tests/control_parity.rs:239:17:
kinematic_limit in row `kin,1060439283,0,1060439283,1084227584,1073741824,1077936128,1082639286,0`: 7.0710673 against upstream 4.2426405

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
