*** crates/ap-math/src/control.rs:490:27: replace / with * in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in kinematic_limit_xyz
@@ -482,17 +482,17 @@
 
     // Which limit binds is decided by comparing the direction's slope against
     // the slope the two limits themselves describe.
     let slope = segment_length_z / segment_length_xy;
     if is_positive(slope) {
         if slope.abs() < max_z_pos / max_xy {
             return max_xy / segment_length_xy;
         }
-        return (max_z_pos / segment_length_z).abs();
+        return (max_z_pos * /* ~ changed by cargo-mutants ~ */ segment_length_z).abs();
     }
     if slope.abs() < max_z_neg / max_xy {
         return max_xy / segment_length_xy;
     }
     (max_z_neg / segment_length_z).abs()
 }
 
 /// [`kinematic_limit_xyz`] for a direction vector, upstream's `Vector3f`

---- control::tests::the_binding_limit_decides_on_a_diagonal stdout ----

thread 'control::tests::the_binding_limit_decides_on_a_diagonal' (3749779) panicked at crates/ap-math/src/control.rs:1058:9:
but still faster than the vertical limit alone

failures:
    control::tests::the_binding_limit_decides_on_a_diagonal

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
