*** crates/ap-math/src/control.rs:492:20: replace < with > in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace < with > in kinematic_limit_xyz
@@ -484,17 +484,17 @@
     // the slope the two limits themselves describe.
     let slope = segment_length_z / segment_length_xy;
     if is_positive(slope) {
         if slope.abs() < max_z_pos / max_xy {
             return max_xy / segment_length_xy;
         }
         return (max_z_pos / segment_length_z).abs();
     }
-    if slope.abs() < max_z_neg / max_xy {
+    if slope.abs() > /* ~ changed by cargo-mutants ~ */ max_z_neg / max_xy {
         return max_xy / segment_length_xy;
     }
     (max_z_neg / segment_length_z).abs()
 }
 
 /// [`kinematic_limit_xyz`] for a direction vector, upstream's `Vector3f`
 /// overload of `kinematic_limit`.
 #[must_use]

---- control::tests::climbing_and_descending_differ stdout ----

thread 'control::tests::climbing_and_descending_differ' (1964958) panicked at crates/ap-math/src/control.rs:1182:9:
a higher climb limit should allow more: 4.0792155 vs 25.495098

failures:
    control::tests::climbing_and_descending_differ

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
