*** crates/ap-math/src/control.rs:492:32: replace / with * in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in kinematic_limit_xyz
@@ -484,17 +484,17 @@
     // the slope the two limits themselves describe.
     let slope = segment_length_z / segment_length_xy;
     if is_positive(slope) {
         if slope.abs() < max_z_pos / max_xy {
             return max_xy / segment_length_xy;
         }
         return (max_z_pos / segment_length_z).abs();
     }
-    if slope.abs() < max_z_neg / max_xy {
+    if slope.abs() < max_z_neg * /* ~ changed by cargo-mutants ~ */ max_xy {
         return max_xy / segment_length_xy;
     }
     (max_z_neg / segment_length_z).abs()
 }
 
 /// [`kinematic_limit_xyz`] for a direction vector, upstream's `Vector3f`
 /// overload of `kinematic_limit`.
 #[must_use]

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (1971138) panicked at crates/ap-math/tests/control_parity.rs:239:17:
kinematic_limit in row `kin,1048871915,0,3212265195,1084227584,1073741824,1077936128,1074037742,0`: 19.318523 against upstream 2.0705523

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
