*** crates/ap-math/src/control.rs:493:23: replace / with * in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in kinematic_limit_xyz
@@ -485,17 +485,17 @@
     let slope = segment_length_z / segment_length_xy;
     if is_positive(slope) {
         if slope.abs() < max_z_pos / max_xy {
             return max_xy / segment_length_xy;
         }
         return (max_z_pos / segment_length_z).abs();
     }
     if slope.abs() < max_z_neg / max_xy {
-        return max_xy / segment_length_xy;
+        return max_xy * /* ~ changed by cargo-mutants ~ */ segment_length_xy;
     }
     (max_z_neg / segment_length_z).abs()
 }
 
 /// [`kinematic_limit_xyz`] for a direction vector, upstream's `Vector3f`
 /// overload of `kinematic_limit`.
 #[must_use]
 pub fn kinematic_limit(direction: Vector3f, max_xy: f32, max_z_neg: f32, max_z_pos: f32) -> f32 {

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (1974373) panicked at crates/ap-math/tests/control_parity.rs:239:17:
kinematic_limit in row `kin,1064781546,0,3196355566,1084227584,1073741824,1077936128,1084597481,0`: 4.8296294 against upstream 5.1763806

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
