*** crates/ap-math/src/control.rs:495:16: replace / with * in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in kinematic_limit_xyz
@@ -487,17 +487,17 @@
         if slope.abs() < max_z_pos / max_xy {
             return max_xy / segment_length_xy;
         }
         return (max_z_pos / segment_length_z).abs();
     }
     if slope.abs() < max_z_neg / max_xy {
         return max_xy / segment_length_xy;
     }
-    (max_z_neg / segment_length_z).abs()
+    (max_z_neg * /* ~ changed by cargo-mutants ~ */ segment_length_z).abs()
 }
 
 /// [`kinematic_limit_xyz`] for a direction vector, upstream's `Vector3f`
 /// overload of `kinematic_limit`.
 #[must_use]
 pub fn kinematic_limit(direction: Vector3f, max_xy: f32, max_z_neg: f32, max_z_pos: f32) -> f32 {
     if is_zero(direction.x * direction.x + direction.y * direction.y + direction.z * direction.z) {
         return 0.0;

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (3767652) panicked at crates/ap-math/tests/control_parity.rs:225:17:
kinematic_limit in row `kin,1048871915,0,3212265195,1084227584,1073741824,1077936128,1074037742,0`: 1.9318517 against upstream 2.0705523

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
