*** crates/ap-math/src/control.rs:502:42: replace + with * in kinematic_limit

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace + with * in kinematic_limit
@@ -494,17 +494,17 @@
     }
     (max_z_neg / segment_length_z).abs()
 }
 
 /// [`kinematic_limit_xyz`] for a direction vector, upstream's `Vector3f`
 /// overload of `kinematic_limit`.
 #[must_use]
 pub fn kinematic_limit(direction: Vector3f, max_xy: f32, max_z_neg: f32, max_z_pos: f32) -> f32 {
-    if is_zero(direction.x * direction.x + direction.y * direction.y + direction.z * direction.z) {
+    if is_zero(direction.x * direction.x * /* ~ changed by cargo-mutants ~ */ direction.y * direction.y + direction.z * direction.z) {
         return 0.0;
     }
     let segment_length_xy = safe_sqrt(sq(direction.x) + sq(direction.y));
     kinematic_limit_xyz(segment_length_xy, direction.z, max_xy, max_z_neg, max_z_pos)
 }
 
 /// Project velocity forward, suppressing motion that would worsen a limited
 /// error — upstream `update_vel_accel_xy`.

---- control::tests::the_pure_axes_return_their_own_limits stdout ----

thread 'control::tests::the_pure_axes_return_their_own_limits' (182788) panicked at crates/ap-math/src/control.rs:1013:9:
assertion `left == right` failed
  left: 0.0
 right: 5.0

---- spline::tests::the_destination_speed_can_only_be_lowered stdout ----

thread 'spline::tests::the_destination_speed_can_only_be_lowered' (182919) panicked at crates/ap-math/src/spline.rs:699:9:
assertion failed: before > 0.0

---- spline::tests::the_target_walks_the_curve_to_the_end stdout ----

thread 'spline::tests::the_target_walks_the_curve_to_the_end' (182920) panicked at crates/ap-math/src/spline.rs:658:9:
arrived implausibly fast: 1 steps

failures:
    control::tests::the_pure_axes_return_their_own_limits
    spline::tests::the_destination_speed_can_only_be_lowered
    spline::tests::the_target_walks_the_curve_to_the_end

test result: FAILED. 143 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
