*** crates/ap-math/src/control.rs:502:5: replace kinematic_limit -> f32 with 1.0

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace kinematic_limit -> f32 with 1.0
@@ -494,21 +494,17 @@
     }
     (max_z_neg / segment_length_z).abs()
 }
 
 /// [`kinematic_limit_xyz`] for a direction vector, upstream's `Vector3f`
 /// overload of `kinematic_limit`.
 #[must_use]
 pub fn kinematic_limit(direction: Vector3f, max_xy: f32, max_z_neg: f32, max_z_pos: f32) -> f32 {
-    if is_zero(direction.x * direction.x + direction.y * direction.y + direction.z * direction.z) {
-        return 0.0;
-    }
-    let segment_length_xy = safe_sqrt(sq(direction.x) + sq(direction.y));
-    kinematic_limit_xyz(segment_length_xy, direction.z, max_xy, max_z_neg, max_z_pos)
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Project velocity forward, suppressing motion that would worsen a limited
 /// error — upstream `update_vel_accel_xy`.
 ///
 /// `limit` is a direction, not a magnitude: a non-zero vector says "the
 /// vehicle cannot go further this way". The step is dropped only when all
 /// three of the following point the same way as the limit — the step itself,

---- control::tests::a_degenerate_direction_or_limit_gives_zero stdout ----

thread 'control::tests::a_degenerate_direction_or_limit_gives_zero' (3769769) panicked at crates/ap-math/src/control.rs:1028:9:
assertion `left == right` failed
  left: 1.0
 right: 0.0

---- control::tests::climbing_and_descending_differ stdout ----

thread 'control::tests::climbing_and_descending_differ' (3769782) panicked at crates/ap-math/src/control.rs:1066:9:
a higher climb limit should allow more: 1 vs 1

---- control::tests::the_pure_axes_return_their_own_limits stdout ----

thread 'control::tests::the_pure_axes_return_their_own_limits' (3769798) panicked at crates/ap-math/src/control.rs:1009:9:
assertion `left == right` failed
  left: 1.0
 right: 5.0

failures:
    control::tests::a_degenerate_direction_or_limit_gives_zero
    control::tests::climbing_and_descending_differ
    control::tests::the_binding_limit_decides_on_a_diagonal
    control::tests::the_pure_axes_return_their_own_limits

test result: FAILED. 142 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
