*** crates/ap-math/src/control.rs:502:84: replace * with / in kinematic_limit

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in kinematic_limit
@@ -494,17 +494,17 @@
     }
     (max_z_neg / segment_length_z).abs()
 }
 
 /// [`kinematic_limit_xyz`] for a direction vector, upstream's `Vector3f`
 /// overload of `kinematic_limit`.
 #[must_use]
 pub fn kinematic_limit(direction: Vector3f, max_xy: f32, max_z_neg: f32, max_z_pos: f32) -> f32 {
-    if is_zero(direction.x * direction.x + direction.y * direction.y + direction.z * direction.z) {
+    if is_zero(direction.x * direction.x + direction.y * direction.y + direction.z / /* ~ changed by cargo-mutants ~ */ direction.z) {
         return 0.0;
     }
     let segment_length_xy = safe_sqrt(sq(direction.x) + sq(direction.y));
     kinematic_limit_xyz(segment_length_xy, direction.z, max_xy, max_z_neg, max_z_pos)
 }
 
 /// Project velocity forward, suppressing motion that would worsen a limited
 /// error — upstream `update_vel_accel_xy`.

*** result: Success
