*** crates/ap-math/src/control.rs:505:55: replace + with - in kinematic_limit

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace + with - in kinematic_limit
@@ -497,17 +497,17 @@
 
 /// [`kinematic_limit_xyz`] for a direction vector, upstream's `Vector3f`
 /// overload of `kinematic_limit`.
 #[must_use]
 pub fn kinematic_limit(direction: Vector3f, max_xy: f32, max_z_neg: f32, max_z_pos: f32) -> f32 {
     if is_zero(direction.x * direction.x + direction.y * direction.y + direction.z * direction.z) {
         return 0.0;
     }
-    let segment_length_xy = safe_sqrt(sq(direction.x) + sq(direction.y));
+    let segment_length_xy = safe_sqrt(sq(direction.x) - /* ~ changed by cargo-mutants ~ */ sq(direction.y));
     kinematic_limit_xyz(segment_length_xy, direction.z, max_xy, max_z_neg, max_z_pos)
 }
 
 /// Project velocity forward, suppressing motion that would worsen a limited
 /// error — upstream `update_vel_accel_xy`.
 ///
 /// `limit` is a direction, not a magnitude: a non-zero vector says "the
 /// vehicle cannot go further this way". The step is dropped only when all

---- spline::tests::a_tighter_curve_is_flown_more_slowly stdout ----

thread 'spline::tests::a_tighter_curve_is_flown_more_slowly' (3790769) panicked at crates/ap-math/src/spline.rs:752:9:
a tighter turn should not be faster: 500.00006 against 412.50003

failures:
    spline::tests::a_tighter_curve_is_flown_more_slowly

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
