*** crates/ap-math/src/control.rs:505:55: replace + with * in kinematic_limit

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace + with * in kinematic_limit
@@ -497,17 +497,17 @@
 
 /// [`kinematic_limit_xyz`] for a direction vector, upstream's `Vector3f`
 /// overload of `kinematic_limit`.
 #[must_use]
 pub fn kinematic_limit(direction: Vector3f, max_xy: f32, max_z_neg: f32, max_z_pos: f32) -> f32 {
     if is_zero(direction.x * direction.x + direction.y * direction.y + direction.z * direction.z) {
         return 0.0;
     }
-    let segment_length_xy = safe_sqrt(sq(direction.x) + sq(direction.y));
+    let segment_length_xy = safe_sqrt(sq(direction.x) * /* ~ changed by cargo-mutants ~ */ sq(direction.y));
     kinematic_limit_xyz(segment_length_xy, direction.z, max_xy, max_z_neg, max_z_pos)
 }
 
 /// Project velocity forward, suppressing motion that would worsen a limited
 /// error — upstream `update_vel_accel_xy`.
 ///
 /// `limit` is a direction, not a magnitude: a non-zero vector says "the
 /// vehicle cannot go further this way". The step is dropped only when all

---- control::tests::only_the_direction_matters_not_its_length stdout ----

thread 'control::tests::only_the_direction_matters_not_its_length' (2003940) panicked at crates/ap-math/src/control.rs:1194:9:
5.4166665 and 5.0043387

---- control::tests::the_binding_limit_decides_on_a_diagonal stdout ----

thread 'control::tests::the_binding_limit_decides_on_a_diagonal' (2003942) panicked at crates/ap-math/src/control.rs:1162:9:
along a shallow slope, faster than 5: 3

---- control::tests::the_pure_axes_return_their_own_limits stdout ----

thread 'control::tests::the_pure_axes_return_their_own_limits' (2003946) panicked at crates/ap-math/src/control.rs:1125:9:
assertion `left == right` failed
  left: 0.0
 right: 5.0

failures:
    control::tests::only_the_direction_matters_not_its_length
    control::tests::the_binding_limit_decides_on_a_diagonal
    control::tests::the_pure_axes_return_their_own_limits
    spline::tests::the_destination_speed_can_only_be_lowered
    spline::tests::the_target_walks_the_curve_to_the_end

test result: FAILED. 141 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
