*** crates/ap-math/src/control.rs:529:31: replace * with / in update_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in update_vel_accel_xy
@@ -521,17 +521,17 @@
 /// being allowed one free step.
 pub fn update_vel_accel_xy(
     vel: &mut Vector2f,
     accel: Vector2f,
     dt: f32,
     limit: Vector2f,
     vel_error: Vector2f,
 ) {
-    let mut delta_vel = accel * dt;
+    let mut delta_vel = accel / /* ~ changed by cargo-mutants ~ */ dt;
     if !limit.is_zero()
         && !delta_vel.is_zero()
         && is_positive(delta_vel.dot(limit))
         && is_positive(vel_error.dot(limit))
         && !is_negative(vel.dot(limit))
     {
         delta_vel = Vector2f::new(0.0, 0.0);
     }

---- the_forward_projection_matches_upstream stdout ----

thread 'the_forward_projection_matches_upstream' (3798707) panicked at crates/ap-math/tests/control_xy_parity.rs:276:13:
row 0 uva_vel_x: 197 != upstream -2.98 (diff 199.98)

failures:
    the_forward_projection_matches_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
