*** crates/ap-math/src/control.rs:531:12: delete ! in update_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in update_vel_accel_xy
@@ -523,17 +523,17 @@
     vel: &mut Vector2f,
     accel: Vector2f,
     dt: f32,
     limit: Vector2f,
     vel_error: Vector2f,
 ) {
     let mut delta_vel = accel * dt;
     if !limit.is_zero()
-        && !delta_vel.is_zero()
+        &&  /* ~ changed by cargo-mutants ~ */delta_vel.is_zero()
         && is_positive(delta_vel.dot(limit))
         && is_positive(vel_error.dot(limit))
         && !is_negative(vel.dot(limit))
     {
         delta_vel = Vector2f::new(0.0, 0.0);
     }
     *vel += delta_vel;
 }

---- the_forward_projection_matches_upstream stdout ----

thread 'the_forward_projection_matches_upstream' (2019423) panicked at crates/ap-math/tests/control_xy_parity.rs:277:13:
row 52 uva_vel_x: 0.02 != upstream 0 (diff 0.02)

failures:
    the_forward_projection_matches_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
