*** crates/ap-math/src/control.rs:532:9: replace && with || in update_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace && with || in update_vel_accel_xy
@@ -524,17 +524,17 @@
     accel: Vector2f,
     dt: f32,
     limit: Vector2f,
     vel_error: Vector2f,
 ) {
     let mut delta_vel = accel * dt;
     if !limit.is_zero()
         && !delta_vel.is_zero()
-        && is_positive(delta_vel.dot(limit))
+        || /* ~ changed by cargo-mutants ~ */ is_positive(delta_vel.dot(limit))
         && is_positive(vel_error.dot(limit))
         && !is_negative(vel.dot(limit))
     {
         delta_vel = Vector2f::new(0.0, 0.0);
     }
     *vel += delta_vel;
 }

---- the_forward_projection_matches_upstream stdout ----

thread 'the_forward_projection_matches_upstream' (206098) panicked at crates/ap-math/tests/control_xy_parity.rs:276:13:
row 48 uva_vel_x: -3 != upstream -2.98 (diff 0.01999998)

failures:
    the_forward_projection_matches_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
