*** crates/ap-math/src/control.rs:538:10: replace += with -= in update_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with -= in update_vel_accel_xy
@@ -530,17 +530,17 @@
     if !limit.is_zero()
         && !delta_vel.is_zero()
         && is_positive(delta_vel.dot(limit))
         && is_positive(vel_error.dot(limit))
         && !is_negative(vel.dot(limit))
     {
         delta_vel = Vector2f::new(0.0, 0.0);
     }
-    *vel += delta_vel;
+    *vel -= /* ~ changed by cargo-mutants ~ */ delta_vel;
 }
 
 /// Project position and velocity forward — upstream `update_pos_vel_accel_xy`.
 ///
 /// Position and velocity are suppressed independently, against their own
 /// errors. A vehicle can be held in position while still being allowed to
 /// slow down, which is what happens when it arrives at a boundary with speed
 /// still on.

---- the_forward_projection_matches_upstream stdout ----

thread 'the_forward_projection_matches_upstream' (3811741) panicked at crates/ap-math/tests/control_xy_parity.rs:276:13:
row 0 uva_vel_x: -3.02 != upstream -2.98 (diff 0.03999996)

failures:
    the_forward_projection_matches_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
