*** crates/ap-math/src/control.rs:561:30: replace * with / in update_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in update_pos_vel_accel_xy
@@ -553,17 +553,17 @@
     pos: &mut Vector2<Postype>,
     vel: &mut Vector2f,
     accel: Vector2f,
     dt: f32,
     limit: Vector2f,
     pos_error: Vector2f,
     vel_error: Vector2f,
 ) {
-    let mut delta_pos = *vel * dt + accel * (0.5 * dt * dt);
+    let mut delta_pos = *vel / /* ~ changed by cargo-mutants ~ */ dt + accel * (0.5 * dt * dt);
 
     if !is_zero(limit.length_squared())
         && is_positive(delta_pos.dot(limit))
         && is_positive(pos_error.dot(limit))
     {
         delta_pos = Vector2f::new(0.0, 0.0);
     }

---- the_forward_projection_matches_upstream stdout ----

thread 'the_forward_projection_matches_upstream' (3818155) panicked at crates/ap-math/tests/control_xy_parity.rs:288:13:
row 0 upva_pos_x: -294.9999084472656 != upstream 4.970100000500679 (diff 299.9700084477663)

failures:
    the_forward_projection_matches_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
