*** crates/ap-math/src/control.rs:561:43: replace * with / in update_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in update_pos_vel_accel_xy
@@ -553,17 +553,17 @@
     pos: &mut Vector2<Postype>,
     vel: &mut Vector2f,
     accel: Vector2f,
     dt: f32,
     limit: Vector2f,
     pos_error: Vector2f,
     vel_error: Vector2f,
 ) {
-    let mut delta_pos = *vel * dt + accel * (0.5 * dt * dt);
+    let mut delta_pos = *vel * dt + accel / /* ~ changed by cargo-mutants ~ */ (0.5 * dt * dt);
 
     if !is_zero(limit.length_squared())
         && is_positive(delta_pos.dot(limit))
         && is_positive(pos_error.dot(limit))
     {
         delta_pos = Vector2f::new(0.0, 0.0);
     }

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2032623) panicked at crates/ap-math/tests/control_xy_parity.rs:413:13:
step 1 pos_x: the port has flown to 15992.755859375, upstream to -2.999999843791457 — the trajectories have diverged

---- the_forward_projection_matches_upstream stdout ----

thread 'the_forward_projection_matches_upstream' (2032622) panicked at crates/ap-math/tests/control_xy_parity.rs:289:13:
row 0 upva_pos_x: 40004.96875 != upstream 4.970100000500679 (diff 39999.9986499995)

failures:
    the_forward_projection_matches_upstream
    the_position_loop_matches_upstream

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
