*** crates/ap-math/src/control.rs:563:8: delete ! in update_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in update_pos_vel_accel_xy
@@ -555,17 +555,17 @@
     accel: Vector2f,
     dt: f32,
     limit: Vector2f,
     pos_error: Vector2f,
     vel_error: Vector2f,
 ) {
     let mut delta_pos = *vel * dt + accel * (0.5 * dt * dt);
 
-    if !is_zero(limit.length_squared())
+    if  /* ~ changed by cargo-mutants ~ */is_zero(limit.length_squared())
         && is_positive(delta_pos.dot(limit))
         && is_positive(pos_error.dot(limit))
     {
         delta_pos = Vector2f::new(0.0, 0.0);
     }
 
     // Widened per component, as the one-dimensional form does: the step is
     // computed in single precision because velocity and acceleration are, and

---- the_forward_projection_matches_upstream stdout ----

thread 'the_forward_projection_matches_upstream' (233285) panicked at crates/ap-math/tests/control_xy_parity.rs:288:13:
row 61 upva_pos_x: 5.000099999997474 != upstream 5 (diff 0.00009999999747378752)

failures:
    the_forward_projection_matches_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
