*** crates/ap-math/src/control.rs:564:9: replace && with || in update_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace && with || in update_pos_vel_accel_xy
@@ -556,17 +556,17 @@
     dt: f32,
     limit: Vector2f,
     pos_error: Vector2f,
     vel_error: Vector2f,
 ) {
     let mut delta_pos = *vel * dt + accel * (0.5 * dt * dt);
 
     if !is_zero(limit.length_squared())
-        && is_positive(delta_pos.dot(limit))
+        || /* ~ changed by cargo-mutants ~ */ is_positive(delta_pos.dot(limit))
         && is_positive(pos_error.dot(limit))
     {
         delta_pos = Vector2f::new(0.0, 0.0);
     }
 
     // Widened per component, as the one-dimensional form does: the step is
     // computed in single precision because velocity and acceleration are, and
     // only the accumulation needs the extra bits.

---- the_forward_projection_matches_upstream stdout ----

thread 'the_forward_projection_matches_upstream' (2040685) panicked at crates/ap-math/tests/control_xy_parity.rs:289:13:
row 48 upva_pos_x: 5 != upstream 4.970100000500679 (diff 0.029899999499320984)

failures:
    the_forward_projection_matches_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
