*** crates/ap-math/src/control.rs:573:11: replace += with *= in update_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with *= in update_pos_vel_accel_xy
@@ -565,17 +565,17 @@
         && is_positive(pos_error.dot(limit))
     {
         delta_pos = Vector2f::new(0.0, 0.0);
     }
 
     // Widened per component, as the one-dimensional form does: the step is
     // computed in single precision because velocity and acceleration are, and
     // only the accumulation needs the extra bits.
-    pos.x += Postype::from(delta_pos.x);
+    pos.x *= /* ~ changed by cargo-mutants ~ */ Postype::from(delta_pos.x);
     pos.y += Postype::from(delta_pos.y);
 
     update_vel_accel_xy(vel, accel, dt, limit, vel_error);
 }
 
 /// Jerk-limit a two-dimensional acceleration command — upstream
 /// `shape_accel_xy`.
 ///

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2047646) panicked at crates/ap-math/tests/control_xy_parity.rs:413:13:
step 1 pos_x: the port has flown to -0.00000046862562896876625, upstream to -2.999999843791457 — the trajectories have diverged

---- the_forward_projection_matches_upstream stdout ----

thread 'the_forward_projection_matches_upstream' (2047645) panicked at crates/ap-math/tests/control_xy_parity.rs:289:13:
row 0 upva_pos_x: -0.14949999749660492 != upstream 4.970100000500679 (diff 5.119599997997284)

failures:
    the_forward_projection_matches_upstream
    the_position_loop_matches_upstream

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
