*** crates/ap-math/src/control.rs:574:11: replace += with -= in update_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with -= in update_pos_vel_accel_xy
@@ -566,17 +566,17 @@
     {
         delta_pos = Vector2f::new(0.0, 0.0);
     }
 
     // Widened per component, as the one-dimensional form does: the step is
     // computed in single precision because velocity and acceleration are, and
     // only the accumulation needs the extra bits.
     pos.x += Postype::from(delta_pos.x);
-    pos.y += Postype::from(delta_pos.y);
+    pos.y -= /* ~ changed by cargo-mutants ~ */ Postype::from(delta_pos.y);
 
     update_vel_accel_xy(vel, accel, dt, limit, vel_error);
 }
 
 /// Jerk-limit a two-dimensional acceleration command — upstream
 /// `shape_accel_xy`.
 ///
 /// The limit is on the *length* of the change, not on each axis. Limiting per

---- the_forward_projection_matches_upstream stdout ----

thread 'the_forward_projection_matches_upstream' (3840486) panicked at crates/ap-math/tests/control_xy_parity.rs:288:13:
row 0 upva_pos_y: -2.009949999861419 != upstream -1.9900500001385808 (diff 0.019899999722838402)

failures:
    the_forward_projection_matches_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
