*** crates/ap-math/src/control.rs:587:8: delete ! in shape_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in shape_accel_xy
@@ -579,17 +579,17 @@
 /// Jerk-limit a two-dimensional acceleration command — upstream
 /// `shape_accel_xy`.
 ///
 /// The limit is on the *length* of the change, not on each axis. Limiting per
 /// axis would let a diagonal change move by `sqrt(2)` times the intended jerk,
 /// and would bend the commanded direction as one axis saturated before the
 /// other. Limiting the vector keeps the direction and caps the rate.
 pub fn shape_accel_xy(accel_desired: Vector2f, accel: &mut Vector2f, jerk_max: f32, dt: f32) {
-    if !is_positive(jerk_max) {
+    if  /* ~ changed by cargo-mutants ~ */is_positive(jerk_max) {
         // Upstream reports an internal error and returns, leaving the
         // acceleration untouched. Reproduced: a caller that has passed a
         // nonsensical jerk limit is better served by nothing happening than
         // by an unbounded step.
         return;
     }
     if is_positive(dt) {
         let mut accel_delta = accel_desired - *accel;

---- a_degenerate_limit_leaves_the_command_alone stdout ----

thread 'a_degenerate_limit_leaves_the_command_alone' (243214) panicked at crates/ap-math/tests/control_xy_parity.rs:356:5:
assertion `left != right` failed: a valid pair must shape the command
  left: (1.25, -0.75)
 right: (1.25, -0.75)

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (243224) panicked at crates/ap-math/tests/control_xy_parity.rs:195:13:
step 0 sa_x: 0 != upstream 0.074999996 (diff 0.074999996)

failures:
    a_degenerate_limit_leaves_the_command_alone
    the_shapers_match_upstream

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
