*** crates/ap-math/src/control.rs:595:45: replace - with + in shape_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace - with + in shape_accel_xy
@@ -587,17 +587,17 @@
     if !is_positive(jerk_max) {
         // Upstream reports an internal error and returns, leaving the
         // acceleration untouched. Reproduced: a caller that has passed a
         // nonsensical jerk limit is better served by nothing happening than
         // by an unbounded step.
         return;
     }
     if is_positive(dt) {
-        let mut accel_delta = accel_desired - *accel;
+        let mut accel_delta = accel_desired + /* ~ changed by cargo-mutants ~ */ *accel;
         accel_delta.limit_length(jerk_max * dt);
         *accel += accel_delta;
     }
 }
 
 /// The three-dimensional spelling, which shapes only the horizontal pair —
 /// upstream's `Vector3f` overload of `shape_accel_xy`.
 ///

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2053695) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 1 out_y: -0.0048038345 != upstream -0.00486729 (diff 0.00006345566)

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (2053702) panicked at crates/ap-math/tests/control_xy_parity.rs:196:13:
step 2 sva_y: -0.01742516 != upstream -0.017508402 (diff 0.00008324161)

failures:
    the_position_loop_matches_upstream
    the_shapers_match_upstream

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
