*** crates/ap-math/src/control.rs:596:43: replace * with / in shape_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in shape_accel_xy
@@ -588,17 +588,17 @@
         // Upstream reports an internal error and returns, leaving the
         // acceleration untouched. Reproduced: a caller that has passed a
         // nonsensical jerk limit is better served by nothing happening than
         // by an unbounded step.
         return;
     }
     if is_positive(dt) {
         let mut accel_delta = accel_desired - *accel;
-        accel_delta.limit_length(jerk_max * dt);
+        accel_delta.limit_length(jerk_max / /* ~ changed by cargo-mutants ~ */ dt);
         *accel += accel_delta;
     }
 }
 
 /// The three-dimensional spelling, which shapes only the horizontal pair —
 /// upstream's `Vector3f` overload of `shape_accel_xy`.
 ///
 /// The vertical component is left exactly as it was. That is the point of the

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (248433) panicked at crates/ap-math/tests/control_xy_parity.rs:195:13:
step 0 sa_x: 8 != upstream 0.074999996 (diff 7.925)

failures:
    the_shapers_match_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
