*** crates/ap-math/src/control.rs:597:16: replace += with -= in shape_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with -= in shape_accel_xy
@@ -589,17 +589,17 @@
         // acceleration untouched. Reproduced: a caller that has passed a
         // nonsensical jerk limit is better served by nothing happening than
         // by an unbounded step.
         return;
     }
     if is_positive(dt) {
         let mut accel_delta = accel_desired - *accel;
         accel_delta.limit_length(jerk_max * dt);
-        *accel += accel_delta;
+        *accel -= /* ~ changed by cargo-mutants ~ */ accel_delta;
     }
 }
 
 /// The three-dimensional spelling, which shapes only the horizontal pair —
 /// upstream's `Vector3f` overload of `shape_accel_xy`.
 ///
 /// The vertical component is left exactly as it was. That is the point of the
 /// name: a multirotor's vertical axis has a different jerk budget and is

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (3851473) panicked at crates/ap-math/tests/control_xy_parity.rs:195:13:
step 0 sa_x: -0.074999996 != upstream 0.074999996 (diff 0.14999999)

failures:
    the_shapers_match_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
