*** crates/ap-math/src/control.rs:608:5: replace shape_accel_xy_3d with ()

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace shape_accel_xy_3d with ()
@@ -600,25 +600,17 @@
 
 /// The three-dimensional spelling, which shapes only the horizontal pair —
 /// upstream's `Vector3f` overload of `shape_accel_xy`.
 ///
 /// The vertical component is left exactly as it was. That is the point of the
 /// name: a multirotor's vertical axis has a different jerk budget and is
 /// shaped separately.
 pub fn shape_accel_xy_3d(accel_desired: Vector3f, accel: &mut Vector3f, jerk_max: f32, dt: f32) {
-    let mut planar = Vector2f::new(accel.x, accel.y);
-    shape_accel_xy(
-        Vector2f::new(accel_desired.x, accel_desired.y),
-        &mut planar,
-        jerk_max,
-        dt,
-    );
-    accel.x = planar.x;
-    accel.y = planar.y;
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Shape a velocity command into a jerk-limited acceleration — upstream
 /// `shape_vel_accel_xy`.
 ///
 /// The correction is computed by the vector square-root controller, then
 /// passed through [`limit_accel_corner_xy`] *before* the feedforward is added.
 /// Order matters: the cornering limit is about what the airframe can do to

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (2064173) panicked at crates/ap-math/tests/control_xy_parity.rs:196:13:
step 0 3d_x: 0 != upstream 0.074999996 (diff 0.074999996)

failures:
    the_shapers_match_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
