*** crates/ap-math/src/control.rs:644:32: replace || with && in shape_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace || with && in shape_vel_accel_xy
@@ -636,17 +636,17 @@
     accel_desired: Vector2f,
     vel: Vector2f,
     accel: &mut Vector2f,
     accel_max: f32,
     jerk_max: f32,
     dt: f32,
     limit_total_accel: bool,
 ) {
-    if !is_positive(accel_max) || !is_positive(jerk_max) {
+    if !is_positive(accel_max) && /* ~ changed by cargo-mutants ~ */ !is_positive(jerk_max) {
         return;
     }
 
     // The gain that makes the sqrt controller's linear region hand over to
     // its square-root region exactly at the acceleration limit.
     let kpa = jerk_max / accel_max;
 
     let vel_error = vel_desired - vel;

---- a_degenerate_limit_leaves_the_command_alone stdout ----

thread 'a_degenerate_limit_leaves_the_command_alone' (3859407) panicked at crates/ap-math/tests/control_xy_parity.rs:345:9:
assertion `left == right` failed: accel_max 0, jerk_max 30 should have been refused
  left: (1.185688, -0.7114128)
 right: (1.25, -0.75)

failures:
    a_degenerate_limit_leaves_the_command_alone

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
