*** crates/ap-math/src/control.rs:644:5: replace shape_vel_accel_xy with ()

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace shape_vel_accel_xy with ()
@@ -636,36 +636,17 @@
     accel_desired: Vector2f,
     vel: Vector2f,
     accel: &mut Vector2f,
     accel_max: f32,
     jerk_max: f32,
     dt: f32,
     limit_total_accel: bool,
 ) {
-    if !is_positive(accel_max) || !is_positive(jerk_max) {
-        return;
-    }
-
-    // The gain that makes the sqrt controller's linear region hand over to
-    // its square-root region exactly at the acceleration limit.
-    let kpa = jerk_max / accel_max;
-
-    let vel_error = vel_desired - vel;
-    let mut accel_target = sqrt_controller_xy(vel_error, kpa, jerk_max, dt);
-
-    limit_accel_corner_xy(vel, &mut accel_target, accel_max);
-
-    accel_target += accel_desired;
-
-    if limit_total_accel {
-        accel_target.limit_length(accel_max);
-    }
-
-    shape_accel_xy(accel_target, accel, jerk_max, dt);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// The vector square-root controller — upstream's `Vector2f` overload of
 /// `sqrt_controller`.
 ///
 /// Scalar controller on the error's *length*, with the result pointed back
 /// along the error. So the correction never changes direction, only magnitude
 /// — a per-axis version would corner differently depending on which way the

---- a_degenerate_limit_leaves_the_command_alone stdout ----

thread 'a_degenerate_limit_leaves_the_command_alone' (3855561) panicked at crates/ap-math/tests/control_xy_parity.rs:356:5:
assertion `left != right` failed: a valid pair must shape the command
  left: (1.25, -0.75)
 right: (1.25, -0.75)

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (3855566) panicked at crates/ap-math/tests/control_xy_parity.rs:195:13:
step 0 sva_x: 0 != upstream 0.074833885 (diff 0.074833885)

failures:
    a_degenerate_limit_leaves_the_command_alone
    the_shapers_match_upstream

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
