*** crates/ap-math/src/control.rs:650:24: replace / with * in shape_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in shape_vel_accel_xy
@@ -642,17 +642,17 @@
     limit_total_accel: bool,
 ) {
     if !is_positive(accel_max) || !is_positive(jerk_max) {
         return;
     }
 
     // The gain that makes the sqrt controller's linear region hand over to
     // its square-root region exactly at the acceleration limit.
-    let kpa = jerk_max / accel_max;
+    let kpa = jerk_max * /* ~ changed by cargo-mutants ~ */ accel_max;
 
     let vel_error = vel_desired - vel;
     let mut accel_target = sqrt_controller_xy(vel_error, kpa, jerk_max, dt);
 
     limit_accel_corner_xy(vel, &mut accel_target, accel_max);
 
     accel_target += accel_desired;

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (2073558) panicked at crates/ap-math/tests/control_xy_parity.rs:196:13:
step 400 sva_x: -2.6956637 != upstream -2.6920063 (diff 0.003657341)

failures:
    the_shapers_match_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
