*** crates/ap-math/src/control.rs:657:18: replace += with -= in shape_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with -= in shape_vel_accel_xy
@@ -649,17 +649,17 @@
     // its square-root region exactly at the acceleration limit.
     let kpa = jerk_max / accel_max;
 
     let vel_error = vel_desired - vel;
     let mut accel_target = sqrt_controller_xy(vel_error, kpa, jerk_max, dt);
 
     limit_accel_corner_xy(vel, &mut accel_target, accel_max);
 
-    accel_target += accel_desired;
+    accel_target -= /* ~ changed by cargo-mutants ~ */ accel_desired;
 
     if limit_total_accel {
         accel_target.limit_length(accel_max);
     }
 
     shape_accel_xy(accel_target, accel, jerk_max, dt);
 }

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (2075086) panicked at crates/ap-math/tests/control_xy_parity.rs:196:13:
step 0 sva_y: 0.0049889255 != upstream -0.0049889255 (diff 0.009977851)

failures:
    the_shapers_match_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
