*** crates/ap-math/src/control.rs:675:5: replace sqrt_controller_xy -> Vector2f with Default::default()

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace sqrt_controller_xy -> Vector2f with Default::default()
@@ -667,22 +667,17 @@
 /// `sqrt_controller`.
 ///
 /// Scalar controller on the error's *length*, with the result pointed back
 /// along the error. So the correction never changes direction, only magnitude
 /// — a per-axis version would corner differently depending on which way the
 /// error happened to lie.
 #[must_use]
 pub fn sqrt_controller_xy(error: Vector2f, p: f32, second_ord_lim: f32, dt: f32) -> Vector2f {
-    let error_length = error.length();
-    if !is_positive(error_length) {
-        return Vector2f::new(0.0, 0.0);
-    }
-    let correction_length = sqrt_controller(error_length, p, second_ord_lim, dt);
-    error * (correction_length / error_length)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Limit acceleration, prioritising cross-track — upstream `limit_accel_xy`.
 ///
 /// When the demand exceeds what the airframe can deliver, something has to be
 /// given up, and this gives up along-track first. Cross-track acceleration is
 /// what holds the vehicle on its path; along-track only changes how fast it
 /// gets there. Sacrificing the path to keep the schedule is the wrong trade,

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (269879) panicked at crates/ap-math/tests/control_xy_parity.rs:195:13:
step 0 sva_x: 0 != upstream 0.074833885 (diff 0.074833885)

failures:
    the_shapers_match_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
