*** crates/ap-math/src/control.rs:680:11: replace * with / in sqrt_controller_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in sqrt_controller_xy
@@ -672,17 +672,17 @@
 /// error happened to lie.
 #[must_use]
 pub fn sqrt_controller_xy(error: Vector2f, p: f32, second_ord_lim: f32, dt: f32) -> Vector2f {
     let error_length = error.length();
     if !is_positive(error_length) {
         return Vector2f::new(0.0, 0.0);
     }
     let correction_length = sqrt_controller(error_length, p, second_ord_lim, dt);
-    error * (correction_length / error_length)
+    error / /* ~ changed by cargo-mutants ~ */ (correction_length / error_length)
 }
 
 /// Limit acceleration, prioritising cross-track — upstream `limit_accel_xy`.
 ///
 /// When the demand exceeds what the airframe can deliver, something has to be
 /// given up, and this gives up along-track first. Cross-track acceleration is
 /// what holds the vehicle on its path; along-track only changes how fast it
 /// gets there. Sacrificing the path to keep the schedule is the wrong trade,

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (274567) panicked at crates/ap-math/tests/control_xy_parity.rs:195:13:
step 0 sva_x: 0.07063224 != upstream 0.074833885 (diff 0.004201643)

failures:
    the_shapers_match_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
