*** crates/ap-math/src/control.rs:696:5: replace limit_accel_xy -> bool with false

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace limit_accel_xy -> bool with false
@@ -688,45 +688,17 @@
 /// gets there. Sacrificing the path to keep the schedule is the wrong trade,
 /// so the schedule goes.
 ///
 /// With no velocity there is no track to be cross to, and it falls back to a
 /// plain magnitude limit.
 ///
 /// Returns whether any limiting happened.
 pub fn limit_accel_xy(vel: Vector2f, accel: &mut Vector2f, accel_max: f32) -> bool {
-    if !is_positive(accel_max) {
-        return false;
-    }
-    if accel.length_squared() <= accel_max * accel_max {
-        return false;
-    }
-
-    if vel.is_zero() {
-        accel.limit_length(accel_max);
-        return true;
-    }
-
-    let vel_unit = vel.normalized_or_zero();
-    let mut accel_dir = vel_unit.dot(*accel);
-    let mut accel_cross = *accel - vel_unit * accel_dir;
-
-    if accel_cross.limit_length(accel_max) {
-        // The cross-track component alone used the entire budget, so there is
-        // nothing left for along-track at all.
-        accel_dir = 0.0;
-    } else {
-        // limit_length cannot absolutely guarantee this difference is
-        // non-negative, hence the guarded square root — upstream's comment.
-        let accel_max_dir = safe_sqrt(accel_max * accel_max - accel_cross.length_squared());
-        accel_dir = accel_dir.clamp(-accel_max_dir, accel_max_dir);
-    }
-
-    *accel = accel_cross + vel_unit * accel_dir;
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Limit acceleration with direction-dependent priority — upstream
 /// `limit_accel_corner_xy`.
 ///
 /// The same budget problem as [`limit_accel_xy`], answered differently
 /// depending on whether the vehicle is trying to slow down.
 ///

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (279913) panicked at crates/ap-math/tests/control_xy_parity.rs:92:13:
row 84 plain_x: 5 != upstream 3 (diff 2)

failures:
    the_acceleration_limiters_match_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
