*** crates/ap-math/src/control.rs:696:8: delete ! in limit_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in limit_accel_xy
@@ -688,17 +688,17 @@
 /// gets there. Sacrificing the path to keep the schedule is the wrong trade,
 /// so the schedule goes.
 ///
 /// With no velocity there is no track to be cross to, and it falls back to a
 /// plain magnitude limit.
 ///
 /// Returns whether any limiting happened.
 pub fn limit_accel_xy(vel: Vector2f, accel: &mut Vector2f, accel_max: f32) -> bool {
-    if !is_positive(accel_max) {
+    if  /* ~ changed by cargo-mutants ~ */is_positive(accel_max) {
         return false;
     }
     if accel.length_squared() <= accel_max * accel_max {
         return false;
     }
 
     if vel.is_zero() {
         accel.limit_length(accel_max);

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (280881) panicked at crates/ap-math/tests/control_xy_parity.rs:92:13:
row 0 plain_x: 0 != upstream 0.5 (diff 0.5)

failures:
    the_acceleration_limiters_match_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
