*** crates/ap-math/src/control.rs:710:45: replace * with / in limit_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in limit_accel_xy
@@ -702,17 +702,17 @@
 
     if vel.is_zero() {
         accel.limit_length(accel_max);
         return true;
     }
 
     let vel_unit = vel.normalized_or_zero();
     let mut accel_dir = vel_unit.dot(*accel);
-    let mut accel_cross = *accel - vel_unit * accel_dir;
+    let mut accel_cross = *accel - vel_unit / /* ~ changed by cargo-mutants ~ */ accel_dir;
 
     if accel_cross.limit_length(accel_max) {
         // The cross-track component alone used the entire budget, so there is
         // nothing left for along-track at all.
         accel_dir = 0.0;
     } else {
         // limit_length cannot absolutely guarantee this difference is
         // non-negative, hence the guarded square root — upstream's comment.

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (3891832) panicked at crates/ap-math/tests/control_xy_parity.rs:92:13:
row 301 plain_x: 2.5612507 != upstream 1.6583124 (diff 0.90293825)

failures:
    the_acceleration_limiters_match_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
