*** crates/ap-math/src/control.rs:719:49: replace * with / in limit_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in limit_accel_xy
@@ -711,17 +711,17 @@
 
     if accel_cross.limit_length(accel_max) {
         // The cross-track component alone used the entire budget, so there is
         // nothing left for along-track at all.
         accel_dir = 0.0;
     } else {
         // limit_length cannot absolutely guarantee this difference is
         // non-negative, hence the guarded square root — upstream's comment.
-        let accel_max_dir = safe_sqrt(accel_max * accel_max - accel_cross.length_squared());
+        let accel_max_dir = safe_sqrt(accel_max / /* ~ changed by cargo-mutants ~ */ accel_max - accel_cross.length_squared());
         accel_dir = accel_dir.clamp(-accel_max_dir, accel_max_dir);
     }
 
     *accel = accel_cross + vel_unit * accel_dir;
     true
 }
 
 /// Limit acceleration with direction-dependent priority — upstream

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (3899416) panicked at crates/ap-math/tests/control_xy_parity.rs:92:13:
row 300 plain_x: 1 != upstream 3 (diff 2)

failures:
    the_acceleration_limiters_match_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
