*** crates/ap-math/src/control.rs:71:31: replace * with / in update_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in update_vel_accel
@@ -63,17 +63,17 @@
 /// `limit` names a direction in which acceleration is constrained; `vel_error`
 /// gives the sign of the velocity error. When both point the same way as the
 /// step, the step is refused — unless the velocity is currently opposing the
 /// limit, in which case it is clipped so it cannot cross zero.
 ///
 /// The point is that a controller which has hit a limit should not keep
 /// pushing into it, but should still be allowed to unwind.
 pub fn update_vel_accel(vel: &mut f32, accel: f32, dt: f32, limit: f32, vel_error: f32) {
-    let mut delta_vel = accel * dt;
+    let mut delta_vel = accel / /* ~ changed by cargo-mutants ~ */ dt;
     if is_positive(delta_vel * limit) && is_positive(vel_error * limit) {
         if is_negative(*vel * limit) {
             delta_vel = constrain_value(delta_vel, -vel.abs(), vel.abs());
         } else {
             delta_vel = 0.0;
         }
     }
     *vel += delta_vel;

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (3360578) panicked at crates/ap-math/src/control.rs:933:9:
should have arrived, got 0

---- control::tests::a_limit_blocks_pushing_but_not_unwinding stdout ----

thread 'control::tests::a_limit_blocks_pushing_but_not_unwinding' (3360570) panicked at crates/ap-math/src/control.rs:981:9:
assertion `left == right` failed
  left: 101.0
 right: 2.0

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (3360576) panicked at crates/ap-math/src/control.rs:953:9:
settled at 383.26832024865644, wanted 100

failures:
    control::tests::a_limit_blocks_pushing_but_not_unwinding
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::a_velocity_demand_is_tracked_within_the_limits

test result: FAILED. 143 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
