*** crates/ap-math/src/control.rs:71:5: replace update_vel_accel with ()

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace update_vel_accel with ()
@@ -63,25 +63,17 @@
 /// `limit` names a direction in which acceleration is constrained; `vel_error`
 /// gives the sign of the velocity error. When both point the same way as the
 /// step, the step is refused — unless the velocity is currently opposing the
 /// limit, in which case it is clipped so it cannot cross zero.
 ///
 /// The point is that a controller which has hit a limit should not keep
 /// pushing into it, but should still be allowed to unwind.
 pub fn update_vel_accel(vel: &mut f32, accel: f32, dt: f32, limit: f32, vel_error: f32) {
-    let mut delta_vel = accel * dt;
-    if is_positive(delta_vel * limit) && is_positive(vel_error * limit) {
-        if is_negative(*vel * limit) {
-            delta_vel = constrain_value(delta_vel, -vel.abs(), vel.abs());
-        } else {
-            delta_vel = 0.0;
-        }
-    }
-    *vel += delta_vel;
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Move a position and velocity forward by one step, upstream
 /// `update_pos_vel_accel`.
 ///
 /// The position step is skipped entirely when it would worsen the position
 /// error in the limited direction; the velocity then updates under the same
 /// rule as [`update_vel_accel`].

---- control::tests::a_limit_blocks_pushing_but_not_unwinding stdout ----

thread 'control::tests::a_limit_blocks_pushing_but_not_unwinding' (3952186) panicked at crates/ap-math/src/control.rs:965:9:
should unwind toward zero, got -0.5

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (3952187) panicked at crates/ap-math/src/control.rs:945:9:
settled at 0.44782497782716746, wanted 100

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (3952189) panicked at crates/ap-math/src/control.rs:925:9:
should have arrived, got 0

failures:
    control::tests::a_limit_blocks_pushing_but_not_unwinding
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::a_velocity_demand_is_tracked_within_the_limits

test result: FAILED. 143 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
