*** crates/ap-math/src/control.rs:722:5: replace shape_pos_vel_accel_xy with ()

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace shape_pos_vel_accel_xy with ()
@@ -714,70 +714,17 @@
     vel: Vector2f,
     accel: &mut Vector2f,
     vel_max: f32,
     accel_max: f32,
     jerk_max: f32,
     dt: f32,
     limit_total: bool,
 ) {
-    if is_negative(vel_max) || !is_positive(accel_max) || !is_positive(jerk_max) {
-        return;
-    }
-
-    // Inner velocity-loop gain, set so the sqrt controller's linear region
-    // hands over to its square-root region exactly at the acceleration limit.
-    let k_v = jerk_max / accel_max;
-
-    let mut vel_corr_cmd = Vector2f::new(0.0, 0.0);
-
-    let pos_error = Vector2f::new(
-        (pos_desired.x - pos.x) as f32,
-        (pos_desired.y - pos.y) as f32,
-    );
-    let pos_error_length = pos_error.length();
-
-    if is_positive(pos_error_length) {
-        let vel_corr_proj = (vel - vel_desired).dot(pos_error) / pos_error_length;
-
-        let mut vel_corr_cmd_length = sqrt_controller(pos_error_length, k_v, accel_max, dt);
-
-        let accel_corr_cmd_length = sqrt_controller_accel(
-            pos_error_length,
-            vel_corr_cmd_length,
-            vel_corr_proj,
-            k_v,
-            accel_max,
-        );
-
-        vel_corr_cmd_length += accel_corr_cmd_length / k_v;
-
-        if is_positive(vel_max) {
-            vel_corr_cmd_length = vel_corr_cmd_length.clamp(-vel_max, vel_max);
-        }
-
-        vel_corr_cmd = pos_error * (vel_corr_cmd_length / pos_error_length);
-    }
-
-    let mut vel_target = vel_desired + vel_corr_cmd;
-    if limit_total && is_positive(vel_max) {
-        vel_target.limit_length(vel_max);
-    }
-
-    let mut accel_target = (vel_target - vel) * k_v;
-
-    limit_accel_corner_xy(vel, &mut accel_target, accel_max);
-
-    accel_target += accel_desired;
-
-    if limit_total {
-        accel_target.limit_length(accel_max);
-    }
-
-    shape_accel_xy(accel_target, accel, jerk_max, dt);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// The vector square-root controller — upstream's `Vector2f` overload of
 /// `sqrt_controller`.
 ///
 /// Scalar controller on the error's *length*, with the result pointed back
 /// along the error. So the correction never changes direction, only magnitude
 /// — a per-axis version would corner differently depending on which way the

---- the_position_loop_refuses_a_degenerate_limit_set stdout ----

thread 'the_position_loop_refuses_a_degenerate_limit_set' (2080038) panicked at crates/ap-math/tests/control_xy_parity.rs:517:5:
assertion `left != right` failed: a zero velocity limit means unlimited, not invalid
  left: (0.75, -0.5)
 right: (0.75, -0.5)

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2080037) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 0 out_x: 0 != upstream 0.049986735 (diff 0.049986735)

failures:
    the_position_loop_matches_upstream
    the_position_loop_refuses_a_degenerate_limit_set

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
