*** crates/ap-math/src/control.rs:722:56: replace || with && in shape_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace || with && in shape_pos_vel_accel_xy
@@ -714,17 +714,17 @@
     vel: Vector2f,
     accel: &mut Vector2f,
     vel_max: f32,
     accel_max: f32,
     jerk_max: f32,
     dt: f32,
     limit_total: bool,
 ) {
-    if is_negative(vel_max) || !is_positive(accel_max) || !is_positive(jerk_max) {
+    if is_negative(vel_max) || !is_positive(accel_max) && /* ~ changed by cargo-mutants ~ */ !is_positive(jerk_max) {
         return;
     }
 
     // Inner velocity-loop gain, set so the sqrt controller's linear region
     // hands over to its square-root region exactly at the acceleration limit.
     let k_v = jerk_max / accel_max;
 
     let mut vel_corr_cmd = Vector2f::new(0.0, 0.0);

---- the_position_loop_refuses_a_degenerate_limit_set stdout ----

thread 'the_position_loop_refuses_a_degenerate_limit_set' (2079096) panicked at crates/ap-math/tests/control_xy_parity.rs:504:9:
assertion `left == right` failed: (5, 0, 20) should have been refused
  left: (NaN, NaN)
 right: (0.75, -0.5)

failures:
    the_position_loop_refuses_a_degenerate_limit_set

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
