*** crates/ap-math/src/control.rs:722:59: delete ! in shape_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in shape_pos_vel_accel_xy
@@ -714,17 +714,17 @@
     vel: Vector2f,
     accel: &mut Vector2f,
     vel_max: f32,
     accel_max: f32,
     jerk_max: f32,
     dt: f32,
     limit_total: bool,
 ) {
-    if is_negative(vel_max) || !is_positive(accel_max) || !is_positive(jerk_max) {
+    if is_negative(vel_max) || !is_positive(accel_max) ||  /* ~ changed by cargo-mutants ~ */is_positive(jerk_max) {
         return;
     }
 
     // Inner velocity-loop gain, set so the sqrt controller's linear region
     // hands over to its square-root region exactly at the acceleration limit.
     let k_v = jerk_max / accel_max;
 
     let mut vel_corr_cmd = Vector2f::new(0.0, 0.0);

---- the_position_loop_refuses_a_degenerate_limit_set stdout ----

thread 'the_position_loop_refuses_a_degenerate_limit_set' (2085245) panicked at crates/ap-math/tests/control_xy_parity.rs:517:5:
assertion `left != right` failed: a zero velocity limit means unlimited, not invalid
  left: (0.75, -0.5)
 right: (0.75, -0.5)

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2085243) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 0 out_x: 0 != upstream 0.049986735 (diff 0.049986735)

failures:
    the_position_loop_matches_upstream
    the_position_loop_refuses_a_degenerate_limit_set

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
