*** crates/ap-math/src/control.rs:723:26: replace + with - in limit_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace + with - in limit_accel_xy
@@ -715,17 +715,17 @@
         accel_dir = 0.0;
     } else {
         // limit_length cannot absolutely guarantee this difference is
         // non-negative, hence the guarded square root — upstream's comment.
         let accel_max_dir = safe_sqrt(accel_max * accel_max - accel_cross.length_squared());
         accel_dir = accel_dir.clamp(-accel_max_dir, accel_max_dir);
     }
 
-    *accel = accel_cross + vel_unit * accel_dir;
+    *accel = accel_cross - /* ~ changed by cargo-mutants ~ */ vel_unit * accel_dir;
     true
 }
 
 /// Limit acceleration with direction-dependent priority — upstream
 /// `limit_accel_corner_xy`.
 ///
 /// The same budget problem as [`limit_accel_xy`], answered differently
 /// depending on whether the vehicle is trying to slow down.

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (3903286) panicked at crates/ap-math/tests/control_xy_parity.rs:92:13:
row 300 plain_x: -3 != upstream 3 (diff 6)

failures:
    the_acceleration_limiters_match_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
