*** crates/ap-math/src/control.rs:728:24: replace / with * in shape_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in shape_pos_vel_accel_xy
@@ -720,17 +720,17 @@
     limit_total: bool,
 ) {
     if is_negative(vel_max) || !is_positive(accel_max) || !is_positive(jerk_max) {
         return;
     }
 
     // Inner velocity-loop gain, set so the sqrt controller's linear region
     // hands over to its square-root region exactly at the acceleration limit.
-    let k_v = jerk_max / accel_max;
+    let k_v = jerk_max * /* ~ changed by cargo-mutants ~ */ accel_max;
 
     let mut vel_corr_cmd = Vector2f::new(0.0, 0.0);
 
     let pos_error = Vector2f::new(
         (pos_desired.x - pos.x) as f32,
         (pos_desired.y - pos.y) as f32,
     );
     let pos_error_length = pos_error.length();

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2090410) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 0 out_y: -0.0011170218 != upstream -0.001151609 (diff 0.000034587225)

failures:
    the_position_loop_matches_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
