*** crates/ap-math/src/control.rs:72:30: replace * with + in update_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with + in update_vel_accel
@@ -64,17 +64,17 @@
 /// gives the sign of the velocity error. When both point the same way as the
 /// step, the step is refused — unless the velocity is currently opposing the
 /// limit, in which case it is clipped so it cannot cross zero.
 ///
 /// The point is that a controller which has hit a limit should not keep
 /// pushing into it, but should still be allowed to unwind.
 pub fn update_vel_accel(vel: &mut f32, accel: f32, dt: f32, limit: f32, vel_error: f32) {
     let mut delta_vel = accel * dt;
-    if is_positive(delta_vel * limit) && is_positive(vel_error * limit) {
+    if is_positive(delta_vel + /* ~ changed by cargo-mutants ~ */ limit) && is_positive(vel_error * limit) {
         if is_negative(*vel * limit) {
             delta_vel = constrain_value(delta_vel, -vel.abs(), vel.abs());
         } else {
             delta_vel = 0.0;
         }
     }
     *vel += delta_vel;
 }

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (3354739) panicked at crates/ap-math/tests/control_parity.rs:225:17:
update_vel_accel in row `upd_vel,3221225472,3221225472,3212836864,3212836864,0,0,3221225472,0`: -2.04 against upstream -2

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
