*** crates/ap-math/src/control.rs:733:24: replace - with / in shape_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace - with / in shape_pos_vel_accel_xy
@@ -725,17 +725,17 @@
 
     // Inner velocity-loop gain, set so the sqrt controller's linear region
     // hands over to its square-root region exactly at the acceleration limit.
     let k_v = jerk_max / accel_max;
 
     let mut vel_corr_cmd = Vector2f::new(0.0, 0.0);
 
     let pos_error = Vector2f::new(
-        (pos_desired.x - pos.x) as f32,
+        (pos_desired.x / /* ~ changed by cargo-mutants ~ */ pos.x) as f32,
         (pos_desired.y - pos.y) as f32,
     );
     let pos_error_length = pos_error.length();
 
     if is_positive(pos_error_length) {
         let vel_corr_proj = (vel - vel_desired).dot(pos_error) / pos_error_length;
 
         let mut vel_corr_cmd_length = sqrt_controller(pos_error_length, k_v, accel_max, dt);

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2091330) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 0 out_x: 0.04904349 != upstream 0.049986735 (diff 0.0009432435)

failures:
    the_position_loop_matches_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
