*** crates/ap-math/src/control.rs:739:64: replace / with * in shape_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in shape_pos_vel_accel_xy
@@ -731,17 +731,17 @@
 
     let pos_error = Vector2f::new(
         (pos_desired.x - pos.x) as f32,
         (pos_desired.y - pos.y) as f32,
     );
     let pos_error_length = pos_error.length();
 
     if is_positive(pos_error_length) {
-        let vel_corr_proj = (vel - vel_desired).dot(pos_error) / pos_error_length;
+        let vel_corr_proj = (vel - vel_desired).dot(pos_error) * /* ~ changed by cargo-mutants ~ */ pos_error_length;
 
         let mut vel_corr_cmd_length = sqrt_controller(pos_error_length, k_v, accel_max, dt);
 
         let accel_corr_cmd_length = sqrt_controller_accel(
             pos_error_length,
             vel_corr_cmd_length,
             vel_corr_proj,
             k_v,

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2099234) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 262 out_x: 3.944917 != upstream 3.94506 (diff 0.00014305115)

failures:
    the_position_loop_matches_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
