*** crates/ap-math/src/control.rs:73:29: replace * with + in update_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with + in update_vel_accel
@@ -65,17 +65,17 @@
 /// step, the step is refused — unless the velocity is currently opposing the
 /// limit, in which case it is clipped so it cannot cross zero.
 ///
 /// The point is that a controller which has hit a limit should not keep
 /// pushing into it, but should still be allowed to unwind.
 pub fn update_vel_accel(vel: &mut f32, accel: f32, dt: f32, limit: f32, vel_error: f32) {
     let mut delta_vel = accel * dt;
     if is_positive(delta_vel * limit) && is_positive(vel_error * limit) {
-        if is_negative(*vel * limit) {
+        if is_negative(*vel + /* ~ changed by cargo-mutants ~ */ limit) {
             delta_vel = constrain_value(delta_vel, -vel.abs(), vel.abs());
         } else {
             delta_vel = 0.0;
         }
     }
     *vel += delta_vel;
 }

---- control::tests::a_limit_blocks_pushing_but_not_unwinding stdout ----

thread 'control::tests::a_limit_blocks_pushing_but_not_unwinding' (3967790) panicked at crates/ap-math/src/control.rs:973:9:
should unwind toward zero, got -0.5

failures:
    control::tests::a_limit_blocks_pushing_but_not_unwinding

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
