*** crates/ap-math/src/control.rs:746:5: replace limit_accel_corner_xy -> bool with true

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace limit_accel_corner_xy -> bool with true
@@ -738,50 +738,17 @@
 /// where holding the curve matters least.
 ///
 /// The pre-limit to twice `accel_max` before decomposing is upstream's, and
 /// its comment explains it: the demand is often proportional to velocity
 /// error and can be enormous, which makes the direction ill-conditioned. Two
 /// times leaves room for the decomposition to be meaningful while bounding
 /// the input.
 pub fn limit_accel_corner_xy(vel: Vector2f, accel: &mut Vector2f, accel_max: f32) -> bool {
-    if !is_positive(accel_max) {
-        return false;
-    }
-
-    if vel.is_zero() {
-        return accel.limit_length(accel_max);
-    }
-
-    accel.limit_length(2.0 * accel_max);
-
-    let vel_unit = vel.normalized_or_zero();
-    let mut accel_dir_scalar = accel.dot(vel_unit);
-    let mut accel_dir = vel_unit * accel_dir_scalar;
-    let mut accel_cross = *accel - accel_dir;
-
-    if is_positive(accel_dir_scalar) {
-        let accel_cross_mag = accel_cross.length().min(accel_max);
-        let accel_along_max = safe_sqrt(accel_max * accel_max - accel_cross_mag * accel_cross_mag);
-
-        accel_cross.limit_length(accel_max);
-        accel_dir.limit_length(accel_along_max);
-
-        *accel = accel_cross + accel_dir;
-        return true;
-    }
-
-    accel_dir_scalar = accel_dir_scalar.max(-accel_max);
-    accel_dir = vel_unit * accel_dir_scalar;
-
-    let accel_cross_max = safe_sqrt(accel_max * accel_max - accel_dir_scalar * accel_dir_scalar);
-    accel_cross.limit_length(accel_cross_max);
-
-    *accel = accel_cross + accel_dir;
-    true
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     #![allow(
         clippy::float_cmp,
         reason = "several tests assert a value was left exactly alone, which is the \
 claim; an epsilon would accept a small change and a small change is the failure"

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (306283) panicked at crates/ap-math/tests/control_xy_parity.rs:195:13:
step 0 sva_x: 0.0749706 != upstream 0.074833885 (diff 0.00013671815)

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (306281) panicked at crates/ap-math/tests/control_xy_parity.rs:98:9:
assertion `left == right` failed: row 0 corner return
  left: true
 right: false

failures:
    the_acceleration_limiters_match_upstream
    the_shapers_match_upstream

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
