*** crates/ap-math/src/control.rs:751:29: replace += with *= in shape_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with *= in shape_pos_vel_accel_xy
@@ -743,17 +743,17 @@
         let accel_corr_cmd_length = sqrt_controller_accel(
             pos_error_length,
             vel_corr_cmd_length,
             vel_corr_proj,
             k_v,
             accel_max,
         );
 
-        vel_corr_cmd_length += accel_corr_cmd_length / k_v;
+        vel_corr_cmd_length *= /* ~ changed by cargo-mutants ~ */ accel_corr_cmd_length / k_v;
 
         if is_positive(vel_max) {
             vel_corr_cmd_length = vel_corr_cmd_length.clamp(-vel_max, vel_max);
         }
 
         vel_corr_cmd = pos_error * (vel_corr_cmd_length / pos_error_length);
     }

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2106804) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 0 out_x: 0.04904349 != upstream 0.049986735 (diff 0.0009432435)

failures:
    the_position_loop_matches_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
