*** crates/ap-math/src/control.rs:754:28: replace * with + in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with + in limit_accel_corner_xy
@@ -746,17 +746,17 @@
     if !is_positive(accel_max) {
         return false;
     }
 
     if vel.is_zero() {
         return accel.limit_length(accel_max);
     }
 
-    accel.limit_length(2.0 * accel_max);
+    accel.limit_length(2.0 + /* ~ changed by cargo-mutants ~ */ accel_max);
 
     let vel_unit = vel.normalized_or_zero();
     let mut accel_dir_scalar = accel.dot(vel_unit);
     let mut accel_dir = vel_unit * accel_dir_scalar;
     let mut accel_cross = *accel - accel_dir;
 
     if is_positive(accel_dir_scalar) {
         let accel_cross_mag = accel_cross.length().min(accel_max);

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (3912652) panicked at crates/ap-math/tests/control_xy_parity.rs:195:13:
step 1 sva_y: -0.0104456935 != upstream -0.010822261 (diff 0.00037656724)

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (3912650) panicked at crates/ap-math/tests/control_xy_parity.rs:92:13:
row 337 corner_x: 1.6583124 != upstream 0 (diff 1.6583124)

failures:
    the_acceleration_limiters_match_upstream
    the_shapers_match_upstream

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
