*** crates/ap-math/src/control.rs:754:61: delete - in shape_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete - in shape_pos_vel_accel_xy
@@ -746,17 +746,17 @@
             vel_corr_proj,
             k_v,
             accel_max,
         );
 
         vel_corr_cmd_length += accel_corr_cmd_length / k_v;
 
         if is_positive(vel_max) {
-            vel_corr_cmd_length = vel_corr_cmd_length.clamp(-vel_max, vel_max);
+            vel_corr_cmd_length = vel_corr_cmd_length.clamp( /* ~ changed by cargo-mutants ~ */vel_max, vel_max);
         }
 
         vel_corr_cmd = pos_error * (vel_corr_cmd_length / pos_error_length);
     }
 
     let mut vel_target = vel_desired + vel_corr_cmd;
     if limit_total && is_positive(vel_max) {
         vel_target.limit_length(vel_max);

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2109043) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 0 out_y: -0.0010648172 != upstream -0.001151609 (diff 0.00008679181)

failures:
    the_position_loop_matches_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
