*** crates/ap-math/src/control.rs:757:34: replace * with / in shape_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in shape_pos_vel_accel_xy
@@ -749,17 +749,17 @@
         );
 
         vel_corr_cmd_length += accel_corr_cmd_length / k_v;
 
         if is_positive(vel_max) {
             vel_corr_cmd_length = vel_corr_cmd_length.clamp(-vel_max, vel_max);
         }
 
-        vel_corr_cmd = pos_error * (vel_corr_cmd_length / pos_error_length);
+        vel_corr_cmd = pos_error / /* ~ changed by cargo-mutants ~ */ (vel_corr_cmd_length / pos_error_length);
     }
 
     let mut vel_target = vel_desired + vel_corr_cmd;
     if limit_total && is_positive(vel_max) {
         vel_target.limit_length(vel_max);
     }
 
     let mut accel_target = (vel_target - vel) * k_v;

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2112369) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 0 out_x: 0.04984452 != upstream 0.049986735 (diff 0.00014221668)

failures:
    the_position_loop_matches_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
