*** crates/ap-math/src/control.rs:759:34: replace - with + in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace - with + in limit_accel_corner_xy
@@ -751,17 +751,17 @@
         return accel.limit_length(accel_max);
     }
 
     accel.limit_length(2.0 * accel_max);
 
     let vel_unit = vel.normalized_or_zero();
     let mut accel_dir_scalar = accel.dot(vel_unit);
     let mut accel_dir = vel_unit * accel_dir_scalar;
-    let mut accel_cross = *accel - accel_dir;
+    let mut accel_cross = *accel + /* ~ changed by cargo-mutants ~ */ accel_dir;
 
     if is_positive(accel_dir_scalar) {
         let accel_cross_mag = accel_cross.length().min(accel_max);
         let accel_along_max = safe_sqrt(accel_max * accel_max - accel_cross_mag * accel_cross_mag);
 
         accel_cross.limit_length(accel_max);
         accel_dir.limit_length(accel_along_max);

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (315513) panicked at crates/ap-math/tests/control_xy_parity.rs:92:13:
row 228 corner_x: 1.5 != upstream 0.5 (diff 1)

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (315515) panicked at crates/ap-math/tests/control_xy_parity.rs:195:13:
step 1 sva_x: 0.14966798 != upstream 0.14960667 (diff 0.00006130338)

failures:
    the_acceleration_limiters_match_upstream
    the_shapers_match_upstream

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
