*** crates/ap-math/src/control.rs:761:20: replace && with || in shape_pos_vel_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace && with || in shape_pos_vel_accel_xy
@@ -753,17 +753,17 @@
         if is_positive(vel_max) {
             vel_corr_cmd_length = vel_corr_cmd_length.clamp(-vel_max, vel_max);
         }
 
         vel_corr_cmd = pos_error * (vel_corr_cmd_length / pos_error_length);
     }
 
     let mut vel_target = vel_desired + vel_corr_cmd;
-    if limit_total && is_positive(vel_max) {
+    if limit_total || /* ~ changed by cargo-mutants ~ */ is_positive(vel_max) {
         vel_target.limit_length(vel_max);
     }
 
     let mut accel_target = (vel_target - vel) * k_v;
 
     limit_accel_corner_xy(vel, &mut accel_target, accel_max);
 
     accel_target += accel_desired;

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2117353) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 400 out_x: 3.7382822 != upstream 3.7370076 (diff 0.0012745857)

failures:
    the_position_loop_matches_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
