*** crates/ap-math/src/control.rs:763:51: replace * with + in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with + in limit_accel_corner_xy
@@ -755,17 +755,17 @@
 
     let vel_unit = vel.normalized_or_zero();
     let mut accel_dir_scalar = accel.dot(vel_unit);
     let mut accel_dir = vel_unit * accel_dir_scalar;
     let mut accel_cross = *accel - accel_dir;
 
     if is_positive(accel_dir_scalar) {
         let accel_cross_mag = accel_cross.length().min(accel_max);
-        let accel_along_max = safe_sqrt(accel_max * accel_max - accel_cross_mag * accel_cross_mag);
+        let accel_along_max = safe_sqrt(accel_max + /* ~ changed by cargo-mutants ~ */ accel_max - accel_cross_mag * accel_cross_mag);
 
         accel_cross.limit_length(accel_max);
         accel_dir.limit_length(accel_along_max);
 
         *accel = accel_cross + accel_dir;
         return true;
     }

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (321718) panicked at crates/ap-math/tests/control_xy_parity.rs:195:13:
step 0 sva_x: 0.074504934 != upstream 0.074833885 (diff 0.00032895058)

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (321710) panicked at crates/ap-math/tests/control_xy_parity.rs:92:13:
row 264 corner_x: 2.4494898 != upstream 2.5 (diff 0.050510168)

failures:
    the_acceleration_limiters_match_upstream
    the_shapers_match_upstream

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
