*** crates/ap-math/src/control.rs:763:81: replace * with + in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with + in limit_accel_corner_xy
@@ -755,17 +755,17 @@
 
     let vel_unit = vel.normalized_or_zero();
     let mut accel_dir_scalar = accel.dot(vel_unit);
     let mut accel_dir = vel_unit * accel_dir_scalar;
     let mut accel_cross = *accel - accel_dir;
 
     if is_positive(accel_dir_scalar) {
         let accel_cross_mag = accel_cross.length().min(accel_max);
-        let accel_along_max = safe_sqrt(accel_max * accel_max - accel_cross_mag * accel_cross_mag);
+        let accel_along_max = safe_sqrt(accel_max * accel_max - accel_cross_mag + /* ~ changed by cargo-mutants ~ */ accel_cross_mag);
 
         accel_cross.limit_length(accel_max);
         accel_dir.limit_length(accel_along_max);
 
         *accel = accel_cross + accel_dir;
         return true;
     }

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (3928094) panicked at crates/ap-math/tests/control_xy_parity.rs:92:13:
row 301 corner_x: 3 != upstream 1.6583124 (diff 1.3416876)

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (3928096) panicked at crates/ap-math/tests/control_xy_parity.rs:195:13:
step 5 sva_y: -0.04271085 != upstream -0.04277144 (diff 0.000060591847)

failures:
    the_acceleration_limiters_match_upstream
    the_shapers_match_upstream

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
