*** crates/ap-math/src/control.rs:773:26: replace * with / in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in limit_accel_corner_xy
@@ -765,17 +765,17 @@
         accel_cross.limit_length(accel_max);
         accel_dir.limit_length(accel_along_max);
 
         *accel = accel_cross + accel_dir;
         return true;
     }
 
     accel_dir_scalar = accel_dir_scalar.max(-accel_max);
-    accel_dir = vel_unit * accel_dir_scalar;
+    accel_dir = vel_unit / /* ~ changed by cargo-mutants ~ */ accel_dir_scalar;
 
     let accel_cross_max = safe_sqrt(accel_max * accel_max - accel_dir_scalar * accel_dir_scalar);
     accel_cross.limit_length(accel_cross_max);
 
     *accel = accel_cross + accel_dir;
     true
 }

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (3934890) panicked at crates/ap-math/tests/control_xy_parity.rs:92:13:
row 231 corner_x: -45754668 != upstream -0.000000021855694 (diff 45754668)

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (3934893) panicked at crates/ap-math/tests/control_xy_parity.rs:195:13:
step 503 sva_x: -0.2534347 != upstream -0.32493657 (diff 0.07150188)

failures:
    the_acceleration_limiters_match_upstream
    the_shapers_match_upstream

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
