*** crates/ap-math/src/control.rs:775:78: replace * with / in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in limit_accel_corner_xy
@@ -767,17 +767,17 @@
 
         *accel = accel_cross + accel_dir;
         return true;
     }
 
     accel_dir_scalar = accel_dir_scalar.max(-accel_max);
     accel_dir = vel_unit * accel_dir_scalar;
 
-    let accel_cross_max = safe_sqrt(accel_max * accel_max - accel_dir_scalar * accel_dir_scalar);
+    let accel_cross_max = safe_sqrt(accel_max * accel_max - accel_dir_scalar / /* ~ changed by cargo-mutants ~ */ accel_dir_scalar);
     accel_cross.limit_length(accel_cross_max);
 
     *accel = accel_cross + accel_dir;
     true
 }
 
 #[cfg(test)]
 mod tests {

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (338836) panicked at crates/ap-math/tests/control_xy_parity.rs:92:13:
row 303 corner_y: 2.8284268 != upstream 3 (diff 0.17157316)

failures:
    the_acceleration_limiters_match_upstream

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
