*** crates/ap-math/src/control.rs:788:8: delete ! in sqrt_controller_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in sqrt_controller_xy
@@ -780,17 +780,17 @@
 ///
 /// Scalar controller on the error's *length*, with the result pointed back
 /// along the error. So the correction never changes direction, only magnitude
 /// — a per-axis version would corner differently depending on which way the
 /// error happened to lie.
 #[must_use]
 pub fn sqrt_controller_xy(error: Vector2f, p: f32, second_ord_lim: f32, dt: f32) -> Vector2f {
     let error_length = error.length();
-    if !is_positive(error_length) {
+    if  /* ~ changed by cargo-mutants ~ */is_positive(error_length) {
         return Vector2f::new(0.0, 0.0);
     }
     let correction_length = sqrt_controller(error_length, p, second_ord_lim, dt);
     error * (correction_length / error_length)
 }
 
 /// Limit acceleration, prioritising cross-track — upstream `limit_accel_xy`.
 ///

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (2127916) panicked at crates/ap-math/tests/control_xy_parity.rs:196:13:
step 0 sva_x: 0 != upstream 0.074833885 (diff 0.074833885)

failures:
    the_shapers_match_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
