*** crates/ap-math/src/control.rs:811:44: replace * with + in limit_accel_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with + in limit_accel_xy
@@ -803,17 +803,17 @@
 /// With no velocity there is no track to be cross to, and it falls back to a
 /// plain magnitude limit.
 ///
 /// Returns whether any limiting happened.
 pub fn limit_accel_xy(vel: Vector2f, accel: &mut Vector2f, accel_max: f32) -> bool {
     if !is_positive(accel_max) {
         return false;
     }
-    if accel.length_squared() <= accel_max * accel_max {
+    if accel.length_squared() <= accel_max + /* ~ changed by cargo-mutants ~ */ accel_max {
         return false;
     }
 
     if vel.is_zero() {
         accel.limit_length(accel_max);
         return true;
     }

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (2141629) panicked at crates/ap-math/tests/control_xy_parity.rs:98:9:
assertion `left == right` failed: row 48 plain return
  left: true
 right: false

failures:
    the_acceleration_limiters_match_upstream

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
