*** crates/ap-math/src/control.rs:858:8: delete ! in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete ! in limit_accel_corner_xy
@@ -850,17 +850,17 @@
 /// where holding the curve matters least.
 ///
 /// The pre-limit to twice `accel_max` before decomposing is upstream's, and
 /// its comment explains it: the demand is often proportional to velocity
 /// error and can be enormous, which makes the direction ill-conditioned. Two
 /// times leaves room for the decomposition to be meaningful while bounding
 /// the input.
 pub fn limit_accel_corner_xy(vel: Vector2f, accel: &mut Vector2f, accel_max: f32) -> bool {
-    if !is_positive(accel_max) {
+    if  /* ~ changed by cargo-mutants ~ */is_positive(accel_max) {
         return false;
     }
 
     if vel.is_zero() {
         return accel.limit_length(accel_max);
     }
 
     accel.limit_length(2.0 * accel_max);

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (2164726) panicked at crates/ap-math/tests/control_xy_parity.rs:93:13:
row 0 corner_x: 0 != upstream 0.5 (diff 0.5)

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2164728) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 0 out_x: 0.04989422 != upstream 0.049986735 (diff 0.00009251386)

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (2164730) panicked at crates/ap-math/tests/control_xy_parity.rs:196:13:
step 0 sva_x: 0.0749706 != upstream 0.074833885 (diff 0.00013671815)

failures:
    the_acceleration_limiters_match_upstream
    the_position_loop_matches_upstream
    the_shapers_match_upstream

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
