*** crates/ap-math/src/control.rs:866:28: replace * with / in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in limit_accel_corner_xy
@@ -858,17 +858,17 @@
     if !is_positive(accel_max) {
         return false;
     }
 
     if vel.is_zero() {
         return accel.limit_length(accel_max);
     }
 
-    accel.limit_length(2.0 * accel_max);
+    accel.limit_length(2.0 / /* ~ changed by cargo-mutants ~ */ accel_max);
 
     let vel_unit = vel.normalized_or_zero();
     let mut accel_dir_scalar = accel.dot(vel_unit);
     let mut accel_dir = vel_unit * accel_dir_scalar;
     let mut accel_cross = *accel - accel_dir;
 
     if is_positive(accel_dir_scalar) {
         let accel_cross_mag = accel_cross.length().min(accel_max);

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2166532) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 1 out_x: 0.09696674 != upstream 0.09984848 (diff 0.0028817356)

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (2166530) panicked at crates/ap-math/tests/control_xy_parity.rs:93:13:
row 240 corner_x: 0.16666667 != upstream 0.5 (diff 0.3333333)

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (2166534) panicked at crates/ap-math/tests/control_xy_parity.rs:196:13:
step 0 sva_x: 0.04801383 != upstream 0.074833885 (diff 0.026820056)

failures:
    the_acceleration_limiters_match_upstream
    the_position_loop_matches_upstream
    the_shapers_match_upstream

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
