*** crates/ap-math/src/control.rs:870:34: replace * with / in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in limit_accel_corner_xy
@@ -862,17 +862,17 @@
     if vel.is_zero() {
         return accel.limit_length(accel_max);
     }
 
     accel.limit_length(2.0 * accel_max);
 
     let vel_unit = vel.normalized_or_zero();
     let mut accel_dir_scalar = accel.dot(vel_unit);
-    let mut accel_dir = vel_unit * accel_dir_scalar;
+    let mut accel_dir = vel_unit / /* ~ changed by cargo-mutants ~ */ accel_dir_scalar;
     let mut accel_cross = *accel - accel_dir;
 
     if is_positive(accel_dir_scalar) {
         let accel_cross_mag = accel_cross.length().min(accel_max);
         let accel_along_max = safe_sqrt(accel_max * accel_max - accel_cross_mag * accel_cross_mag);
 
         accel_cross.limit_length(accel_max);
         accel_dir.limit_length(accel_along_max);

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2169876) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 1 out_x: 0.09997223 != upstream 0.09984848 (diff 0.00012375414)

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (2169874) panicked at crates/ap-math/tests/control_xy_parity.rs:93:13:
row 230 corner_x: -2.9801977 != upstream 0.24999999 (diff 3.2301977)

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (2169878) panicked at crates/ap-math/tests/control_xy_parity.rs:196:13:
step 1 sva_x: 0.14964834 != upstream 0.14960667 (diff 0.000041663647)

failures:
    the_acceleration_limiters_match_upstream
    the_position_loop_matches_upstream
    the_shapers_match_upstream

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
