*** crates/ap-math/src/control.rs:875:63: replace - with + in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace - with + in limit_accel_corner_xy
@@ -867,17 +867,17 @@
 
     let vel_unit = vel.normalized_or_zero();
     let mut accel_dir_scalar = accel.dot(vel_unit);
     let mut accel_dir = vel_unit * accel_dir_scalar;
     let mut accel_cross = *accel - accel_dir;
 
     if is_positive(accel_dir_scalar) {
         let accel_cross_mag = accel_cross.length().min(accel_max);
-        let accel_along_max = safe_sqrt(accel_max * accel_max - accel_cross_mag * accel_cross_mag);
+        let accel_along_max = safe_sqrt(accel_max * accel_max + /* ~ changed by cargo-mutants ~ */ accel_cross_mag * accel_cross_mag);
 
         accel_cross.limit_length(accel_max);
         accel_dir.limit_length(accel_along_max);
 
         *accel = accel_cross + accel_dir;
         return true;
     }

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2172312) panicked at crates/ap-math/tests/control_xy_parity.rs:413:13:
step 5 pos_y: the port has flown to 5.999999604855455, upstream to 5.99999960382271 — the trajectories have diverged

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (2172310) panicked at crates/ap-math/tests/control_xy_parity.rs:93:13:
row 301 corner_x: 3.905125 != upstream 1.6583124 (diff 2.2468123)

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (2172314) panicked at crates/ap-math/tests/control_xy_parity.rs:196:13:
step 4 sva_y: -0.033414073 != upstream -0.033473954 (diff 0.000059880316)

failures:
    the_acceleration_limiters_match_upstream
    the_position_loop_matches_upstream
    the_shapers_match_upstream

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
