*** crates/ap-math/src/control.rs:875:63: replace - with / in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace - with / in limit_accel_corner_xy
@@ -867,17 +867,17 @@
 
     let vel_unit = vel.normalized_or_zero();
     let mut accel_dir_scalar = accel.dot(vel_unit);
     let mut accel_dir = vel_unit * accel_dir_scalar;
     let mut accel_cross = *accel - accel_dir;
 
     if is_positive(accel_dir_scalar) {
         let accel_cross_mag = accel_cross.length().min(accel_max);
-        let accel_along_max = safe_sqrt(accel_max * accel_max - accel_cross_mag * accel_cross_mag);
+        let accel_along_max = safe_sqrt(accel_max * accel_max / /* ~ changed by cargo-mutants ~ */ accel_cross_mag * accel_cross_mag);
 
         accel_cross.limit_length(accel_max);
         accel_dir.limit_length(accel_along_max);
 
         *accel = accel_cross + accel_dir;
         return true;
     }

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (2176854) panicked at crates/ap-math/tests/control_xy_parity.rs:93:13:
row 228 corner_x: 0 != upstream 0.5 (diff 0.5)

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2176856) panicked at crates/ap-math/tests/control_xy_parity.rs:413:13:
step 8 pos_y: the port has flown to 5.999998446579919, upstream to 5.999998445423779 — the trajectories have diverged

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (2176858) panicked at crates/ap-math/tests/control_xy_parity.rs:196:13:
step 0 sva_x: 0 != upstream 0.074833885 (diff 0.074833885)

failures:
    the_acceleration_limiters_match_upstream
    the_position_loop_matches_upstream
    the_shapers_match_upstream

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
