*** crates/ap-math/src/control.rs:884:45: delete - in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete - in limit_accel_corner_xy
@@ -876,17 +876,17 @@
 
         accel_cross.limit_length(accel_max);
         accel_dir.limit_length(accel_along_max);
 
         *accel = accel_cross + accel_dir;
         return true;
     }
 
-    accel_dir_scalar = accel_dir_scalar.max(-accel_max);
+    accel_dir_scalar = accel_dir_scalar.max( /* ~ changed by cargo-mutants ~ */accel_max);
     accel_dir = vel_unit * accel_dir_scalar;
 
     let accel_cross_max = safe_sqrt(accel_max * accel_max - accel_dir_scalar * accel_dir_scalar);
     accel_cross.limit_length(accel_cross_max);
 
     *accel = accel_cross + accel_dir;
     true
 }

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (2187841) panicked at crates/ap-math/tests/control_xy_parity.rs:93:13:
row 231 corner_x: 3 != upstream -0.000000021855694 (diff 3)

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2187843) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 608 out_x: 1.4487592 != upstream 1.3498179 (diff 0.098941326)

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (2187845) panicked at crates/ap-math/tests/control_xy_parity.rs:196:13:
step 503 sva_x: -0.39518324 != upstream -0.32493657 (diff 0.07024667)

failures:
    the_acceleration_limiters_match_upstream
    the_position_loop_matches_upstream
    the_shapers_match_upstream

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
