*** crates/ap-math/src/control.rs:887:47: replace * with / in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in limit_accel_corner_xy
@@ -879,17 +879,17 @@
 
         *accel = accel_cross + accel_dir;
         return true;
     }
 
     accel_dir_scalar = accel_dir_scalar.max(-accel_max);
     accel_dir = vel_unit * accel_dir_scalar;
 
-    let accel_cross_max = safe_sqrt(accel_max * accel_max - accel_dir_scalar * accel_dir_scalar);
+    let accel_cross_max = safe_sqrt(accel_max / /* ~ changed by cargo-mutants ~ */ accel_max - accel_dir_scalar * accel_dir_scalar);
     accel_cross.limit_length(accel_cross_max);
 
     *accel = accel_cross + accel_dir;
     true
 }
 
 #[cfg(test)]
 mod tests {

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (2193283) panicked at crates/ap-math/tests/control_xy_parity.rs:93:13:
row 267 corner_y: 1 != upstream 2.5 (diff 1.5)

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2193285) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 624 out_x: 0.5605502 != upstream 0.5600758 (diff 0.00047439337)

failures:
    the_acceleration_limiters_match_upstream
    the_position_loop_matches_upstream

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
