*** crates/ap-math/src/control.rs:890:26: replace + with - in limit_accel_corner_xy

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace + with - in limit_accel_corner_xy
@@ -882,17 +882,17 @@
     }
 
     accel_dir_scalar = accel_dir_scalar.max(-accel_max);
     accel_dir = vel_unit * accel_dir_scalar;
 
     let accel_cross_max = safe_sqrt(accel_max * accel_max - accel_dir_scalar * accel_dir_scalar);
     accel_cross.limit_length(accel_cross_max);
 
-    *accel = accel_cross + accel_dir;
+    *accel = accel_cross - /* ~ changed by cargo-mutants ~ */ accel_dir;
     true
 }
 
 #[cfg(test)]
 mod tests {
     #![allow(
         clippy::float_cmp,
         reason = "several tests assert a value was left exactly alone, which is the \

---- the_position_loop_matches_upstream stdout ----

thread 'the_position_loop_matches_upstream' (2195766) panicked at crates/ap-math/tests/control_xy_parity.rs:437:13:
step 610 out_y: -0.30334583 != upstream -0.30340162 (diff 0.000055789948)

---- the_shapers_match_upstream stdout ----

thread 'the_shapers_match_upstream' (2195768) panicked at crates/ap-math/tests/control_xy_parity.rs:196:13:
step 503 sva_x: -0.3284484 != upstream -0.32493657 (diff 0.003511846)

---- the_acceleration_limiters_match_upstream stdout ----

thread 'the_acceleration_limiters_match_upstream' (2195764) panicked at crates/ap-math/tests/control_xy_parity.rs:93:13:
row 232 corner_x: 0.25000003 != upstream -0.25000003 (diff 0.50000006)

failures:
    the_acceleration_limiters_match_upstream
    the_position_loop_matches_upstream
    the_shapers_match_upstream

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
