*** crates/ap-math/src/control.rs:97:43: replace * with / in update_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in update_pos_vel_accel
@@ -89,17 +89,17 @@
     pos: &mut Postype,
     vel: &mut f32,
     accel: f32,
     dt: f32,
     limit: f32,
     pos_error: f32,
     vel_error: f32,
 ) {
-    let mut delta_pos = *vel * dt + accel * 0.5 * sq(dt);
+    let mut delta_pos = *vel * dt + accel / /* ~ changed by cargo-mutants ~ */ 0.5 * sq(dt);
     if is_positive(delta_pos * limit) && is_positive(pos_error * limit) {
         delta_pos = 0.0;
     }
     *pos += Postype::from(delta_pos);
 
     update_vel_accel(vel, accel, dt, limit, vel_error);
 }

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (3392693) panicked at crates/ap-math/tests/control_parity.rs:176:17:
loop position at step 0: 0.0000199999976757681 against upstream 0.000004999999418942025

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
