*** crates/ap-math/src/control.rs:97:49: replace * with + in update_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with + in update_pos_vel_accel
@@ -89,17 +89,17 @@
     pos: &mut Postype,
     vel: &mut f32,
     accel: f32,
     dt: f32,
     limit: f32,
     pos_error: f32,
     vel_error: f32,
 ) {
-    let mut delta_pos = *vel * dt + accel * 0.5 * sq(dt);
+    let mut delta_pos = *vel * dt + accel * 0.5 + /* ~ changed by cargo-mutants ~ */ sq(dt);
     if is_positive(delta_pos * limit) && is_positive(pos_error * limit) {
         delta_pos = 0.0;
     }
     *pos += Postype::from(delta_pos);
 
     update_vel_accel(vel, accel, dt, limit, vel_error);
 }

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (1600371) panicked at crates/ap-math/src/control.rs:1065:9:
settled at 99.35831005737418, wanted 100

failures:
    control::tests::a_position_demand_is_tracked_and_settles

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
