*** crates/ap-math/src/control.rs:97:5: replace update_pos_vel_accel with ()

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace update_pos_vel_accel with ()
@@ -89,23 +89,17 @@
     pos: &mut Postype,
     vel: &mut f32,
     accel: f32,
     dt: f32,
     limit: f32,
     pos_error: f32,
     vel_error: f32,
 ) {
-    let mut delta_pos = *vel * dt + accel * 0.5 * sq(dt);
-    if is_positive(delta_pos * limit) && is_positive(pos_error * limit) {
-        delta_pos = 0.0;
-    }
-    *pos += Postype::from(delta_pos);
-
-    update_vel_accel(vel, accel, dt, limit, vel_error);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Move an acceleration toward a target without exceeding a jerk limit,
 /// upstream `shape_accel`.
 ///
 /// # Errors
 ///
 /// [`ShapeError::JerkNotPositive`] if `jerk_max` is not positive. Upstream

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (3978444) panicked at crates/ap-math/src/control.rs:947:9:
settled at 0, wanted 100

failures:
    control::tests::a_position_demand_is_tracked_and_settles

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
