*** crates/ap-math/src/control.rs:98:30: replace * with + in update_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with + in update_pos_vel_accel
@@ -90,17 +90,17 @@
     vel: &mut f32,
     accel: f32,
     dt: f32,
     limit: f32,
     pos_error: f32,
     vel_error: f32,
 ) {
     let mut delta_pos = *vel * dt + accel * 0.5 * sq(dt);
-    if is_positive(delta_pos * limit) && is_positive(pos_error * limit) {
+    if is_positive(delta_pos + /* ~ changed by cargo-mutants ~ */ limit) && is_positive(pos_error * limit) {
         delta_pos = 0.0;
     }
     *pos += Postype::from(delta_pos);
 
     update_vel_accel(vel, accel, dt, limit, vel_error);
 }
 
 /// Move an acceleration toward a target without exceeding a jerk limit,

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (1610352) panicked at crates/ap-math/tests/control_parity.rs:126:17:
update_pos_vel_accel position: 6.894000053405762 != upstream 7.5

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
