*** crates/ap-math/src/control.rs:98:39: replace && with || in update_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace && with || in update_pos_vel_accel
@@ -90,17 +90,17 @@
     vel: &mut f32,
     accel: f32,
     dt: f32,
     limit: f32,
     pos_error: f32,
     vel_error: f32,
 ) {
     let mut delta_pos = *vel * dt + accel * 0.5 * sq(dt);
-    if is_positive(delta_pos * limit) && is_positive(pos_error * limit) {
+    if is_positive(delta_pos * limit) || /* ~ changed by cargo-mutants ~ */ is_positive(pos_error * limit) {
         delta_pos = 0.0;
     }
     *pos += Postype::from(delta_pos);
 
     update_vel_accel(vel, accel, dt, limit, vel_error);
 }
 
 /// Move an acceleration toward a target without exceeding a jerk limit,

*** result: Success
