*** crates/ap-servo/src/function.rs:381:27: replace < with == in Function::valid

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace < with == in Function::valid
@@ -373,17 +373,17 @@
     ///
     /// Upstream also tests the lower bound against `k_none`. That half is
     /// vacuous here -- `k_none` is zero and the value is unsigned -- so it
     /// is asserted at compile time below instead, which is stronger: if
     /// `k_none` ever stopped being zero this would fail to build rather
     /// than quietly accept every value.
     #[must_use]
     pub const fn valid(self) -> bool {
-        (self.0 as usize) < NR_AUX_SERVO_FUNCTIONS
+        (self.0 as usize) == /* ~ changed by cargo-mutants ~ */ NR_AUX_SERVO_FUNCTIONS
     }
 
     /// The function driving a zero-based motor channel, upstream
     /// `SRV_Channels::get_motor_function`.
     ///
     /// Three ranges, not one. Motors 1-8 are contiguous, then 9-12 sit
     /// elsewhere in the enum, then 13 onward somewhere else again --
     /// because the later motor functions were added long after the first

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1454641) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 0 (estop false, scaled 0): 0 != upstream 1000
  left: 0
 right: 1000

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
