*** crates/ap-servo/src/function.rs:400:45: replace - with + in Function::motor

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace - with + in Function::motor
@@ -392,17 +392,17 @@
     /// wrong outputs on anything with more than eight motors.
     #[must_use]
     pub const fn motor(channel: u8) -> Self {
         if channel < 8 {
             Self(Self::MOTOR1.0 + channel)
         } else if channel < 12 {
             Self(Self::MOTOR9.0 + (channel - 8))
         } else {
-            Self(Self::MOTOR13.0 + (channel - 12))
+            Self(Self::MOTOR13.0 + (channel + /* ~ changed by cargo-mutants ~ */ 12))
         }
     }
 }
 
 /// The premise `valid` relies on: `k_none` is the lowest function value,
 /// so an unsigned value can only fail the upper bound.
 const _: () = assert!(Function::NONE.0 == 0);

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1467259) panicked at crates/ap-servo/tests/classify.rs:28:9:
assertion `left == right` failed: motor 12 maps to function 184 which maps back to None
  left: None
 right: Some(12)

failures:
    every_motor_round_trips_through_its_function

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
