*** crates/ap-servo/src/function.rs:428:9: replace Function::should_e_stop -> bool with false

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace Function::should_e_stop -> bool with false
@@ -420,17 +420,17 @@
     163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179,
 ];
 
 impl Function {
     /// Whether an emergency stop must zero this function, upstream
     /// `should_e_stop`.
     #[must_use]
     pub fn should_e_stop(self) -> bool {
-        E_STOP.binary_search(&self.0).is_ok()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A channel's default output shape, upstream's `set_range` and
 /// `set_angle`.
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub enum DefaultOutput {
     /// One-sided: 0 to this value.

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1468943) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 4 channel 2 (estop true, scaled 0): 1777 != upstream 1000
  left: 1777
 right: 1000

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
