*** crates/ap-servo/src/function.rs:565:45: replace <= with > in Function::is_motor

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace <= with > in Function::is_motor
@@ -557,17 +557,17 @@
 impl Function {
     /// Whether this drives a multicopter motor, upstream `is_motor`.
     ///
     /// The same three ranges as [`Self::motor`], expressed against the
     /// generated constants so they move together if upstream
     /// renumbers.
     #[must_use]
     pub const fn is_motor(self) -> bool {
-        (self.0 >= Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0)
+        (self.0 >= Self::MOTOR1.0 && self.0 > /* ~ changed by cargo-mutants ~ */ Self::MOTOR8.0)
             || (self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0)
             || (self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0)
     }
 
     /// Whether this moves an aerodynamic surface, upstream
     /// `is_control_surface`.
     #[must_use]
     pub fn is_control_surface(self) -> bool {

---- every_function_classification_matches_upstream stdout ----

thread 'every_function_classification_matches_upstream' (1474681) panicked at crates/ap-servo/tests/classify.rs:197:9:
assertion `left == right` failed: function 33: is_motor
  left: false
 right: true

---- the_two_motor_predicates_agree stdout ----

thread 'the_two_motor_predicates_agree' (1474687) panicked at crates/ap-servo/tests/classify.rs:63:9:
assertion `left == right` failed: function 33: is_motor and motor_num disagree
  left: false
 right: true

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1474682) panicked at crates/ap-servo/tests/classify.rs:35:9:
function 33 should be a motor

failures:
    every_function_classification_matches_upstream
    every_motor_round_trips_through_its_function
    non_motor_functions_have_no_motor_number
    nothing_is_both_a_motor_and_a_control_surface
    the_two_motor_predicates_agree

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
