*** crates/ap-servo/src/function.rs:574:9: replace Function::is_control_surface -> bool with true

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace Function::is_control_surface -> bool with true
@@ -566,17 +566,17 @@
             || (self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0)
             || (self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0)
     }
 
     /// Whether this moves an aerodynamic surface, upstream
     /// `is_control_surface`.
     #[must_use]
     pub fn is_control_surface(self) -> bool {
-        CONTROL_SURFACE.binary_search(&self.0).is_ok()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The zero-based motor this function drives, upstream
     /// `get_motor_num`. `None` for anything that is not a motor.
     ///
     /// The exact inverse of [`Self::motor`], written once rather than
     /// transcribed a second time -- a round-trip test pins the pair
     /// together, which no amount of re-reading the three ranges would.

---- nothing_is_both_a_motor_and_a_control_surface stdout ----

thread 'nothing_is_both_a_motor_and_a_control_surface' (1480064) panicked at crates/ap-servo/tests/classify.rs:76:9:
function 33 claims to be both

---- every_function_classification_matches_upstream stdout ----

thread 'every_function_classification_matches_upstream' (1480061) panicked at crates/ap-servo/tests/classify.rs:204:9:
assertion `left == right` failed: function 0: is_control_surface
  left: true
 right: false

failures:
    every_function_classification_matches_upstream
    nothing_is_both_a_motor_and_a_control_surface

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
