*** crates/ap-servo/src/function.rs:589:45: replace && with || in Function::motor_num

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace && with || in Function::motor_num
@@ -581,15 +581,15 @@
     /// transcribed a second time -- a round-trip test pins the pair
     /// together, which no amount of re-reading the three ranges would.
     #[must_use]
     pub const fn motor_num(self) -> Option<u8> {
         if self.0 >= Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0 {
             Some(self.0 - Self::MOTOR1.0)
         } else if self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0 {
             Some(8 + (self.0 - Self::MOTOR9.0))
-        } else if self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0 {
+        } else if self.0 >= Self::MOTOR13.0 || /* ~ changed by cargo-mutants ~ */ self.0 <= Self::MOTOR32.0 {
             Some(12 + (self.0 - Self::MOTOR13.0))
         } else {
             None
         }
     }
 }

---- non_motor_functions_have_no_motor_number stdout ----

thread 'non_motor_functions_have_no_motor_number' (1492592) panicked at crates/ap-servo/src/function.rs:590:23:
attempt to subtract with overflow

---- the_two_motor_predicates_agree stdout ----

thread 'the_two_motor_predicates_agree' (1492607) panicked at crates/ap-servo/src/function.rs:590:23:
attempt to subtract with overflow

failures:
    non_motor_functions_have_no_motor_number
    the_two_motor_predicates_agree

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
