*** crates/ap-servo/src/function.rs:590:21: replace + with * in Function::motor_num

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace + with * in Function::motor_num
@@ -582,14 +582,14 @@
     /// together, which no amount of re-reading the three ranges would.
     #[must_use]
     pub const fn motor_num(self) -> Option<u8> {
         if self.0 >= Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0 {
             Some(self.0 - Self::MOTOR1.0)
         } else if self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0 {
             Some(8 + (self.0 - Self::MOTOR9.0))
         } else if self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0 {
-            Some(12 + (self.0 - Self::MOTOR13.0))
+            Some(12 * /* ~ changed by cargo-mutants ~ */ (self.0 - Self::MOTOR13.0))
         } else {
             None
         }
     }
 }

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1495570) panicked at crates/ap-servo/tests/classify.rs:28:9:
assertion `left == right` failed: motor 12 maps to function 160 which maps back to Some(0)
  left: Some(0)
 right: Some(12)

failures:
    every_motor_round_trips_through_its_function

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
