*** crates/ap-servo/src/function.rs:590:31: replace - with + in Function::motor_num

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace - with + in Function::motor_num
@@ -582,14 +582,14 @@
     /// together, which no amount of re-reading the three ranges would.
     #[must_use]
     pub const fn motor_num(self) -> Option<u8> {
         if self.0 >= Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0 {
             Some(self.0 - Self::MOTOR1.0)
         } else if self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0 {
             Some(8 + (self.0 - Self::MOTOR9.0))
         } else if self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0 {
-            Some(12 + (self.0 - Self::MOTOR13.0))
+            Some(12 + (self.0 + /* ~ changed by cargo-mutants ~ */ Self::MOTOR13.0))
         } else {
             None
         }
     }
 }

---- the_two_motor_predicates_agree stdout ----

thread 'the_two_motor_predicates_agree' (1496149) panicked at crates/ap-servo/src/function.rs:590:23:
attempt to add with overflow

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1496145) panicked at crates/ap-servo/src/function.rs:590:23:
attempt to add with overflow

failures:
    every_motor_round_trips_through_its_function
    the_two_motor_predicates_agree

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
