*** crates/ap-servo/src/lib.rs:132:27: replace <= with > in ServoChannel::pwm_from_range

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace <= with > in ServoChannel::pwm_from_range
@@ -124,17 +124,17 @@
 
     /// Pulse width for a `0..high_out` value, upstream `pwm_from_range`.
     ///
     /// A misconfigured channel — maximum not above minimum, or no range set —
     /// produces the minimum rather than an error. That is upstream's choice
     /// and it is the safe direction for a throttle.
     #[must_use]
     pub fn pwm_from_range(&self, scaled_value: f32) -> u16 {
-        if self.servo_max <= self.servo_min || self.high_out == 0 {
+        if self.servo_max > /* ~ changed by cargo-mutants ~ */ self.servo_min || self.high_out == 0 {
             return self.servo_min;
         }
         let high = f32::from(self.high_out);
         let mut v = constrain_value(scaled_value, 0.0, high);
         if self.reversed {
             v = high - v;
         }
         let span = f32::from(self.servo_max) - f32::from(self.servo_min);

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1405833) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 1 channel 0 (estop false, scaled 250): 1000 != upstream 1250
  left: 1000
 right: 1250

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
