*** crates/ap-servo/src/lib.rs:138:22: replace - with / in ServoChannel::pwm_from_range

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace - with / in ServoChannel::pwm_from_range
@@ -130,17 +130,17 @@
     #[must_use]
     pub fn pwm_from_range(&self, scaled_value: f32) -> u16 {
         if self.servo_max <= self.servo_min || self.high_out == 0 {
             return self.servo_min;
         }
         let high = f32::from(self.high_out);
         let mut v = constrain_value(scaled_value, 0.0, high);
         if self.reversed {
-            v = high - v;
+            v = high / /* ~ changed by cargo-mutants ~ */ v;
         }
         let span = f32::from(self.servo_max) - f32::from(self.servo_min);
         self.servo_min
             .wrapping_add(truncate_to_u16((v * span) / high))
     }
 
     /// Pulse width for a `-high_out..high_out` value, upstream
     /// `pwm_from_angle`.

---- pwm_conversion_matches_upstream stdout ----
1088 conversions compared, 476 of them degenerate

thread 'pwm_conversion_matches_upstream' (1405985) panicked at crates/ap-servo/tests/servo_parity.rs:116:5:
8 range conversion(s) disagree; first few:
  range min=1000 trim=1500 max=2000 high=4500 rev=true v=0: port 999, upstream 2000
  range min=1000 trim=1500 max=2000 high=4500 rev=true v=1: port 2000, upstream 1999
  range min=1000 trim=1500 max=2000 high=4500 rev=true v=-1: port 999, upstream 2000
  range min=1000 trim=1500 max=2000 high=4500 rev=true v=0.5: port 3000, upstream 1999
  range min=1000 trim=1500 max=2000 high=4500 rev=true v=-0.5: port 999, upstream 2000
  range min=1000 trim=1500 max=2000 high=4500 rev=true v=45: port 1022, upstream 1990
  range min=1000 trim=1500 max=2000 high=4500 rev=true v=-45: port 999, upstream 2000
  range min=1000 trim=1500 max=2000 high=4500 rev

failures:
    pwm_conversion_matches_upstream

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
