*** crates/ap-servo/src/lib.rs:140:46: replace - with / in ServoChannel::pwm_from_range

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace - with / in ServoChannel::pwm_from_range
@@ -132,17 +132,17 @@
         if self.servo_max <= self.servo_min || self.high_out == 0 {
             return self.servo_min;
         }
         let high = f32::from(self.high_out);
         let mut v = constrain_value(scaled_value, 0.0, high);
         if self.reversed {
             v = high - v;
         }
-        let span = f32::from(self.servo_max) - f32::from(self.servo_min);
+        let span = f32::from(self.servo_max) / /* ~ changed by cargo-mutants ~ */ f32::from(self.servo_min);
         self.servo_min
             .wrapping_add(truncate_to_u16((v * span) / high))
     }
 
     /// Pulse width for a `-high_out..high_out` value, upstream
     /// `pwm_from_angle`.
     ///
     /// The two halves are scaled independently, against `trim..max` above and

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1408847) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 1 channel 0 (estop false, scaled 250): 1000 != upstream 1250
  left: 1000
 right: 1250

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
