*** crates/ap-servo/src/lib.rs:153:9: replace ServoChannel::pwm_from_angle -> u16 with 0

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace ServoChannel::pwm_from_angle -> u16 with 0
@@ -145,35 +145,17 @@
     /// Pulse width for a `-high_out..high_out` value, upstream
     /// `pwm_from_angle`.
     ///
     /// The two halves are scaled independently, against `trim..max` above and
     /// `min..trim` below, so a trim that is not centred still reaches both
     /// endpoints at full deflection.
     #[must_use]
     pub fn pwm_from_angle(&self, scaled_value: f32) -> u16 {
-        if self.high_out == 0 {
-            return self.servo_trim;
-        }
-        let mut v = scaled_value;
-        if self.reversed {
-            v = -v;
-        }
-        let high = f32::from(self.high_out);
-        v = constrain_value(v, -high, high);
-
-        if v > 0.0 {
-            let span = f32::from(self.servo_max) - f32::from(self.servo_trim);
-            self.servo_trim
-                .wrapping_add(truncate_to_u16((v * span) / high))
-        } else {
-            let span = f32::from(self.servo_trim) - f32::from(self.servo_min);
-            self.servo_trim
-                .wrapping_sub(truncate_to_u16((-v * span) / high))
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Pulse width for this channel's configured mapping, upstream
     /// `pwm_from_scaled_value`.
     #[must_use]
     pub fn pwm_from_scaled_value(&self, scaled_value: f32) -> u16 {
         match self.output_type {
             OutputType::Angle => self.pwm_from_angle(scaled_value),

---- full_deflection_reaches_the_endpoints stdout ----

thread 'full_deflection_reaches_the_endpoints' (1412057) panicked at crates/ap-servo/tests/servo_parity.rs:131:5:
assertion `left == right` failed
  left: 0
 right: 2000

---- an_off_centre_trim_still_reaches_both_endpoints stdout ----

thread 'an_off_centre_trim_still_reaches_both_endpoints' (1412056) panicked at crates/ap-servo/tests/servo_parity.rs:146:5:
assertion `left == right` failed
  left: 0
 right: 2000

---- pwm_conversion_matches_upstream stdout ----
1088 conversions compared, 476 of them degenerate

thread 'pwm_conversion_matches_upstream' (1412058) panicked at crates/ap-servo/tests/servo_parity.rs:110:5:
8 angle conversion(s) disagree; first few:
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=0: port 0, upstream 1500
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=1: port 0, upstream 1500
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=-1: port 0, upstream 1500
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=0.5: port 0, upstream 1500
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=-0.5: port 0, upstream 1500
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=45: port 0, upstream 1505
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=-45: port 0, upstream 1495
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=1

failures:
    an_off_centre_trim_still_reaches_both_endpoints
    full_deflection_reaches_the_endpoints
    pwm_conversion_matches_upstream

test result: FAILED. 0 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
