*** crates/ap-servo/src/lib.rs:158:17: delete - in ServoChannel::pwm_from_angle

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ delete - in ServoChannel::pwm_from_angle
@@ -150,17 +150,17 @@
     /// endpoints at full deflection.
     #[must_use]
     pub fn pwm_from_angle(&self, scaled_value: f32) -> u16 {
         if self.high_out == 0 {
             return self.servo_trim;
         }
         let mut v = scaled_value;
         if self.reversed {
-            v = -v;
+            v =  /* ~ changed by cargo-mutants ~ */v;
         }
         let high = f32::from(self.high_out);
         v = constrain_value(v, -high, high);
 
         if v > 0.0 {
             let span = f32::from(self.servo_max) - f32::from(self.servo_trim);
             self.servo_trim
                 .wrapping_add(truncate_to_u16((v * span) / high))

---- pwm_conversion_matches_upstream stdout ----
1088 conversions compared, 476 of them degenerate

thread 'pwm_conversion_matches_upstream' (1414597) panicked at crates/ap-servo/tests/servo_parity.rs:110:5:
8 angle conversion(s) disagree; first few:
  angle min=1000 trim=1500 max=2000 high=4500 rev=true v=45: port 1505, upstream 1495
  angle min=1000 trim=1500 max=2000 high=4500 rev=true v=-45: port 1495, upstream 1505
  angle min=1000 trim=1500 max=2000 high=4500 rev=true v=100: port 1511, upstream 1489
  angle min=1000 trim=1500 max=2000 high=4500 rev=true v=-100: port 1489, upstream 1511
  angle min=1000 trim=1500 max=2000 high=4500 rev=true v=4500: port 2000, upstream 1000
  angle min=1000 trim=1500 max=2000 high=4500 rev=true v=-4500: port 1000, upstream 2000
  angle min=1000 trim=1500 max=2000 high=4500 rev=true v=9000: port 2000, upstream 1000
  angle min=1000 trim=1500 max=2000

failures:
    pwm_conversion_matches_upstream

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
