*** crates/ap-servo/src/lib.rs:161:32: delete - in ServoChannel::pwm_from_angle

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ delete - in ServoChannel::pwm_from_angle
@@ -153,17 +153,17 @@
         if self.high_out == 0 {
             return self.servo_trim;
         }
         let mut v = scaled_value;
         if self.reversed {
             v = -v;
         }
         let high = f32::from(self.high_out);
-        v = constrain_value(v, -high, high);
+        v = constrain_value(v,  /* ~ changed by cargo-mutants ~ */high, high);
 
         if v > 0.0 {
             let span = f32::from(self.servo_max) - f32::from(self.servo_trim);
             self.servo_trim
                 .wrapping_add(truncate_to_u16((v * span) / high))
         } else {
             let span = f32::from(self.servo_trim) - f32::from(self.servo_min);
             self.servo_trim

---- an_off_centre_trim_still_reaches_both_endpoints stdout ----

thread 'an_off_centre_trim_still_reaches_both_endpoints' (1415215) panicked at crates/ap-servo/tests/servo_parity.rs:147:5:
assertion `left == right` failed
  left: 2000
 right: 1000

---- full_deflection_reaches_the_endpoints stdout ----

thread 'full_deflection_reaches_the_endpoints' (1415219) panicked at crates/ap-servo/tests/servo_parity.rs:132:5:
assertion `left == right` failed
  left: 2000
 right: 1000

---- pwm_conversion_matches_upstream stdout ----
1088 conversions compared, 476 of them degenerate

thread 'pwm_conversion_matches_upstream' (1415220) panicked at crates/ap-servo/tests/servo_parity.rs:110:5:
8 angle conversion(s) disagree; first few:
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=0: port 2000, upstream 1500
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=1: port 2000, upstream 1500
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=-1: port 2000, upstream 1500
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=0.5: port 2000, upstream 1500
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=-0.5: port 2000, upstream 1500
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=45: port 2000, upstream 1505
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=-45: port 2000, upstream 1495
  angle min=1000 trim=1500 max=2000 hi

failures:
    an_off_centre_trim_still_reaches_both_endpoints
    full_deflection_reaches_the_endpoints
    pwm_conversion_matches_upstream

test result: FAILED. 0 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
