*** crates/ap-servo/src/lib.rs:164:50: replace - with / in ServoChannel::pwm_from_angle

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace - with / in ServoChannel::pwm_from_angle
@@ -156,17 +156,17 @@
         let mut v = scaled_value;
         if self.reversed {
             v = -v;
         }
         let high = f32::from(self.high_out);
         v = constrain_value(v, -high, high);
 
         if v > 0.0 {
-            let span = f32::from(self.servo_max) - f32::from(self.servo_trim);
+            let span = f32::from(self.servo_max) / /* ~ changed by cargo-mutants ~ */ f32::from(self.servo_trim);
             self.servo_trim
                 .wrapping_add(truncate_to_u16((v * span) / high))
         } else {
             let span = f32::from(self.servo_trim) - f32::from(self.servo_min);
             self.servo_trim
                 .wrapping_sub(truncate_to_u16((-v * span) / high))
         }
     }

---- full_deflection_reaches_the_endpoints stdout ----

thread 'full_deflection_reaches_the_endpoints' (1418992) panicked at crates/ap-servo/tests/servo_parity.rs:131:5:
assertion `left == right` failed
  left: 1501
 right: 2000

---- an_off_centre_trim_still_reaches_both_endpoints stdout ----

thread 'an_off_centre_trim_still_reaches_both_endpoints' (1418991) panicked at crates/ap-servo/tests/servo_parity.rs:146:5:
assertion `left == right` failed
  left: 1201
 right: 2000

---- pwm_conversion_matches_upstream stdout ----
1088 conversions compared, 476 of them degenerate

thread 'pwm_conversion_matches_upstream' (1418993) panicked at crates/ap-servo/tests/servo_parity.rs:110:5:
8 angle conversion(s) disagree; first few:
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=45: port 1500, upstream 1505
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=100: port 1500, upstream 1511
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=4500: port 1501, upstream 2000
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=9000: port 1501, upstream 2000
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=2249.9: port 1500, upstream 1749
  angle min=1000 trim=1500 max=2000 high=4500 rev=true v=-45: port 1500, upstream 1505
  angle min=1000 trim=1500 max=2000 high=4500 rev=true v=-100: port 1500, upstream 1511
  angle min=1000 trim=1500 max

failures:
    an_off_centre_trim_still_reaches_both_endpoints
    full_deflection_reaches_the_endpoints
    pwm_conversion_matches_upstream

test result: FAILED. 0 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
