*** crates/ap-servo/src/lib.rs:178:9: replace ServoChannel::pwm_from_scaled_value -> u16 with 1

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace ServoChannel::pwm_from_scaled_value -> u16 with 1
@@ -170,20 +170,17 @@
                 .wrapping_sub(truncate_to_u16((-v * span) / high))
         }
     }
 
     /// Pulse width for this channel's configured mapping, upstream
     /// `pwm_from_scaled_value`.
     #[must_use]
     pub fn pwm_from_scaled_value(&self, scaled_value: f32) -> u16 {
-        match self.output_type {
-            OutputType::Angle => self.pwm_from_angle(scaled_value),
-            OutputType::Range => self.pwm_from_range(scaled_value),
-        }
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Normalised output in `-1..1` about the midpoint of the travel,
     /// upstream `get_output_norm`.
     ///
     /// Note the midpoint here is the mean of minimum and maximum, *not* the
     /// trim — so a channel with an off-centre trim reports a non-zero
     /// normalised output when it is sitting at its own neutral.

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1428411) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 0 (estop false, scaled 0): 1 != upstream 1000
  left: 1
 right: 1000

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
