*** crates/ap-servo/src/lib.rs:192:9: replace ServoChannel::output_norm -> f32 with -1.0

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace ServoChannel::output_norm -> f32 with -1.0
@@ -184,32 +184,17 @@
     /// Normalised output in `-1..1` about the midpoint of the travel,
     /// upstream `get_output_norm`.
     ///
     /// Note the midpoint here is the mean of minimum and maximum, *not* the
     /// trim — so a channel with an off-centre trim reports a non-zero
     /// normalised output when it is sitting at its own neutral.
     #[must_use]
     pub fn output_norm(&self, output_pwm: u16) -> f32 {
-        let mid = (self.servo_max + self.servo_min) / 2;
-        if mid <= self.servo_min {
-            return 0.0;
-        }
-        let ret = if output_pwm < mid {
-            f32::from(mid - output_pwm) / -f32::from(mid - self.servo_min)
-        } else if output_pwm > mid {
-            f32::from(output_pwm - mid) / f32::from(self.servo_max - mid)
-        } else {
-            0.0
-        };
-        if self.reversed {
-            -ret
-        } else {
-            ret
-        }
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A named endpoint of a channel's travel, upstream `SRV_Channel::Limit`.
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub enum Limit {
     /// The neutral position.
     Trim,

*** result: Success
