*** crates/ap-servo/src/lib.rs:238:9: replace ServoChannel::limit_pwm -> u16 with 1

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace ServoChannel::limit_pwm -> u16 with 1
@@ -230,28 +230,11 @@
     /// deflection" wants the surface at one end, not the servo at one end.
     ///
     /// Trim does not swap. It is a single configured position rather than one
     /// end of a pair, so reversing has nothing to exchange it with — and a
     /// port that reversed it too would move the neutral point of every
     /// reversed channel.
     #[must_use]
     pub fn limit_pwm(&self, limit: Limit) -> u16 {
-        match limit {
-            Limit::Trim => self.servo_trim,
-            Limit::Min => {
-                if self.reversed {
-                    self.servo_max
-                } else {
-                    self.servo_min
-                }
-            }
-            Limit::Max => {
-                if self.reversed {
-                    self.servo_min
-                } else {
-                    self.servo_max
-                }
-            }
-            Limit::ZeroPwm => 0,
-        }
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }

---- reversing_swaps_the_ends_but_leaves_trim_alone stdout ----

thread 'reversing_swaps_the_ends_but_leaves_trim_alone' (1451746) panicked at crates/ap-servo/tests/classify.rs:124:5:
assertion `left == right` failed
  left: 1
 right: 1100

---- zero_pwm_is_zero stdout ----

thread 'zero_pwm_is_zero' (1451758) panicked at crates/ap-servo/tests/classify.rs:149:5:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    reversing_swaps_the_ends_but_leaves_trim_alone
    zero_pwm_is_zero

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
