*** crates/ap-servo/src/output_channel.rs:109:77: replace != with == in OutputChannel::calc_pwm

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace != with == in OutputChannel::calc_pwm
@@ -101,17 +101,17 @@
     }
 
     /// Compute the pulse from a scaled value, upstream `calc_pwm`.
     ///
     /// Does nothing at all if this channel is in the context's pulse-width
     /// mask: something wrote a pulse directly and that wins. See the module
     /// docs for why that outranks even an emergency stop.
     pub fn calc_pwm(&mut self, output_scaled: f32, ctx: &OutputContext) {
-        if self.ch_num < 32 && (ctx.have_pwm_mask & (1_u32 << self.ch_num)) != 0 {
+        if self.ch_num < 32 && (ctx.have_pwm_mask & (1_u32 << self.ch_num)) == /* ~ changed by cargo-mutants ~ */ 0 {
             return;
         }
 
         let mut output_scaled = output_scaled;
         let mut force = false;
         if ctx.emergency_stop && self.function.should_e_stop() {
             output_scaled = 0.0;
             force = true;

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1508343) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 0 (estop false, scaled 0): 0 != upstream 1000
  left: 0
 right: 1000

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
