*** crates/ap-servo/src/output_channel.rs:120:12: delete ! in OutputChannel::calc_pwm

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ delete ! in OutputChannel::calc_pwm
@@ -112,17 +112,17 @@
 
         let mut output_scaled = output_scaled;
         let mut force = false;
         if ctx.emergency_stop && self.function.should_e_stop() {
             output_scaled = 0.0;
             force = true;
         }
 
-        if !force && self.override_active {
+        if  /* ~ changed by cargo-mutants ~ */force && self.override_active {
             return;
         }
 
         self.output_pwm = self.config.pwm_from_scaled_value(output_scaled);
     }
 
     /// Read the output as a normalised value, upstream `get_output_norm`.
     ///

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1512340) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 2 (estop false, scaled 0): 1000 != upstream 1777
  left: 1000
 right: 1777

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
