*** crates/ap-servo/src/output_channel.rs:151:9: replace OutputChannel::output_norm -> f32 with 0.0

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace OutputChannel::output_norm -> f32 with 0.0
@@ -143,38 +143,17 @@
     /// into it, but nobody should read this as a deliberate asymmetric
     /// mapping — a mutation collapsing the two branches passes every test
     /// whose channels have an even span, which was all of them at first.
     ///
     /// A degenerate channel — one whose midpoint is at or below its minimum —
     /// reads zero rather than dividing by it.
     #[must_use]
     pub fn output_norm(&self) -> f32 {
-        let min = self.config.servo_min;
-        let max = self.config.servo_max;
-        let mid = (max + min) / 2;
-        if mid <= min {
-            return 0.0;
-        }
-
-        let pwm = f32::from(self.output_pwm);
-        let midf = f32::from(mid);
-        let ret = if self.output_pwm < mid {
-            (pwm - midf) / f32::from(mid - min)
-        } else if self.output_pwm > mid {
-            (pwm - midf) / f32::from(max - mid)
-        } else {
-            0.0
-        };
-
-        if self.config.reversed {
-            -ret
-        } else {
-            ret
-        }
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set a normalised output, upstream `set_output_norm`.
     ///
     /// `-1` to `1` about the mid point. Goes through
     /// [`Self::set_output_pwm`], so it is a direct pulse write and takes the
     /// mask with it — not the scaled path.
     pub fn set_output_norm(&mut self, value: f32) -> bool {

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1514054) panicked at crates/ap-servo/tests/slew_parity.rs:801:5:
the bottom of the travel should read -1, got 0

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1514057) panicked at crates/ap-servo/tests/slew_parity.rs:1115:9:
0.5 should read back as 0.5, got 0

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1514055) panicked at crates/ap-servo/tests/slew_parity.rs:746:9:
row 0 norm: 0 != upstream -1 (diff 1)

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream
    the_remaining_function_operations_do_something

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
