*** crates/ap-servo/src/output_channel.rs:153:31: replace / with * in OutputChannel::output_norm

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace / with * in OutputChannel::output_norm
@@ -145,17 +145,17 @@
     /// whose channels have an even span, which was all of them at first.
     ///
     /// A degenerate channel — one whose midpoint is at or below its minimum —
     /// reads zero rather than dividing by it.
     #[must_use]
     pub fn output_norm(&self) -> f32 {
         let min = self.config.servo_min;
         let max = self.config.servo_max;
-        let mid = (max + min) / 2;
+        let mid = (max + min) * /* ~ changed by cargo-mutants ~ */ 2;
         if mid <= min {
             return 0.0;
         }
 
         let pwm = f32::from(self.output_pwm);
         let midf = f32::from(mid);
         let ret = if self.output_pwm < mid {
             (pwm - midf) / f32::from(mid - min)

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1516935) panicked at crates/ap-servo/tests/slew_parity.rs:805:5:
the top of the travel should read +1, got -0.8123698

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1516940) panicked at crates/ap-servo/tests/slew_parity.rs:1115:9:
0.5 should read back as 0.5, got -0.85

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1516936) panicked at crates/ap-servo/tests/slew_parity.rs:746:9:
row 3 norm: -0.99530613 != upstream -0.9425 (diff 0.05280614)

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream
    the_remaining_function_operations_do_something

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
