*** crates/ap-servo/src/output_channel.rs:154:16: replace <= with > in OutputChannel::output_norm

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace <= with > in OutputChannel::output_norm
@@ -146,17 +146,17 @@
     ///
     /// A degenerate channel — one whose midpoint is at or below its minimum —
     /// reads zero rather than dividing by it.
     #[must_use]
     pub fn output_norm(&self) -> f32 {
         let min = self.config.servo_min;
         let max = self.config.servo_max;
         let mid = (max + min) / 2;
-        if mid <= min {
+        if mid > /* ~ changed by cargo-mutants ~ */ min {
             return 0.0;
         }
 
         let pwm = f32::from(self.output_pwm);
         let midf = f32::from(mid);
         let ret = if self.output_pwm < mid {
             (pwm - midf) / f32::from(mid - min)
         } else if self.output_pwm > mid {

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1518799) panicked at crates/ap-servo/tests/slew_parity.rs:801:5:
the bottom of the travel should read -1, got 0

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1518802) panicked at crates/ap-servo/tests/slew_parity.rs:1115:9:
0.5 should read back as 0.5, got 0

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1518800) panicked at crates/ap-servo/tests/slew_parity.rs:746:9:
row 0 norm: 0 != upstream -1 (diff 1)

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream
    the_remaining_function_operations_do_something

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
