*** crates/ap-servo/src/output_channel.rs:160:38: replace < with > in OutputChannel::output_norm

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace < with > in OutputChannel::output_norm
@@ -152,17 +152,17 @@
         let max = self.config.servo_max;
         let mid = (max + min) / 2;
         if mid <= min {
             return 0.0;
         }
 
         let pwm = f32::from(self.output_pwm);
         let midf = f32::from(mid);
-        let ret = if self.output_pwm < mid {
+        let ret = if self.output_pwm > /* ~ changed by cargo-mutants ~ */ mid {
             (pwm - midf) / f32::from(mid - min)
         } else if self.output_pwm > mid {
             (pwm - midf) / f32::from(max - mid)
         } else {
             0.0
         };
 
         if self.config.reversed {

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1520274) panicked at crates/ap-servo/tests/slew_parity.rs:801:5:
the bottom of the travel should read -1, got 0

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1520275) panicked at crates/ap-servo/tests/slew_parity.rs:746:9:
row 0 norm: 0 != upstream -1 (diff 1)

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
