*** crates/ap-servo/src/output_channel.rs:160:38: replace < with <= in OutputChannel::output_norm

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace < with <= in OutputChannel::output_norm
@@ -152,17 +152,17 @@
         let max = self.config.servo_max;
         let mid = (max + min) / 2;
         if mid <= min {
             return 0.0;
         }
 
         let pwm = f32::from(self.output_pwm);
         let midf = f32::from(mid);
-        let ret = if self.output_pwm < mid {
+        let ret = if self.output_pwm <= /* ~ changed by cargo-mutants ~ */ mid {
             (pwm - midf) / f32::from(mid - min)
         } else if self.output_pwm > mid {
             (pwm - midf) / f32::from(max - mid)
         } else {
             0.0
         };
 
         if self.config.reversed {

*** result: Success
