*** crates/ap-servo/src/output_channel.rs:161:18: replace - with / in OutputChannel::output_norm

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace - with / in OutputChannel::output_norm
@@ -153,17 +153,17 @@
         let mid = (max + min) / 2;
         if mid <= min {
             return 0.0;
         }
 
         let pwm = f32::from(self.output_pwm);
         let midf = f32::from(mid);
         let ret = if self.output_pwm < mid {
-            (pwm - midf) / f32::from(mid - min)
+            (pwm / /* ~ changed by cargo-mutants ~ */ midf) / f32::from(mid - min)
         } else if self.output_pwm > mid {
             (pwm - midf) / f32::from(max - mid)
         } else {
             0.0
         };
 
         if self.config.reversed {
             -ret

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1524428) panicked at crates/ap-servo/tests/slew_parity.rs:801:5:
the bottom of the travel should read -1, got 0.0015325671

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1524429) panicked at crates/ap-servo/tests/slew_parity.rs:746:9:
row 0 norm: 0.0018333334 != upstream -1 (diff 1.0018333)

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
