*** crates/ap-servo/src/output_channel.rs:163:26: replace / with % in OutputChannel::output_norm

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace / with % in OutputChannel::output_norm
@@ -155,17 +155,17 @@
             return 0.0;
         }
 
         let pwm = f32::from(self.output_pwm);
         let midf = f32::from(mid);
         let ret = if self.output_pwm < mid {
             (pwm - midf) / f32::from(mid - min)
         } else if self.output_pwm > mid {
-            (pwm - midf) / f32::from(max - mid)
+            (pwm - midf) % /* ~ changed by cargo-mutants ~ */ f32::from(max - mid)
         } else {
             0.0
         };
 
         if self.config.reversed {
             -ret
         } else {
             ret

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1529345) panicked at crates/ap-servo/tests/slew_parity.rs:805:5:
the top of the travel should read +1, got 0

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1529346) panicked at crates/ap-servo/tests/slew_parity.rs:746:9:
row 21 norm: 22 != upstream 0.055 (diff 21.945)

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1529360) panicked at crates/ap-servo/tests/slew_parity.rs:1115:9:
0.5 should read back as 0.5, got 250

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream
    the_remaining_function_operations_do_something

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
