*** crates/ap-servo/src/output_channel.rs:169:13: delete - in OutputChannel::output_norm

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ delete - in OutputChannel::output_norm
@@ -161,17 +161,17 @@
             (pwm - midf) / f32::from(mid - min)
         } else if self.output_pwm > mid {
             (pwm - midf) / f32::from(max - mid)
         } else {
             0.0
         };
 
         if self.config.reversed {
-            -ret
+             /* ~ changed by cargo-mutants ~ */ret
         } else {
             ret
         }
     }
 
     /// Set a normalised output, upstream `set_output_norm`.
     ///
     /// `-1` to `1` about the mid point. Goes through

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1533312) panicked at crates/ap-servo/tests/slew_parity.rs:746:9:
row 41 norm: 1 != upstream -1 (diff 2)

failures:
    the_normalised_read_matches_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
