*** crates/ap-servo/src/output_channel.rs:74:9: replace OutputChannel::output_pwm -> u16 with 0

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace OutputChannel::output_pwm -> u16 with 0
@@ -66,17 +66,17 @@
             output_pwm: 0,
             override_active: false,
         }
     }
 
     /// The pulse currently on the wire, upstream `output_pwm`.
     #[must_use]
     pub fn output_pwm(&self) -> u16 {
-        self.output_pwm
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether an override is holding this channel, upstream
     /// `override_active`.
     #[must_use]
     pub fn override_active(&self) -> bool {
         self.override_active
     }

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1498012) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 0 (estop false, scaled 0): 0 != upstream 1000
  left: 0
 right: 1000

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
