*** crates/ap-servo/src/registry.rs:146:9: replace Registry::invalid_mask -> ChannelMask with Default::default()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::invalid_mask -> ChannelMask with Default::default()
@@ -138,17 +138,17 @@
             self.invalid_mask
         }
     }
 
     /// The channels whose own `SERVOn_FUNCTION` is not a defined function,
     /// upstream `invalid_mask`.
     #[must_use]
     pub fn invalid_mask(&self) -> ChannelMask {
-        self.invalid_mask
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether the channel masks have been built, upstream `initialised`.
     #[must_use]
     pub fn initialised(&self) -> bool {
         self.initialised
     }

---- an_undefined_function_answers_with_the_invalid_channels stdout ----

thread 'an_undefined_function_answers_with_the_invalid_channels' (1539522) panicked at crates/ap-servo/tests/srv_functions.rs:168:5:
assertion `left == right` failed: channels 1 and 3 are invalid
  left: 0
 right: 10

failures:
    an_undefined_function_answers_with_the_invalid_channels

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
