*** crates/ap-servo/src/registry.rs:171:9: replace Registry::update_aux_servo_function with ()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::update_aux_servo_function with ()
@@ -163,36 +163,17 @@
     /// Everything is cleared first, so this is a rebuild rather than a merge —
     /// a channel moved from one function to another leaves no trace on the
     /// old one.
     ///
     /// Upstream also calls `aux_servo_function_setup()` per channel here,
     /// which configures that channel's range or angle limits. That belongs to
     /// the channel, not the registry, so it is not done here.
     pub fn update_aux_servo_function(&mut self, channel_functions: &[Function]) {
-        for f in &mut self.functions {
-            f.channel_mask = 0;
-        }
-        self.invalid_mask = 0;
-
-        for (i, &function) in channel_functions.iter().enumerate() {
-            if i >= 32 {
-                break;
-            }
-            let bit = 1_u32 << i;
-            if !function.valid() {
-                self.invalid_mask |= bit;
-                continue;
-            }
-            if let Some(entry) = self.functions.get_mut(usize::from(function.0)) {
-                entry.channel_mask |= bit;
-            }
-        }
-
-        self.initialised = true;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Write a function's scaled value, upstream `set_output_scaled`.
     ///
     /// Also clears this function's channels from the pulse-width mask. That
     /// second effect is the load-bearing one: it records that these channels
     /// are now driven by a scaled value, so whatever converts them to pulses
     /// knows to do the conversion rather than pass through a stale width.

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1541066) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 1 (estop false, scaled 0): 1000 != upstream 1234
  left: 1000
 right: 1234

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
