*** crates/ap-servo/src/registry.rs:177:18: replace >= with < in Registry::update_aux_servo_function

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace >= with < in Registry::update_aux_servo_function
@@ -169,17 +169,17 @@
     /// the channel, not the registry, so it is not done here.
     pub fn update_aux_servo_function(&mut self, channel_functions: &[Function]) {
         for f in &mut self.functions {
             f.channel_mask = 0;
         }
         self.invalid_mask = 0;
 
         for (i, &function) in channel_functions.iter().enumerate() {
-            if i >= 32 {
+            if i < /* ~ changed by cargo-mutants ~ */ 32 {
                 break;
             }
             let bit = 1_u32 << i;
             if !function.valid() {
                 self.invalid_mask |= bit;
                 continue;
             }
             if let Some(entry) = self.functions.get_mut(usize::from(function.0)) {

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1542135) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 1 (estop false, scaled 0): 1000 != upstream 1234
  left: 1000
 right: 1234

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
