*** crates/ap-servo/src/registry.rs:180:29: replace << with >> in Registry::update_aux_servo_function

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace << with >> in Registry::update_aux_servo_function
@@ -172,17 +172,17 @@
             f.channel_mask = 0;
         }
         self.invalid_mask = 0;
 
         for (i, &function) in channel_functions.iter().enumerate() {
             if i >= 32 {
                 break;
             }
-            let bit = 1_u32 << i;
+            let bit = 1_u32 >> /* ~ changed by cargo-mutants ~ */ i;
             if !function.valid() {
                 self.invalid_mask |= bit;
                 continue;
             }
             if let Some(entry) = self.functions.get_mut(usize::from(function.0)) {
                 entry.channel_mask |= bit;
             }
         }

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1542230) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 1 (estop false, scaled 0): 1000 != upstream 1234
  left: 1000
 right: 1234

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
