*** crates/ap-servo/src/registry.rs:181:16: delete ! in Registry::update_aux_servo_function

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::update_aux_servo_function
@@ -173,17 +173,17 @@
         }
         self.invalid_mask = 0;
 
         for (i, &function) in channel_functions.iter().enumerate() {
             if i >= 32 {
                 break;
             }
             let bit = 1_u32 << i;
-            if !function.valid() {
+            if  /* ~ changed by cargo-mutants ~ */function.valid() {
                 self.invalid_mask |= bit;
                 continue;
             }
             if let Some(entry) = self.functions.get_mut(usize::from(function.0)) {
                 entry.channel_mask |= bit;
             }
         }

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1543232) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 1 (estop false, scaled 0): 1000 != upstream 1234
  left: 1000
 right: 1234

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
