*** crates/ap-servo/src/registry.rs:182:35: replace |= with &= in Registry::update_aux_servo_function

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace |= with &= in Registry::update_aux_servo_function
@@ -174,17 +174,17 @@
         self.invalid_mask = 0;
 
         for (i, &function) in channel_functions.iter().enumerate() {
             if i >= 32 {
                 break;
             }
             let bit = 1_u32 << i;
             if !function.valid() {
-                self.invalid_mask |= bit;
+                self.invalid_mask &= /* ~ changed by cargo-mutants ~ */ bit;
                 continue;
             }
             if let Some(entry) = self.functions.get_mut(usize::from(function.0)) {
                 entry.channel_mask |= bit;
             }
         }
 
         self.initialised = true;

---- an_undefined_function_answers_with_the_invalid_channels stdout ----

thread 'an_undefined_function_answers_with_the_invalid_channels' (1544955) panicked at crates/ap-servo/tests/srv_functions.rs:168:5:
assertion `left == right` failed: channels 1 and 3 are invalid
  left: 0
 right: 10

---- the_aux_function_mapping_matches_upstream stdout ----

thread 'the_aux_function_mapping_matches_upstream' (1544959) panicked at crates/ap-servo/tests/srv_functions.rs:347:13:
assertion `left == right` failed: case 0 function 250: mask 0x0 != upstream 0xffff0000
  left: 0
 right: 4294901760

failures:
    an_undefined_function_answers_with_the_invalid_channels
    the_aux_function_mapping_matches_upstream

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
