*** crates/ap-servo/src/registry.rs:201:12: delete ! in Registry::set_output_scaled

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::set_output_scaled
@@ -193,17 +193,17 @@
     /// Write a function's scaled value, upstream `set_output_scaled`.
     ///
     /// Also clears this function's channels from the pulse-width mask. That
     /// second effect is the load-bearing one: it records that these channels
     /// are now driven by a scaled value, so whatever converts them to pulses
     /// knows to do the conversion rather than pass through a stale width.
     /// Dropping it leaves a channel holding the last pulse it was given.
     pub fn set_output_scaled(&mut self, function: Function, value: f32) {
-        if !function.valid() {
+        if  /* ~ changed by cargo-mutants ~ */function.valid() {
             return;
         }
         let Some(entry) = self.functions.get_mut(usize::from(function.0)) else {
             return;
         };
         entry.output_scaled = value;
         self.have_pwm_mask &= !entry.channel_mask;
     }

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1546241) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 1 channel 0 (estop false, scaled 250): 1000 != upstream 1250
  left: 1000
 right: 1250

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
