*** crates/ap-servo/src/registry.rs:208:31: delete ! in Registry::set_output_scaled

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::set_output_scaled
@@ -200,17 +200,17 @@
     pub fn set_output_scaled(&mut self, function: Function, value: f32) {
         if !function.valid() {
             return;
         }
         let Some(entry) = self.functions.get_mut(usize::from(function.0)) else {
             return;
         };
         entry.output_scaled = value;
-        self.have_pwm_mask &= !entry.channel_mask;
+        self.have_pwm_mask &=  /* ~ changed by cargo-mutants ~ */entry.channel_mask;
     }
 
     /// Read a function's scaled value, upstream `get_output_scaled`.
     ///
     /// Zero for an undefined function. Note this is a plain zero, not
     /// [`INVALID_MASK`]'s equivalent — upstream distinguishes invalid from
     /// unset for the channel mask but not for the value, and the port
     /// reproduces that rather than tidying it.

---- writing_a_scaled_value_clears_the_pulse_width_mask stdout ----

thread 'writing_a_scaled_value_clears_the_pulse_width_mask' (1548269) panicked at crates/ap-servo/tests/srv_functions.rs:232:5:
assertion `left == right` failed: only this function's channels should be cleared
  left: 10
 right: 5

failures:
    writing_a_scaled_value_clears_the_pulse_width_mask

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
