*** crates/ap-servo/src/registry.rs:219:9: replace Registry::output_scaled -> f32 with 0.0

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::output_scaled -> f32 with 0.0
@@ -211,23 +211,17 @@
     /// Read a function's scaled value, upstream `get_output_scaled`.
     ///
     /// Zero for an undefined function. Note this is a plain zero, not
     /// [`INVALID_MASK`]'s equivalent — upstream distinguishes invalid from
     /// unset for the channel mask but not for the value, and the port
     /// reproduces that rather than tidying it.
     #[must_use]
     pub fn output_scaled(&self, function: Function) -> f32 {
-        if function.valid() {
-            self.functions
-                .get(usize::from(function.0))
-                .map_or(0.0, |f| f.output_scaled)
-        } else {
-            0.0
-        }
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Install or update a slew limit, upstream `set_slew_rate`.
     ///
     /// `slew_rate` is a percentage of `range` per second, so a step may move by
     /// `range * rate * 0.01 * dt`.
     ///
     /// An entry is created even when the rate is zero, which upstream calls out

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1548552) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 1 channel 0 (estop false, scaled 250): 1000 != upstream 1250
  left: 1000
 right: 1250

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
