*** crates/ap-servo/src/registry.rs:251:43: replace * with + in Registry::set_slew_rate

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace * with + in Registry::set_slew_rate
@@ -243,17 +243,17 @@
         function: Function,
         slew_rate: f32,
         range: u16,
         dt: f32,
     ) -> bool {
         if !function.valid() {
             return false;
         }
-        let max_change = f32::from(range) * slew_rate * 0.01 * dt;
+        let max_change = f32::from(range) + /* ~ changed by cargo-mutants ~ */ slew_rate * 0.01 * dt;
 
         for entry in self.slew.iter_mut().flatten() {
             if entry.func == function {
                 entry.max_change = max_change;
                 return true;
             }
         }

---- a_disabled_limit_still_tracks_the_output stdout ----

thread 'a_disabled_limit_still_tracks_the_output' (1556108) panicked at crates/ap-servo/tests/slew_parity.rs:198:5:
the first limited step should leave 399.8, got 299.998

---- a_new_entry_starts_from_the_current_output stdout ----

thread 'a_new_entry_starts_from_the_current_output' (1556112) panicked at crates/ap-servo/tests/slew_parity.rs:308:5:
expected 250.2, got 350.002

---- the_slew_limiter_matches_upstream stdout ----

thread 'the_slew_limiter_matches_upstream' (1556124) panicked at crates/ap-servo/tests/slew_parity.rs:99:13:
step 40 peek_thr: 90 != upstream 1.1999999 (diff 88.8)

failures:
    a_disabled_limit_still_tracks_the_output
    a_new_entry_starts_from_the_current_output
    peeking_does_not_advance_the_slew_history
    the_slew_limiter_matches_upstream

test result: FAILED. 12 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
