*** crates/ap-servo/src/registry.rs:254:27: replace == with != in Registry::set_slew_rate

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace == with != in Registry::set_slew_rate
@@ -246,17 +246,17 @@
         dt: f32,
     ) -> bool {
         if !function.valid() {
             return false;
         }
         let max_change = f32::from(range) * slew_rate * 0.01 * dt;
 
         for entry in self.slew.iter_mut().flatten() {
-            if entry.func == function {
+            if entry.func != /* ~ changed by cargo-mutants ~ */ function {
                 entry.max_change = max_change;
                 return true;
             }
         }
 
         let current = self.output_scaled(function);
         for slot in &mut self.slew {
             if slot.is_none() {

---- a_full_slew_table_leaves_the_function_unlimited stdout ----

thread 'a_full_slew_table_leaves_the_function_unlimited' (1557860) panicked at crates/ap-servo/tests/slew_parity.rs:220:5:
assertion `left == right` failed
  left: 1
 right: 16

---- the_slew_limiter_matches_upstream stdout ----

thread 'the_slew_limiter_matches_upstream' (1557882) panicked at crates/ap-servo/tests/slew_parity.rs:99:13:
step 40 peek_thr: 90 != upstream 1.1999999 (diff 88.8)

failures:
    a_full_slew_table_leaves_the_function_unlimited
    the_slew_limiter_matches_upstream

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
