*** crates/ap-servo/src/registry.rs:305:9: replace Registry::slew_limited_output_scaled -> f32 with 1.0

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::slew_limited_output_scaled -> f32 with 1.0
@@ -297,36 +297,17 @@
     /// value that never moves. Both follow from what this is: a question about
     /// what the output *would* be, not a step of the filter.
     ///
     /// The `&self` is load-bearing: folding the peek and the step together is
     /// not a bug this port can express. Upstream's equivalent is a non-const
     /// static method and relies on the author not writing the assignment.
     #[must_use]
     pub fn slew_limited_output_scaled(&self, function: Function) -> f32 {
-        if !function.valid() {
-            return 0.0;
-        }
-        let value = self.output_scaled(function);
-        for entry in self.slew.iter().flatten() {
-            if entry.func == function {
-                if !is_positive(entry.max_change) {
-                    // Zero or negative reads as disabled. Upstream breaks
-                    // rather than continuing the search, which would only
-                    // differ if a function could appear twice — it cannot,
-                    // because `set_slew_rate` updates in place.
-                    break;
-                }
-                return value.clamp(
-                    entry.last_scaled_output - entry.max_change,
-                    entry.last_scaled_output + entry.max_change,
-                );
-            }
-        }
-        value
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Enforce every slew limit and advance the history, upstream the first
     /// half of `calc_pwm`.
     ///
     /// The counterpart to the read-only peek above: this writes the clamped
     /// value back into the function's scaled output, so the limit binds on
     /// everything that reads it afterwards.

---- the_slew_limiter_matches_upstream stdout ----

thread 'the_slew_limiter_matches_upstream' (1560835) panicked at crates/ap-servo/tests/slew_parity.rs:99:13:
step 0 peek_thr: 1 != upstream 0 (diff 1)

---- peeking_does_not_advance_the_slew_history stdout ----

thread 'peeking_does_not_advance_the_slew_history' (1560811) panicked at crates/ap-servo/tests/slew_parity.rs:156:9:
peek 0: 1 != upstream 500

failures:
    peeking_does_not_advance_the_slew_history
    the_slew_limiter_matches_upstream

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
