*** crates/ap-servo/src/registry.rs:338:9: replace Registry::apply_slew_limits with ()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::apply_slew_limits with ()
@@ -330,32 +330,17 @@
     /// The counterpart to the read-only peek above: this writes the clamped
     /// value back into the function's scaled output, so the limit binds on
     /// everything that reads it afterwards.
     ///
     /// The history advances even when the limit is disabled — upstream's update
     /// sits outside its `is_positive` check, and that is what makes installing
     /// a rate later safe.
     pub fn apply_slew_limits(&mut self) {
-        for slot in &mut self.slew {
-            let Some(entry) = slot else { continue };
-            if !entry.func.valid() {
-                continue;
-            }
-            let Some(f) = self.functions.get_mut(usize::from(entry.func.0)) else {
-                continue;
-            };
-            if is_positive(entry.max_change) {
-                f.output_scaled = f.output_scaled.clamp(
-                    entry.last_scaled_output - entry.max_change,
-                    entry.last_scaled_output + entry.max_change,
-                );
-            }
-            entry.last_scaled_output = f.output_scaled;
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Hold a channel at a pulse width for a while, upstream
     /// `set_output_pwm_chan_timeout`.
     ///
     /// The timeout is in milliseconds but the mechanism counts *loops*, so it
     /// is converted with a deliberate round-up: any non-zero request gets at
     /// least one loop rather than being rounded away to nothing. A scripted

---- a_disabled_limit_still_tracks_the_output stdout ----

thread 'a_disabled_limit_still_tracks_the_output' (1567893) panicked at crates/ap-servo/tests/slew_parity.rs:198:5:
the first limited step should leave 399.8, got 0

---- a_new_entry_starts_from_the_current_output stdout ----

thread 'a_new_entry_starts_from_the_current_output' (1567897) panicked at crates/ap-servo/tests/slew_parity.rs:308:5:
expected 250.2, got 1000

---- the_slew_limiter_matches_upstream stdout ----

thread 'the_slew_limiter_matches_upstream' (1567913) panicked at crates/ap-servo/tests/slew_parity.rs:99:13:
step 40 after_thr: 90 != upstream 1.1999999 (diff 88.8)

failures:
    a_disabled_limit_still_tracks_the_output
    a_new_entry_starts_from_the_current_output
    the_slew_limiter_matches_upstream

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
