*** crates/ap-servo/src/registry.rs:348:46: replace - with + in Registry::apply_slew_limits

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace - with + in Registry::apply_slew_limits
@@ -340,17 +340,17 @@
             if !entry.func.valid() {
                 continue;
             }
             let Some(f) = self.functions.get_mut(usize::from(entry.func.0)) else {
                 continue;
             };
             if is_positive(entry.max_change) {
                 f.output_scaled = f.output_scaled.clamp(
-                    entry.last_scaled_output - entry.max_change,
+                    entry.last_scaled_output + /* ~ changed by cargo-mutants ~ */ entry.max_change,
                     entry.last_scaled_output + entry.max_change,
                 );
             }
             entry.last_scaled_output = f.output_scaled;
         }
     }
 
     /// Hold a channel at a pulse width for a while, upstream

---- a_disabled_limit_still_tracks_the_output stdout ----

thread 'a_disabled_limit_still_tracks_the_output' (1569751) panicked at crates/ap-servo/tests/slew_parity.rs:198:5:
the first limited step should leave 399.8, got 400.2

---- a_new_entry_starts_from_the_current_output stdout ----

thread 'a_new_entry_starts_from_the_current_output' (1569756) panicked at crates/ap-servo/tests/slew_parity.rs:297:5:
assertion `left == right` failed: holding still must not move the output; a history seeded at zero would have clamped this to a fraction of a unit
  left: 250.2
 right: 250.0

---- the_slew_limiter_matches_upstream stdout ----

thread 'the_slew_limiter_matches_upstream' (1569794) panicked at crates/ap-servo/tests/slew_parity.rs:99:13:
step 0 after_thr: 1.1999999 != upstream 0 (diff 1.1999999)

failures:
    a_disabled_limit_still_tracks_the_output
    a_new_entry_starts_from_the_current_output
    the_slew_limiter_matches_upstream

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
