*** crates/ap-servo/src/registry.rs:394:27: replace == with != in Registry::set_output_pwm_chan_timeout

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace == with != in Registry::set_output_pwm_chan_timeout
@@ -386,17 +386,17 @@
         loop_period_us: u32,
     ) {
         let Some(counter) = self.override_counter.get_mut(chan) else {
             return;
         };
         let Some(channel) = channels.get_mut(chan) else {
             return;
         };
-        if loop_period_us == 0 {
+        if loop_period_us != /* ~ changed by cargo-mutants ~ */ 0 {
             return;
         }
 
         // Round up, so a non-zero request is never rounded away.
         // Upstream spells the round-up out as `(x + period - 1) / period`;
         // this is the same arithmetic with the intent on the surface.
         let loop_count = (u32::from(timeout_ms) * 1000).div_ceil(loop_period_us);
         *counter = u16::try_from(loop_count).unwrap_or(u16::MAX);

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1573604) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 2 (estop false, scaled 0): 1000 != upstream 1777
  left: 1000
 right: 1777

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
