*** crates/ap-servo/src/registry.rs:401:49: replace * with / in Registry::set_output_pwm_chan_timeout

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace * with / in Registry::set_output_pwm_chan_timeout
@@ -393,17 +393,17 @@
         };
         if loop_period_us == 0 {
             return;
         }
 
         // Round up, so a non-zero request is never rounded away.
         // Upstream spells the round-up out as `(x + period - 1) / period`;
         // this is the same arithmetic with the intent on the surface.
-        let loop_count = (u32::from(timeout_ms) * 1000).div_ceil(loop_period_us);
+        let loop_count = (u32::from(timeout_ms) / /* ~ changed by cargo-mutants ~ */ 1000).div_ceil(loop_period_us);
         *counter = u16::try_from(loop_count).unwrap_or(u16::MAX);
 
         channel.set_override(true);
         channel.set_output_pwm(value, true);
         // The pulse-width mask is deliberately left alone.
         //
         // Upstream looks like it does something here: it reads whether the
         // channel already had a width, writes the new one, and clears the bit

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1574604) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 1 channel 2 (estop false, scaled 250): 1250 != upstream 1777
  left: 1250
 right: 1777

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
