*** crates/ap-servo/src/registry.rs:450:9: replace Registry::override_counter -> u16 with 0

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::override_counter -> u16 with 0
@@ -442,17 +442,17 @@
                 *counter -= 1;
             }
         }
     }
 
     /// Loops of override left on a channel, for callers that want to know.
     #[must_use]
     pub fn override_counter(&self, chan: usize) -> u16 {
-        self.override_counter.get(chan).copied().unwrap_or(0)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// How many slew entries are in use, so a caller can tell it has not
     /// silently exhausted the table.
     #[must_use]
     pub fn slew_entries(&self) -> usize {
         self.slew.iter().flatten().count()
     }

---- a_long_timeout_on_a_fast_loop_saturates stdout ----

thread 'a_long_timeout_on_a_fast_loop_saturates' (1579414) panicked at crates/ap-servo/tests/slew_parity.rs:530:5:
assertion `left == right` failed: the count must saturate; wrapping would turn the longest override into one of a few hundred loops
  left: 0
 right: 65535

---- a_sub_loop_timeout_still_gets_one_loop stdout ----

thread 'a_sub_loop_timeout_still_gets_one_loop' (1579417) panicked at crates/ap-servo/tests/slew_parity.rs:447:9:
assertion `left == right` failed: 1 ms on a 2500 us loop should be 1 loops
  left: 0
 right: 1

---- the_override_timeout_matches_upstream stdout ----

thread 'the_override_timeout_matches_upstream' (1579427) panicked at crates/ap-servo/tests/slew_parity.rs:416:5:
the override must both hold and lapse (0 held, 60 tracked)

failures:
    a_long_timeout_on_a_fast_loop_saturates
    a_sub_loop_timeout_still_gets_one_loop
    the_override_timeout_matches_upstream

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
