*** crates/ap-servo/src/registry.rs:457:9: replace Registry::slew_entries -> usize with 0

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::slew_entries -> usize with 0
@@ -449,17 +449,17 @@
     pub fn override_counter(&self, chan: usize) -> u16 {
         self.override_counter.get(chan).copied().unwrap_or(0)
     }
 
     /// How many slew entries are in use, so a caller can tell it has not
     /// silently exhausted the table.
     #[must_use]
     pub fn slew_entries(&self) -> usize {
-        self.slew.iter().flatten().count()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Channels last written as a pulse width, upstream `have_pwm_mask`.
     #[must_use]
     pub fn have_pwm_mask(&self) -> ChannelMask {
         self.have_pwm_mask
     }

---- a_full_slew_table_leaves_the_function_unlimited stdout ----

thread 'a_full_slew_table_leaves_the_function_unlimited' (1580339) panicked at crates/ap-servo/tests/slew_parity.rs:220:5:
assertion `left == right` failed
  left: 0
 right: 16

failures:
    a_full_slew_table_leaves_the_function_unlimited

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
