*** crates/ap-servo/src/registry.rs:463:9: replace Registry::have_pwm_mask -> ChannelMask with Default::default()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::have_pwm_mask -> ChannelMask with Default::default()
@@ -455,17 +455,17 @@
     #[must_use]
     pub fn slew_entries(&self) -> usize {
         self.slew.iter().flatten().count()
     }
 
     /// Channels last written as a pulse width, upstream `have_pwm_mask`.
     #[must_use]
     pub fn have_pwm_mask(&self) -> ChannelMask {
-        self.have_pwm_mask
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Mark channels as carrying a pulse width, upstream's writes to
     /// `have_pwm_mask` from `set_output_pwm`.
     pub fn set_have_pwm(&mut self, channel_mask: ChannelMask) {
         self.have_pwm_mask |= channel_mask;
     }

---- the_had_pwm_branch_decides_what_happens_after_the_override stdout ----

thread 'the_had_pwm_branch_decides_what_happens_after_the_override' (1582171) panicked at crates/ap-servo/tests/slew_parity.rs:498:5:
assertion `left != right` failed: a direct width write should set the bit; this test is vacuous without it
  left: 0
 right: 0

failures:
    the_had_pwm_branch_decides_what_happens_after_the_override

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
