*** crates/ap-servo/src/registry.rs:503:21: replace != with == in Registry::set_aux_channel_default

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace != with == in Registry::set_aux_channel_default
@@ -495,17 +495,17 @@
         if self.output_channel_mask(function) != 0 {
             return true;
         }
 
         let Some(current) = channel_functions.get_mut(usize::from(channel)) else {
             return false;
         };
 
-        if *current != Function::NONE {
+        if *current == /* ~ changed by cargo-mutants ~ */ Function::NONE {
             return *current == function;
         }
 
         *current = function;
         if function.valid() && channel < 32 {
             if let Some(entry) = self.functions.get_mut(usize::from(function.0)) {
                 entry.channel_mask |= 1_u32 << channel;
             }

*** result: Success
