*** crates/ap-servo/src/registry.rs:510:36: replace |= with &= in Registry::set_aux_channel_default

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace |= with &= in Registry::set_aux_channel_default
@@ -502,17 +502,17 @@
 
         if *current != Function::NONE {
             return *current == function;
         }
 
         *current = function;
         if function.valid() && channel < 32 {
             if let Some(entry) = self.functions.get_mut(usize::from(function.0)) {
-                entry.channel_mask |= 1_u32 << channel;
+                entry.channel_mask &= /* ~ changed by cargo-mutants ~ */ 1_u32 << channel;
             }
         }
         true
     }
 
     /// Write a pulse to every channel a function drives, upstream
     /// `SRV_Channels::set_output_pwm`.
     ///

*** result: Success
