*** crates/ap-servo/src/registry.rs:536:28: replace != with == in Registry::set_output_pwm

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace != with == in Registry::set_output_pwm
@@ -528,17 +528,17 @@
         channels: &mut [OutputChannel],
         function: Function,
         value: u16,
     ) {
         if self.output_channel_mask(function) == 0 {
             return;
         }
         for ch in channels.iter_mut() {
-            if ch.function != function {
+            if ch.function == /* ~ changed by cargo-mutants ~ */ function {
                 continue;
             }
             if ch.set_output_pwm(value, false) && ch.ch_num < 32 {
                 self.have_pwm_mask |= 1_u32 << ch.ch_num;
             }
         }
     }

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1593926) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 0 (estop false, scaled 0): 1234 != upstream 1000
  left: 1234
 right: 1000

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
