*** crates/ap-servo/src/registry.rs:564:16: delete ! in Registry::calc_pwm

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::calc_pwm
@@ -556,17 +556,17 @@
         self.apply_slew_limits();
         self.step_override_counters(channels);
 
         let ctx = OutputContext {
             have_pwm_mask: self.have_pwm_mask,
             emergency_stop,
         };
         for ch in channels.iter_mut() {
-            if !ch.function.valid() {
+            if  /* ~ changed by cargo-mutants ~ */ch.function.valid() {
                 continue;
             }
             ch.calc_pwm(self.output_scaled(ch.function), &ctx);
         }
     }
 
     /// Whether any channel carries this function, upstream
     /// `function_assigned`.

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1600407) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 0 (estop false, scaled 0): 0 != upstream 1000
  left: 0
 right: 1000

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
