*** crates/ap-servo/src/registry.rs:575:26: replace && with || in Registry::function_assigned

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace && with || in Registry::function_assigned
@@ -567,17 +567,17 @@
             ch.calc_pwm(self.output_scaled(ch.function), &ctx);
         }
     }
 
     /// Whether any channel carries this function, upstream
     /// `function_assigned`.
     #[must_use]
     pub fn function_assigned(&self, function: Function) -> bool {
-        function.valid() && self.output_channel_mask(function) != 0
+        function.valid() || /* ~ changed by cargo-mutants ~ */ self.output_channel_mask(function) != 0
     }
 
     /// The first channel carrying a function, upstream `find_channel`.
     ///
     /// First, not only — a function may drive several channels, and the
     /// callers that use this are asking a question with one answer (what is
     /// this surface doing) rather than commanding all of them.
     #[must_use]

*** result: Success
