*** crates/ap-servo/src/registry.rs:585:12: delete ! in Registry::find_channel

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::find_channel
@@ -577,17 +577,17 @@
 
     /// The first channel carrying a function, upstream `find_channel`.
     ///
     /// First, not only — a function may drive several channels, and the
     /// callers that use this are asking a question with one answer (what is
     /// this surface doing) rather than commanding all of them.
     #[must_use]
     pub fn find_channel(&self, function: Function) -> Option<usize> {
-        if !function.valid() {
+        if  /* ~ changed by cargo-mutants ~ */function.valid() {
             return None;
         }
         let mask = self.output_channel_mask(function);
         if mask == 0 {
             None
         } else {
             Some(mask.trailing_zeros() as usize)
         }

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1606042) panicked at crates/ap-servo/tests/slew_parity.rs:846:5:
the aggregate must answer from channel 3, the first carrying the function; channel 9 is reversed and would read 0 negated

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1606043) panicked at crates/ap-servo/tests/slew_parity.rs:738:14:
assigned function

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
