*** crates/ap-servo/src/registry.rs:585:9: replace Registry::find_channel -> Option<usize> with Some(0)

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::find_channel -> Option<usize> with Some(0)
@@ -577,25 +577,17 @@
 
     /// The first channel carrying a function, upstream `find_channel`.
     ///
     /// First, not only — a function may drive several channels, and the
     /// callers that use this are asking a question with one answer (what is
     /// this surface doing) rather than commanding all of them.
     #[must_use]
     pub fn find_channel(&self, function: Function) -> Option<usize> {
-        if !function.valid() {
-            return None;
-        }
-        let mask = self.output_channel_mask(function);
-        if mask == 0 {
-            None
-        } else {
-            Some(mask.trailing_zeros() as usize)
-        }
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Drive every channel with this function to a named endpoint, upstream
     /// `set_output_limit`.
     ///
     /// Endpoints are resolved per channel, so a reversed channel and an
     /// upright one given the same limit travel in opposite directions — which
     /// is the point: `Min` means the minimum of the *surface's* travel, not

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1605156) panicked at crates/ap-servo/tests/slew_parity.rs:851:5:
assertion `left == right` failed: find_channel must return the lowest channel, not the highest
  left: Some(0)
 right: Some(3)

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1605157) panicked at crates/ap-servo/tests/slew_parity.rs:741:9:
assertion `left == right` failed: row 41 pwm
  left: 1100
 right: 2000

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
