*** crates/ap-servo/src/registry.rs:609:9: replace Registry::set_output_limit with ()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::set_output_limit with ()
@@ -601,25 +601,17 @@
     /// is the point: `Min` means the minimum of the *surface's* travel, not
     /// the smaller pulse width.
     pub fn set_output_limit(
         &mut self,
         channels: &mut [OutputChannel],
         function: Function,
         limit: Limit,
     ) {
-        if !self.function_assigned(function) {
-            return;
-        }
-        for ch in channels.iter_mut() {
-            if ch.function == function {
-                let pwm = ch.config.limit_pwm(limit);
-                ch.set_output_pwm(pwm, false);
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Drive every channel with this function to its trim, upstream
     /// `set_output_to_trim`.
     ///
     /// Note this does not go through `function_assigned` upstream, unlike its
     /// neighbours. The difference is almost never observable: an unassigned
     /// function matches no channel, so the loop does nothing either way.

---- the_function_setters_match_upstream stdout ----

thread 'the_function_setters_match_upstream' (1607650) panicked at crates/ap-servo/tests/slew_parity.rs:652:17:
assertion `left == right` failed: case 0 channel 6 out_pwm
  left: 0
 right: 1500

failures:
    the_function_setters_match_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
