*** crates/ap-servo/src/registry.rs:645:9: replace Registry::set_trim_to_pwm_for with ()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::set_trim_to_pwm_for with ()
@@ -637,21 +637,17 @@
                 ch.set_output_pwm(trim, false);
             }
         }
     }
 
     /// Move the trim of every channel with this function, upstream
     /// `set_trim_to_pwm_for`.
     pub fn set_trim_to_pwm_for(channels: &mut [OutputChannel], function: Function, pwm: u16) {
-        for ch in channels.iter_mut() {
-            if ch.function == function {
-                ch.config.servo_trim = pwm;
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Trim every channel with this function to its minimum, upstream
     /// `set_trim_to_min_for`.
     ///
     /// `ignore_reversed` decides which minimum. Honouring the reversal picks
     /// the endpoint the *surface* treats as minimum, which for a reversed
     /// channel is the larger pulse width; ignoring it picks the smaller width

---- the_function_setters_match_upstream stdout ----

thread 'the_function_setters_match_upstream' (1611984) panicked at crates/ap-servo/tests/slew_parity.rs:652:17:
assertion `left == right` failed: case 5 channel 6 servo_trim
  left: 1500
 right: 1234

failures:
    the_function_setters_match_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
