*** crates/ap-servo/src/registry.rs:646:28: replace == with != in Registry::set_trim_to_pwm_for

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace == with != in Registry::set_trim_to_pwm_for
@@ -638,17 +638,17 @@
             }
         }
     }
 
     /// Move the trim of every channel with this function, upstream
     /// `set_trim_to_pwm_for`.
     pub fn set_trim_to_pwm_for(channels: &mut [OutputChannel], function: Function, pwm: u16) {
         for ch in channels.iter_mut() {
-            if ch.function == function {
+            if ch.function != /* ~ changed by cargo-mutants ~ */ function {
                 ch.config.servo_trim = pwm;
             }
         }
     }
 
     /// Trim every channel with this function to its minimum, upstream
     /// `set_trim_to_min_for`.
     ///

---- the_function_setters_match_upstream stdout ----

thread 'the_function_setters_match_upstream' (1612231) panicked at crates/ap-servo/tests/slew_parity.rs:652:17:
assertion `left == right` failed: case 5 channel 6 servo_trim
  left: 1500
 right: 1234

failures:
    the_function_setters_match_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
