*** crates/ap-servo/src/registry.rs:665:9: replace Registry::set_trim_to_min_for with ()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::set_trim_to_min_for with ()
@@ -657,25 +657,17 @@
     /// channel is the larger pulse width; ignoring it picks the smaller width
     /// regardless. Callers setting a mechanical rest position want the former;
     /// callers driving a specific pulse want the latter.
     pub fn set_trim_to_min_for(
         channels: &mut [OutputChannel],
         function: Function,
         ignore_reversed: bool,
     ) {
-        for ch in channels.iter_mut() {
-            if ch.function == function {
-                ch.config.servo_trim = if ch.config.reversed && !ignore_reversed {
-                    ch.config.servo_max
-                } else {
-                    ch.config.servo_min
-                };
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// The normalised output of the first channel with this function, upstream
     /// `get_output_norm`.
     ///
     /// Recomputes the channel's pulse width before reading it, so the answer
     /// reflects the scaled value written this cycle rather than the width left
     /// by the last `calc_pwm`. That means this is not a pure read — it writes

---- the_function_setters_match_upstream stdout ----

thread 'the_function_setters_match_upstream' (1613222) panicked at crates/ap-servo/tests/slew_parity.rs:652:17:
assertion `left == right` failed: case 6 channel 6 servo_trim
  left: 1234
 right: 1100

failures:
    the_function_setters_match_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
