*** crates/ap-servo/src/registry.rs:667:65: delete ! in Registry::set_trim_to_min_for

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::set_trim_to_min_for
@@ -659,17 +659,17 @@
     /// callers driving a specific pulse want the latter.
     pub fn set_trim_to_min_for(
         channels: &mut [OutputChannel],
         function: Function,
         ignore_reversed: bool,
     ) {
         for ch in channels.iter_mut() {
             if ch.function == function {
-                ch.config.servo_trim = if ch.config.reversed && !ignore_reversed {
+                ch.config.servo_trim = if ch.config.reversed &&  /* ~ changed by cargo-mutants ~ */ignore_reversed {
                     ch.config.servo_max
                 } else {
                     ch.config.servo_min
                 };
             }
         }
     }

---- the_function_setters_match_upstream stdout ----

thread 'the_function_setters_match_upstream' (1615183) panicked at crates/ap-servo/tests/slew_parity.rs:652:17:
assertion `left == right` failed: case 6 channel 7 servo_trim
  left: 1000
 right: 2000

failures:
    the_function_setters_match_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
