*** crates/ap-servo/src/registry.rs:689:9: replace Registry::output_norm -> f32 with 0.0

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::output_norm -> f32 with 0.0
@@ -681,31 +681,17 @@
     /// by the last `calc_pwm`. That means this is not a pure read — it writes
     /// the channel — which is worth knowing before calling it in a log path.
     pub fn output_norm(
         &self,
         channels: &mut [OutputChannel],
         function: Function,
         emergency_stop: bool,
     ) -> f32 {
-        let Some(chan) = self.find_channel(function) else {
-            return 0.0;
-        };
-        let Some(ch) = channels.get_mut(chan) else {
-            return 0.0;
-        };
-        if function.valid() {
-            let ctx = OutputContext {
-                have_pwm_mask: self.have_pwm_mask,
-                emergency_stop,
-            };
-            let scaled = self.output_scaled(function);
-            ch.calc_pwm(scaled, &ctx);
-        }
-        ch.output_norm()
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// The pulse width of the first channel with this function, upstream
     /// `get_output_pwm`.
     ///
     /// Recomputes first, for the same reason and with the same caveat as
     /// [`Self::output_norm`].
     pub fn output_pwm_for(

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1616301) panicked at crates/ap-servo/tests/slew_parity.rs:846:5:
the aggregate must answer from channel 3, the first carrying the function; channel 9 is reversed and would read 0 negated

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1616304) panicked at crates/ap-servo/tests/slew_parity.rs:746:9:
row 0 norm: 0 != upstream -1 (diff 1)

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
