*** crates/ap-servo/src/registry.rs:772:38: replace > with >= in Registry::adjust_trim

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace > with >= in Registry::adjust_trim
@@ -764,17 +764,17 @@
             }
             let change = if ch.config.reversed { -v } else { v };
             let min = ch.config.servo_min;
             let max = ch.config.servo_max;
             if max <= min {
                 continue;
             }
             let trim_scaled = f32::from(ch.config.servo_trim - min) / f32::from(max - min);
-            let new_trim = if change > 0.0 && trim_scaled < 0.6 {
+            let new_trim = if change >= /* ~ changed by cargo-mutants ~ */ 0.0 && trim_scaled < 0.6 {
                 ch.config.servo_trim + 1
             } else if change < 0.0 && trim_scaled > 0.4 {
                 ch.config.servo_trim - 1
             } else {
                 continue;
             };
             ch.config.servo_trim = new_trim;
             self.trimmed_mask |= 1u32 << i;

*** result: Success
