*** crates/ap-servo/src/registry.rs:780:39: replace << with >> in Registry::adjust_trim

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace << with >> in Registry::adjust_trim
@@ -772,17 +772,17 @@
             let new_trim = if change > 0.0 && trim_scaled < 0.6 {
                 ch.config.servo_trim + 1
             } else if change < 0.0 && trim_scaled > 0.4 {
                 ch.config.servo_trim - 1
             } else {
                 continue;
             };
             ch.config.servo_trim = new_trim;
-            self.trimmed_mask |= 1u32 << i;
+            self.trimmed_mask |= 1u32 >> /* ~ changed by cargo-mutants ~ */ i;
         }
     }
 
     /// Which channels have had their trim nudged, upstream `trimmed_mask`.
     #[must_use]
     pub fn trimmed_mask(&self) -> ChannelMask {
         self.trimmed_mask
     }

---- the_trim_adjustment_matches_upstream stdout ----

thread 'the_trim_adjustment_matches_upstream' (1644922) panicked at crates/ap-servo/tests/slew_parity.rs:939:5:
assertion `left == right` failed: both nudged channels should be in the trimmed mask, got 0x0
  left: 0
 right: 6144

failures:
    the_trim_adjustment_matches_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
