*** crates/ap-servo/src/registry.rs:787:9: replace Registry::trimmed_mask -> ChannelMask with Default::default()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::trimmed_mask -> ChannelMask with Default::default()
@@ -779,17 +779,17 @@
             ch.config.servo_trim = new_trim;
             self.trimmed_mask |= 1u32 << i;
         }
     }
 
     /// Which channels have had their trim nudged, upstream `trimmed_mask`.
     #[must_use]
     pub fn trimmed_mask(&self) -> ChannelMask {
-        self.trimmed_mask
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Take the set of nudged channels and clear it, upstream `save_trim`.
     ///
     /// Upstream writes each one to storage here. Storage is not this type's
     /// business, so the set is handed back and cleared — the caller saves.
     /// Clearing regardless is upstream's behaviour: a save that fails is not
     /// retried, and the alternative would be an unbounded set of pending

---- the_trim_adjustment_matches_upstream stdout ----

thread 'the_trim_adjustment_matches_upstream' (1644800) panicked at crates/ap-servo/tests/slew_parity.rs:939:5:
assertion `left == right` failed: both nudged channels should be in the trimmed mask, got 0x0
  left: 0
 right: 6144

failures:
    the_trim_adjustment_matches_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
