*** crates/ap-servo/src/registry.rs:807:12: delete ! in Registry::set_trim_to_servo_out_for

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::set_trim_to_servo_out_for
@@ -799,17 +799,17 @@
     }
 
     /// Set every matching channel's trim to its current output, upstream
     /// `set_trim_to_servo_out_for`.
     ///
     /// The "trim to where it is now" operation, for a pilot who has flown the
     /// surface to where they want it to rest.
     pub fn set_trim_to_servo_out_for(&self, channels: &mut [OutputChannel], function: Function) {
-        if !self.function_assigned(function) {
+        if  /* ~ changed by cargo-mutants ~ */self.function_assigned(function) {
             return;
         }
         for ch in channels.iter_mut() {
             if ch.function == function {
                 ch.config.servo_trim = ch.output_pwm();
             }
         }
     }

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1647644) panicked at crates/ap-servo/tests/slew_parity.rs:1095:9:
assertion `left == right` failed
  left: 1500
 right: 1750

failures:
    the_remaining_function_operations_do_something

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
