*** crates/ap-servo/src/registry.rs:820:12: delete ! in Registry::set_output_norm

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::set_output_norm
@@ -812,17 +812,17 @@
                 ch.config.servo_trim = ch.output_pwm();
             }
         }
     }
 
     /// Drive every matching channel to a normalised value, upstream
     /// `set_output_norm`.
     pub fn set_output_norm(&self, channels: &mut [OutputChannel], function: Function, value: f32) {
-        if !self.function_assigned(function) {
+        if  /* ~ changed by cargo-mutants ~ */self.function_assigned(function) {
             return;
         }
         for ch in channels.iter_mut() {
             if ch.function == function {
                 ch.set_output_norm(value);
             }
         }
     }

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1649744) panicked at crates/ap-servo/tests/slew_parity.rs:1113:9:
assertion `left != right` failed: set_output_norm must write a width
  left: 0
 right: 0

failures:
    the_remaining_function_operations_do_something

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
