*** crates/ap-servo/src/registry.rs:846:12: delete ! in Registry::for_each_failsafe_target

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::for_each_failsafe_target
@@ -838,17 +838,17 @@
         channels: &[OutputChannel],
         function: Function,
         limit: Option<Limit>,
         pwm: u16,
         mut visit: F,
     ) where
         F: FnMut(u8, u16),
     {
-        if !self.function_assigned(function) {
+        if  /* ~ changed by cargo-mutants ~ */self.function_assigned(function) {
             return;
         }
         for ch in channels {
             if ch.function == function {
                 let value = match limit {
                     Some(l) => ch.config.limit_pwm(l),
                     None => pwm,
                 };

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1652683) panicked at crates/ap-servo/tests/slew_parity.rs:1137:9:
assertion `left == right` failed: explicit width, both channels
  left: []
 right: [(2, 1666), (5, 1666)]

failures:
    the_remaining_function_operations_do_something

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
