*** crates/ap-servo/src/registry.rs:872:16: delete ! in Registry::for_each_non_motor_trim

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::for_each_non_motor_trim
@@ -864,17 +864,17 @@
     /// command whatever trim happens to mean for a motor — on a multirotor,
     /// mid-throttle. Leaving them out means their failsafe stays wherever it
     /// was set deliberately.
     pub fn for_each_non_motor_trim<F>(channels: &[OutputChannel], mut visit: F)
     where
         F: FnMut(u8, u16),
     {
         for ch in channels {
-            if !ch.function.is_motor() {
+            if  /* ~ changed by cargo-mutants ~ */ch.function.is_motor() {
                 visit(ch.ch_num, ch.config.servo_trim);
             }
         }
     }
 
     /// Whether every channel in `mask` is digital, upstream
     /// `have_digital_outputs(mask)`.
     ///

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1654141) panicked at crates/ap-servo/tests/slew_parity.rs:1172:9:
motors are excluded

failures:
    the_remaining_function_operations_do_something

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
