*** crates/ap-servo/src/registry.rs:886:28: replace & with | in Registry::have_digital_outputs

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace & with | in Registry::have_digital_outputs
@@ -878,11 +878,11 @@
     /// Whether every channel in `mask` is digital, upstream
     /// `have_digital_outputs(mask)`.
     ///
     /// An empty mask is false, not vacuously true. Upstream tests `mask != 0`
     /// first, and it matters: "all of no channels are digital" would otherwise
     /// send a vehicle with no motors assigned down the digital path.
     #[must_use]
     pub fn have_digital_outputs(mask: ChannelMask, digital_mask: ChannelMask) -> bool {
-        mask != 0 && (mask & digital_mask) == mask
+        mask != 0 && (mask | /* ~ changed by cargo-mutants ~ */ digital_mask) == mask
     }
 }

---- the_digital_output_test_matches_upstream stdout ----

thread 'the_digital_output_test_matches_upstream' (1658872) panicked at crates/ap-servo/tests/srv_functions.rs:116:9:
assertion `left == right` failed: step 0 mask 0x1 against digital 0xf
  left: false
 right: true

failures:
    the_digital_output_test_matches_upstream

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
