*** crates/ap-math/src/control.rs:120:5: replace shape_accel -> Result<(), ShapeError> with Ok(())

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace shape_accel -> Result<(), ShapeError> with Ok(())
@@ -112,24 +112,17 @@
 /// raises an internal error and returns, leaving `accel` untouched; so does
 /// this, and says so.
 pub fn shape_accel(
     accel_desired: f32,
     accel: &mut f32,
     jerk_max: f32,
     dt: f32,
 ) -> Result<(), ShapeError> {
-    if !is_positive(jerk_max) {
-        return Err(ShapeError::JerkNotPositive);
-    }
-    if is_positive(dt) {
-        let accel_delta = constrain_value(accel_desired - *accel, -jerk_max * dt, jerk_max * dt);
-        *accel += accel_delta;
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Shape an acceleration to track a velocity demand, upstream
 /// `shape_vel_accel`.
 ///
 /// The correction gain is derived from the limits rather than tuned:
 /// `jerk_max / accel_max` is the reciprocal of the time the acceleration takes
 /// to reach its limit, which is the fastest the velocity loop can usefully

---- control::tests::a_bad_jerk_limit_is_refused_and_changes_nothing stdout ----

thread 'control::tests::a_bad_jerk_limit_is_refused_and_changes_nothing' (395408) panicked at crates/ap-math/src/control.rs:887:9:
assertion `left == right` failed
  left: Ok(())
 right: Err(JerkNotPositive)

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (395412) panicked at crates/ap-math/src/control.rs:946:9:
settled at 0, wanted 100

---- control::tests::an_angle_demand_turns_the_short_way stdout ----

thread 'control::tests::an_angle_demand_turns_the_short_way' (395415) panicked at crates/ap-math/src/control.rs:989:9:
the short way from 3.0 to -3.0 is forwards, got 0

failures:
    control::tests::a_bad_jerk_limit_is_refused_and_changes_nothing
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::a_velocity_demand_is_tracked_within_the_limits
    control::tests::acceleration_approaches_its_target_at_the_jerk_limit
    control::tests::an_angle_demand_turns_the_short_way

test result: FAILED. 141 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
