*** crates/ap-math/src/control.rs:124:77: replace * with / in shape_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in shape_accel
@@ -116,17 +116,17 @@
     accel: &mut f32,
     jerk_max: f32,
     dt: f32,
 ) -> Result<(), ShapeError> {
     if !is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }
     if is_positive(dt) {
-        let accel_delta = constrain_value(accel_desired - *accel, -jerk_max * dt, jerk_max * dt);
+        let accel_delta = constrain_value(accel_desired - *accel, -jerk_max / /* ~ changed by cargo-mutants ~ */ dt, jerk_max * dt);
         *accel += accel_delta;
     }
     Ok(())
 }
 
 /// Shape an acceleration to track a velocity demand, upstream
 /// `shape_vel_accel`.
 ///

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (406082) panicked at crates/ap-math/tests/control_parity.rs:225:17:
shape_accel in row `shape_accel,3240099840,3231711232,0,0,0,0,3231920947,0`: -10 against upstream -5.1

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
