*** crates/ap-math/src/control.rs:155:32: replace || with && in shape_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace || with && in shape_vel_accel
@@ -147,17 +147,17 @@
     vel: f32,
     accel: &mut f32,
     accel_min: f32,
     accel_max: f32,
     jerk_max: f32,
     dt: f32,
     limit_total_accel: bool,
 ) -> Result<(), ShapeError> {
-    if !is_negative(accel_min) || !is_positive(accel_max) {
+    if !is_negative(accel_min) && /* ~ changed by cargo-mutants ~ */ !is_positive(accel_max) {
         return Err(ShapeError::AccelLimitsMalformed);
     }
     if !is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }
 
     let vel_error = vel_desired - vel;

---- control::tests::malformed_limits_are_refused stdout ----

thread 'control::tests::malformed_limits_are_refused' (417016) panicked at crates/ap-math/src/control.rs:905:9:
assertion `left == right` failed: accel_min must be negative
  left: Ok(())
 right: Err(AccelLimitsMalformed)

failures:
    control::tests::malformed_limits_are_refused

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
