*** crates/ap-math/src/control.rs:165:18: replace / with % in shape_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with % in shape_vel_accel
@@ -157,17 +157,17 @@
     }
     if !is_positive(jerk_max) {
         return Err(ShapeError::JerkNotPositive);
     }
 
     let vel_error = vel_desired - vel;
 
     let kpa = if is_positive(vel_error) {
-        jerk_max / accel_max
+        jerk_max % /* ~ changed by cargo-mutants ~ */ accel_max
     } else {
         jerk_max / -accel_min
     };
 
     let mut accel_target = sqrt_controller(vel_error, kpa, jerk_max, dt);
     accel_target = constrain_value(accel_target, accel_min, accel_max);
     accel_target += accel_desired;

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (427721) panicked at crates/ap-math/tests/control_parity.rs:225:17:
loop vel in row `loop_vel,82,0,0,0,0,0,1073972505,1077936128`: 2.0547488 against upstream 2.0549986

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
