*** crates/ap-math/src/control.rs:167:18: replace / with * in shape_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in shape_vel_accel
@@ -159,17 +159,17 @@
         return Err(ShapeError::JerkNotPositive);
     }
 
     let vel_error = vel_desired - vel;
 
     let kpa = if is_positive(vel_error) {
         jerk_max / accel_max
     } else {
-        jerk_max / -accel_min
+        jerk_max * /* ~ changed by cargo-mutants ~ */ -accel_min
     };
 
     let mut accel_target = sqrt_controller(vel_error, kpa, jerk_max, dt);
     accel_target = constrain_value(accel_target, accel_min, accel_max);
     accel_target += accel_desired;
 
     if limit_total_accel {
         accel_target = constrain_value(accel_target, accel_min, accel_max);

*** result: Success
