*** crates/ap-math/src/control.rs:251:38: replace + with - in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace + with - in shape_pos_vel_accel
@@ -243,17 +243,17 @@
 
     if is_negative(vel_min) {
         vel_corr_cmd = vel_corr_cmd.max(vel_min);
     }
     if is_positive(vel_max) {
         vel_corr_cmd = vel_corr_cmd.min(vel_max);
     }
 
-    let mut vel_target = vel_desired + vel_corr_cmd;
+    let mut vel_target = vel_desired - /* ~ changed by cargo-mutants ~ */ vel_corr_cmd;
 
     if limit_total {
         if is_negative(vel_min) {
             vel_target = vel_target.max(vel_min);
         }
         if is_positive(vel_max) {
             vel_target = vel_target.min(vel_max);
         }

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (474152) panicked at crates/ap-math/src/control.rs:953:9:
settled at -281.76376591710823, wanted 100

---- control::tests::an_angle_demand_turns_the_short_way stdout ----

thread 'control::tests::an_angle_demand_turns_the_short_way' (474155) panicked at crates/ap-math/src/control.rs:996:9:
the short way from 3.0 to -3.0 is forwards, got -0.049999997

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::an_angle_demand_turns_the_short_way

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
