*** crates/ap-math/src/control.rs:264:18: replace += with -= in shape_pos_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace += with -= in shape_pos_vel_accel
@@ -256,17 +256,17 @@
         }
         if is_positive(vel_max) {
             vel_target = vel_target.min(vel_max);
         }
     }
 
     let mut accel_target = (vel_target - vel) * k_v;
     accel_target = constrain_value(accel_target, accel_min, accel_max);
-    accel_target += accel_desired;
+    accel_target -= /* ~ changed by cargo-mutants ~ */ accel_desired;
 
     if limit_total {
         accel_target = constrain_value(accel_target, accel_min, accel_max);
     }
 
     shape_accel(accel_target, accel, jerk_max, dt)
 }

*** result: Success
