*** crates/ap-math/src/control.rs:297:39: replace + with - in shape_angle_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace + with - in shape_angle_vel_accel
@@ -289,17 +289,17 @@
     angle_accel: &mut f32,
     angle_vel_min: f32,
     angle_vel_max: f32,
     angle_accel_max: f32,
     angle_jerk_max: f32,
     dt: f32,
     limit_total: bool,
 ) -> Result<(), ShapeError> {
-    let angle_desired_wrapped = angle + wrap_pi(angle_desired - angle);
+    let angle_desired_wrapped = angle - /* ~ changed by cargo-mutants ~ */ wrap_pi(angle_desired - angle);
     shape_pos_vel_accel(
         Postype::from(angle_desired_wrapped),
         angle_vel_desired,
         angle_accel_desired,
         Postype::from(angle),
         angle_vel,
         angle_accel,
         angle_vel_min,

---- control::tests::an_angle_demand_turns_the_short_way stdout ----

thread 'control::tests::an_angle_demand_turns_the_short_way' (489408) panicked at crates/ap-math/src/control.rs:996:9:
the short way from 3.0 to -3.0 is forwards, got -0.049999997

failures:
    control::tests::an_angle_demand_turns_the_short_way

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
