*** crates/ap-math/src/control.rs:307:9: delete - in shape_angle_vel_accel

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete - in shape_angle_vel_accel
@@ -299,17 +299,17 @@
         Postype::from(angle_desired_wrapped),
         angle_vel_desired,
         angle_accel_desired,
         Postype::from(angle),
         angle_vel,
         angle_accel,
         angle_vel_min,
         angle_vel_max,
-        -angle_accel_max,
+         /* ~ changed by cargo-mutants ~ */angle_accel_max,
         angle_accel_max,
         angle_jerk_max,
         dt,
         limit_total,
     )
 }
 
 /// Proportional near the target, square-root far from it. Upstream

---- control::tests::an_angle_demand_turns_the_short_way stdout ----

thread 'control::tests::an_angle_demand_turns_the_short_way' (495317) panicked at crates/ap-math/src/control.rs:994:10:
valid: AccelLimitsMalformed

failures:
    control::tests::an_angle_demand_turns_the_short_way

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
