*** crates/ap-math/src/control.rs:341:18: replace > with == in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace > with == in sqrt_controller
@@ -333,17 +333,17 @@
             safe_sqrt(2.0 * second_ord_lim * error)
         } else if is_negative(error) {
             -safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
-        if error > linear_dist {
+        if error == /* ~ changed by cargo-mutants ~ */ linear_dist {
             safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
         } else if error < -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (531111) panicked at crates/ap-math/src/control.rs:854:13:
10 became 20 and came back as 21.25

---- control::tests::the_response_is_symmetric stdout ----

thread 'control::tests::the_response_is_symmetric' (531113) panicked at crates/ap-math/src/control.rs:831:13:
at 10: 20 and -13.228757

failures:
    control::tests::the_inverse_round_trips
    control::tests::the_response_is_symmetric

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
