*** crates/ap-math/src/control.rs:342:27: replace * with / in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with / in sqrt_controller
@@ -334,17 +334,17 @@
         } else if is_negative(error) {
             -safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
         if error > linear_dist {
-            safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
+            safe_sqrt(2.0 / /* ~ changed by cargo-mutants ~ */ second_ord_lim * (error - linear_dist / 2.0))
         } else if error < -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };
 
     if is_positive(dt) {

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (539307) panicked at crates/ap-math/src/control.rs:953:9:
settled at 99.2190833524287, wanted 100

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (539340) panicked at crates/ap-math/src/control.rs:854:13:
10 became 1.3228756 and came back as 0.6614378

---- control::tests::the_two_regimes_join_continuously stdout ----

thread 'control::tests::the_two_regimes_join_continuously' (539344) panicked at crates/ap-math/src/control.rs:819:9:
a step at the join: 4.9998 then 0.50001997

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::the_inverse_round_trips
    control::tests::the_response_is_symmetric
    control::tests::the_two_regimes_join_continuously

test result: FAILED. 142 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
