*** crates/ap-math/src/control.rs:342:53: replace - with + in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace - with + in sqrt_controller
@@ -334,17 +334,17 @@
         } else if is_negative(error) {
             -safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
         if error > linear_dist {
-            safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
+            safe_sqrt(2.0 * second_ord_lim * (error + /* ~ changed by cargo-mutants ~ */ linear_dist / 2.0))
         } else if error < -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };
 
     if is_positive(dt) {

---- control::tests::the_two_regimes_join_continuously stdout ----

thread 'control::tests::the_two_regimes_join_continuously' (542751) panicked at crates/ap-math/src/control.rs:819:9:
a step at the join: 4.9998 then 8.66037

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (542745) panicked at crates/ap-math/src/control.rs:854:13:
10 became 15 and came back as 12.5

---- control::tests::the_response_is_symmetric stdout ----

thread 'control::tests::the_response_is_symmetric' (542750) panicked at crates/ap-math/src/control.rs:831:13:
at 10: 15 and -13.228757

failures:
    control::tests::the_inverse_round_trips
    control::tests::the_response_is_symmetric
    control::tests::the_two_regimes_join_continuously

test result: FAILED. 143 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
