*** crates/ap-math/src/control.rs:343:25: replace < with == in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace < with == in sqrt_controller
@@ -335,17 +335,17 @@
             -safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
         if error > linear_dist {
             safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
-        } else if error < -linear_dist {
+        } else if error == /* ~ changed by cargo-mutants ~ */ -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };
 
     if is_positive(dt) {
         constrain_value(correction_rate, -error.abs() / dt, error.abs() / dt)

---- control::tests::the_response_is_symmetric stdout ----

thread 'control::tests::the_response_is_symmetric' (546392) panicked at crates/ap-math/src/control.rs:831:13:
at 10: 13.228757 and -20

failures:
    control::tests::the_response_is_symmetric

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
