*** crates/ap-math/src/control.rs:343:25: replace < with <= in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace < with <= in sqrt_controller
@@ -335,17 +335,17 @@
             -safe_sqrt(2.0 * second_ord_lim * -error)
         } else {
             0.0
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
         if error > linear_dist {
             safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
-        } else if error < -linear_dist {
+        } else if error <= /* ~ changed by cargo-mutants ~ */ -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
             error * p
         }
     };
 
     if is_positive(dt) {
         constrain_value(correction_rate, -error.abs() / dt, error.abs() / dt)

*** result: Success
