*** crates/ap-math/src/control.rs:346:19: replace * with + in sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace * with + in sqrt_controller
@@ -338,17 +338,17 @@
         }
     } else {
         let linear_dist = second_ord_lim / sq(p);
         if error > linear_dist {
             safe_sqrt(2.0 * second_ord_lim * (error - linear_dist / 2.0))
         } else if error < -linear_dist {
             -safe_sqrt(2.0 * second_ord_lim * (-error - linear_dist / 2.0))
         } else {
-            error * p
+            error + /* ~ changed by cargo-mutants ~ */ p
         }
     };
 
     if is_positive(dt) {
         constrain_value(correction_rate, -error.abs() / dt, error.abs() / dt)
     } else {
         correction_rate
     }

---- control::tests::a_position_demand_is_tracked_and_settles stdout ----

thread 'control::tests::a_position_demand_is_tracked_and_settles' (573131) panicked at crates/ap-math/src/control.rs:954:9:
should have stopped, still moving at 1.3845289

---- control::tests::a_velocity_demand_is_tracked_within_the_limits stdout ----

thread 'control::tests::a_velocity_demand_is_tracked_within_the_limits' (573132) panicked at crates/ap-math/src/control.rs:933:9:
should have arrived, got 5.8699

---- control::tests::near_the_target_it_is_a_p_controller stdout ----

thread 'control::tests::near_the_target_it_is_a_p_controller' (573140) panicked at crates/ap-math/src/control.rs:797:9:
assertion `left == right` failed
  left: 3.0
 right: 2.0

failures:
    control::tests::a_position_demand_is_tracked_and_settles
    control::tests::a_velocity_demand_is_tracked_within_the_limits
    control::tests::near_the_target_it_is_a_p_controller
    control::tests::the_inverse_round_trips
    control::tests::the_response_is_symmetric
    control::tests::the_two_regimes_join_continuously

test result: FAILED. 140 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
