*** crates/ap-math/src/control.rs:367:47: replace && with || in inv_sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace && with || in inv_sqrt_controller
@@ -359,17 +359,17 @@
 ///
 /// Used to work out how far ahead of a stop the braking must begin — see
 /// [`stopping_distance`], which is this function under another name.
 #[must_use]
 pub fn inv_sqrt_controller(output: f32, p: f32, d_max: f32) -> f32 {
     if is_positive(d_max) && is_zero(p) {
         return (output * output) / (2.0 * d_max);
     }
-    if (is_negative(d_max) || is_zero(d_max)) && !is_zero(p) {
+    if (is_negative(d_max) || is_zero(d_max)) || /* ~ changed by cargo-mutants ~ */ !is_zero(p) {
         return output / p;
     }
     if (is_negative(d_max) || is_zero(d_max)) && is_zero(p) {
         return 0.0;
     }
 
     let linear_velocity = d_max / p;
     if output.abs() < linear_velocity {

---- control::tests::stopping_distance_grows_with_the_square_of_speed stdout ----

thread 'control::tests::stopping_distance_grows_with_the_square_of_speed' (602342) panicked at crates/ap-math/src/control.rs:868:9:
expected about four times, got 2

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (602347) panicked at crates/ap-math/src/control.rs:854:13:
10 became 13.228757 and came back as 6.6143785

failures:
    control::tests::stopping_distance_grows_with_the_square_of_speed
    control::tests::the_inverse_round_trips

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
