*** crates/ap-math/src/control.rs:376:23: replace / with * in inv_sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in inv_sqrt_controller
@@ -368,17 +368,17 @@
         return output / p;
     }
     if (is_negative(d_max) || is_zero(d_max)) && is_zero(p) {
         return 0.0;
     }
 
     let linear_velocity = d_max / p;
     if output.abs() < linear_velocity {
-        return output / p;
+        return output * /* ~ changed by cargo-mutants ~ */ p;
     }
 
     let linear_dist = d_max / sq(p);
     let stopping_dist = (linear_dist * 0.5) + sq(output) / (2.0 * d_max);
     if is_positive(output) {
         stopping_dist
     } else {
         -stopping_dist

---- control::tests::the_inverse_round_trips stdout ----

thread 'control::tests::the_inverse_round_trips' (624391) panicked at crates/ap-math/src/control.rs:854:13:
0.5 became 1 and came back as 2

failures:
    control::tests::the_inverse_round_trips

test result: FAILED. 145 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
