*** crates/ap-math/src/control.rs:384:9: delete - in inv_sqrt_controller

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ delete - in inv_sqrt_controller
@@ -376,17 +376,17 @@
         return output / p;
     }
 
     let linear_dist = d_max / sq(p);
     let stopping_dist = (linear_dist * 0.5) + sq(output) / (2.0 * d_max);
     if is_positive(output) {
         stopping_dist
     } else {
-        -stopping_dist
+         /* ~ changed by cargo-mutants ~ */stopping_dist
     }
 }
 
 /// The rate of change [`sqrt_controller`] implies, upstream
 /// `sqrt_controller_accel`.
 ///
 /// Differentiating the controller's own response with respect to time, via the
 /// chain rule and the actual closing rate. In the linear region the slope is

---- the_control_shaping_matches_upstream stdout ----

thread 'the_control_shaping_matches_upstream' (645610) panicked at crates/ap-math/tests/control_parity.rs:225:17:
inv_sqrt_controller in row `inv,3248488448,1056964608,1056964608,0,0,0,3284697088,3284697088`: 401 against upstream -401

failures:
    the_control_shaping_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
