*** crates/ap-math/src/control.rs:468:45: replace / with * in kinematic_limit_xyz

*** mutation diff:
--- crates/ap-math/src/control.rs
+++ replace / with * in kinematic_limit_xyz
@@ -460,17 +460,17 @@
     let max_z_pos = max_z_pos.abs();
     let max_z_neg = max_z_neg.abs();
 
     let length = safe_sqrt(sq(segment_length_xy) + sq(segment_length_z));
     if !is_positive(length) {
         return 0.0;
     }
     let segment_length_xy = segment_length_xy / length;
-    let segment_length_z = segment_length_z / length;
+    let segment_length_z = segment_length_z * /* ~ changed by cargo-mutants ~ */ length;
 
     if is_zero(segment_length_xy) {
         // Straight up or straight down: the vertical limit is the answer, and
         // which one depends on the direction.
         return if is_positive(segment_length_z) {
             max_z_pos
         } else {
             max_z_neg

---- control::tests::only_the_direction_matters_not_its_length stdout ----

thread 'control::tests::only_the_direction_matters_not_its_length' (726369) panicked at crates/ap-math/src/control.rs:1082:9:
0.084852815 and 0.0008485281

---- control::tests::the_binding_limit_decides_on_a_diagonal stdout ----

thread 'control::tests::the_binding_limit_decides_on_a_diagonal' (726374) panicked at crates/ap-math/src/control.rs:1050:9:
along a shallow slope, faster than 5: 0.29851118

failures:
    control::tests::only_the_direction_matters_not_its_length
    control::tests::the_binding_limit_decides_on_a_diagonal

test result: FAILED. 144 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
