*** crates/ap-servo/src/function.rs:381:9: replace Function::valid -> bool with true

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace Function::valid -> bool with true
@@ -373,17 +373,17 @@
     ///
     /// Upstream also tests the lower bound against `k_none`. That half is
     /// vacuous here -- `k_none` is zero and the value is unsigned -- so it
     /// is asserted at compile time below instead, which is stronger: if
     /// `k_none` ever stopped being zero this would fail to build rather
     /// than quietly accept every value.
     #[must_use]
     pub const fn valid(self) -> bool {
-        (self.0 as usize) < NR_AUX_SERVO_FUNCTIONS
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The function driving a zero-based motor channel, upstream
     /// `SRV_Channels::get_motor_function`.
     ///
     /// Three ranges, not one. Motors 1-8 are contiguous, then 9-12 sit
     /// elsewhere in the enum, then 13 onward somewhere else again --
     /// because the later motor functions were added long after the first

---- an_undefined_function_answers_with_the_invalid_channels stdout ----

thread 'an_undefined_function_answers_with_the_invalid_channels' (1718240) panicked at crates/ap-servo/tests/srv_functions.rs:168:5:
assertion `left == right` failed: channels 1 and 3 are invalid
  left: 0
 right: 10

---- the_aux_function_mapping_matches_upstream stdout ----

thread 'the_aux_function_mapping_matches_upstream' (1718251) panicked at crates/ap-servo/tests/srv_functions.rs:347:13:
assertion `left == right` failed: case 0 function 250: mask 0x0 != upstream 0xffff0000
  left: 0
 right: 4294901760

failures:
    an_undefined_function_answers_with_the_invalid_channels
    the_aux_function_mapping_matches_upstream

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
