*** crates/ap-servo/src/function.rs:396:33: replace + with - in Function::motor

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace + with - in Function::motor
@@ -388,17 +388,17 @@
     /// elsewhere in the enum, then 13 onward somewhere else again --
     /// because the later motor functions were added long after the first
     /// eight and had to take whatever numbers were free. A port that
     /// assumed `k_motor1 + channel` throughout would quietly drive the
     /// wrong outputs on anything with more than eight motors.
     #[must_use]
     pub const fn motor(channel: u8) -> Self {
         if channel < 8 {
-            Self(Self::MOTOR1.0 + channel)
+            Self(Self::MOTOR1.0 - /* ~ changed by cargo-mutants ~ */ channel)
         } else if channel < 12 {
             Self(Self::MOTOR9.0 + (channel - 8))
         } else {
             Self(Self::MOTOR13.0 + (channel - 12))
         }
     }
 }

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1723558) panicked at crates/ap-servo/tests/classify.rs:28:9:
assertion `left == right` failed: motor 1 maps to function 32 which maps back to None
  left: None
 right: Some(1)

failures:
    every_motor_round_trips_through_its_function

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
