*** crates/ap-servo/src/function.rs:543:9: replace Function::default_output -> Option<DefaultOutput> with None

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace Function::default_output -> Option<DefaultOutput> with None
@@ -535,21 +535,17 @@
     /// whatever the channel already had -- its `default:` does nothing
     /// rather than picking a fallback.
     ///
     /// Upstream applies this only when the channel has not already been
     /// set up, and the caller is responsible for that check; this is the
     /// table, not the guard.
     #[must_use]
     pub fn default_output(self) -> Option<DefaultOutput> {
-        DEFAULT_OUTPUT
-            .binary_search_by_key(&self.0, |&(f, _)| f)
-            .ok()
-            .and_then(|i| DEFAULT_OUTPUT.get(i))
-            .map(|&(_, out)| out)
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Functions that move an aerodynamic surface, upstream
 /// `SRV_Channel::is_control_surface`.
 ///
 /// Sorted, so the lookup can binary search.
 const CONTROL_SURFACE: [u8; 16] = [2, 3, 4, 16, 17, 19, 21, 24, 25, 77, 78, 79, 80, 86, 87, 110];

---- surfaces_are_angles_and_throttles_are_ranges stdout ----

thread 'surfaces_are_angles_and_throttles_are_ranges' (1735187) panicked at crates/ap-servo/tests/default_output.rs:79:9:
function 4 should default to an angle, got None

---- the_lookup_table_is_ordered stdout ----

thread 'the_lookup_table_is_ordered' (1735190) panicked at crates/ap-servo/tests/default_output.rs:120:5:
the table is empty

---- every_actuator_gets_the_unit_angle stdout ----

thread 'every_actuator_gets_the_unit_angle' (1735182) panicked at crates/ap-servo/tests/default_output.rs:56:9:
assertion `left == right` failed: actuator function 184 should be a unit angle
  left: None
 right: Some(Angle(1))

failures:
    every_actuator_gets_the_unit_angle
    surfaces_are_angles_and_throttles_are_ranges
    the_lookup_table_is_ordered

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
