*** crates/ap-servo/src/function.rs:566:13: replace || with && in Function::is_motor

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace || with && in Function::is_motor
@@ -558,17 +558,17 @@
     /// Whether this drives a multicopter motor, upstream `is_motor`.
     ///
     /// The same three ranges as [`Self::motor`], expressed against the
     /// generated constants so they move together if upstream
     /// renumbers.
     #[must_use]
     pub const fn is_motor(self) -> bool {
         (self.0 >= Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0)
-            || (self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0)
+            && /* ~ changed by cargo-mutants ~ */ (self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0)
             || (self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0)
     }
 
     /// Whether this moves an aerodynamic surface, upstream
     /// `is_control_surface`.
     #[must_use]
     pub fn is_control_surface(self) -> bool {
         CONTROL_SURFACE.binary_search(&self.0).is_ok()

---- every_function_classification_matches_upstream stdout ----

thread 'every_function_classification_matches_upstream' (1738413) panicked at crates/ap-servo/tests/classify.rs:197:9:
assertion `left == right` failed: function 33: is_motor
  left: false
 right: true

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1738416) panicked at crates/ap-servo/tests/classify.rs:35:9:
function 33 should be a motor

---- the_two_motor_predicates_agree stdout ----

thread 'the_two_motor_predicates_agree' (1738421) panicked at crates/ap-servo/tests/classify.rs:63:9:
assertion `left == right` failed: function 33: is_motor and motor_num disagree
  left: false
 right: true

failures:
    every_function_classification_matches_upstream
    every_motor_round_trips_through_its_function
    the_two_motor_predicates_agree

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
