*** crates/ap-servo/src/function.rs:566:52: replace <= with > in Function::is_motor

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace <= with > in Function::is_motor
@@ -558,17 +558,17 @@
     /// Whether this drives a multicopter motor, upstream `is_motor`.
     ///
     /// The same three ranges as [`Self::motor`], expressed against the
     /// generated constants so they move together if upstream
     /// renumbers.
     #[must_use]
     pub const fn is_motor(self) -> bool {
         (self.0 >= Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0)
-            || (self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0)
+            || (self.0 >= Self::MOTOR9.0 && self.0 > /* ~ changed by cargo-mutants ~ */ Self::MOTOR12.0)
             || (self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0)
     }
 
     /// Whether this moves an aerodynamic surface, upstream
     /// `is_control_surface`.
     #[must_use]
     pub fn is_control_surface(self) -> bool {
         CONTROL_SURFACE.binary_search(&self.0).is_ok()

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1742608) panicked at crates/ap-servo/tests/classify.rs:35:9:
function 82 should be a motor

---- the_two_motor_predicates_agree stdout ----

thread 'the_two_motor_predicates_agree' (1742612) panicked at crates/ap-servo/tests/classify.rs:63:9:
assertion `left == right` failed: function 82: is_motor and motor_num disagree
  left: false
 right: true

---- non_motor_functions_have_no_motor_number stdout ----

thread 'non_motor_functions_have_no_motor_number' (1742609) panicked at crates/ap-servo/tests/classify.rs:51:9:
function 184 should not be a motor

failures:
    every_function_classification_matches_upstream
    every_motor_round_trips_through_its_function
    non_motor_functions_have_no_motor_number
    nothing_is_both_a_motor_and_a_control_surface
    the_two_motor_predicates_agree

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
