*** crates/ap-servo/src/function.rs:567:53: replace <= with > in Function::is_motor

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace <= with > in Function::is_motor
@@ -559,17 +559,17 @@
     ///
     /// The same three ranges as [`Self::motor`], expressed against the
     /// generated constants so they move together if upstream
     /// renumbers.
     #[must_use]
     pub const fn is_motor(self) -> bool {
         (self.0 >= Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0)
             || (self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0)
-            || (self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0)
+            || (self.0 >= Self::MOTOR13.0 && self.0 > /* ~ changed by cargo-mutants ~ */ Self::MOTOR32.0)
     }
 
     /// Whether this moves an aerodynamic surface, upstream
     /// `is_control_surface`.
     #[must_use]
     pub fn is_control_surface(self) -> bool {
         CONTROL_SURFACE.binary_search(&self.0).is_ok()
     }

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1744119) panicked at crates/ap-servo/tests/classify.rs:35:9:
function 160 should be a motor

---- every_function_classification_matches_upstream stdout ----

thread 'every_function_classification_matches_upstream' (1744117) panicked at crates/ap-servo/tests/classify.rs:197:9:
assertion `left == right` failed: function 160: is_motor
  left: false
 right: true

---- non_motor_functions_have_no_motor_number stdout ----

thread 'non_motor_functions_have_no_motor_number' (1744120) panicked at crates/ap-servo/tests/classify.rs:51:9:
function 184 should not be a motor

failures:
    every_function_classification_matches_upstream
    every_motor_round_trips_through_its_function
    non_motor_functions_have_no_motor_number
    the_two_motor_predicates_agree

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
