*** crates/ap-servo/src/function.rs:574:9: replace Function::is_control_surface -> bool with false

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace Function::is_control_surface -> bool with false
@@ -566,17 +566,17 @@
             || (self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0)
             || (self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0)
     }
 
     /// Whether this moves an aerodynamic surface, upstream
     /// `is_control_surface`.
     #[must_use]
     pub fn is_control_surface(self) -> bool {
-        CONTROL_SURFACE.binary_search(&self.0).is_ok()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// The zero-based motor this function drives, upstream
     /// `get_motor_num`. `None` for anything that is not a motor.
     ///
     /// The exact inverse of [`Self::motor`], written once rather than
     /// transcribed a second time -- a round-trip test pins the pair
     /// together, which no amount of re-reading the three ranges would.

---- every_function_classification_matches_upstream stdout ----

thread 'every_function_classification_matches_upstream' (1745639) panicked at crates/ap-servo/tests/classify.rs:204:9:
assertion `left == right` failed: function 2: is_control_surface
  left: false
 right: true

---- the_usual_surfaces_are_control_surfaces stdout ----

thread 'the_usual_surfaces_are_control_surfaces' (1745661) panicked at crates/ap-servo/tests/classify.rs:92:9:
function 4 should be a surface

failures:
    every_function_classification_matches_upstream
    the_usual_surfaces_are_control_surfaces

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
