*** crates/ap-servo/src/function.rs:585:19: replace >= with < in Function::motor_num

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace >= with < in Function::motor_num
@@ -577,17 +577,17 @@
     /// The zero-based motor this function drives, upstream
     /// `get_motor_num`. `None` for anything that is not a motor.
     ///
     /// The exact inverse of [`Self::motor`], written once rather than
     /// transcribed a second time -- a round-trip test pins the pair
     /// together, which no amount of re-reading the three ranges would.
     #[must_use]
     pub const fn motor_num(self) -> Option<u8> {
-        if self.0 >= Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0 {
+        if self.0 < /* ~ changed by cargo-mutants ~ */ Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0 {
             Some(self.0 - Self::MOTOR1.0)
         } else if self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0 {
             Some(8 + (self.0 - Self::MOTOR9.0))
         } else if self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0 {
             Some(12 + (self.0 - Self::MOTOR13.0))
         } else {
             None
         }

---- the_two_motor_predicates_agree stdout ----

thread 'the_two_motor_predicates_agree' (1750067) panicked at crates/ap-servo/src/function.rs:586:18:
attempt to subtract with overflow

---- non_motor_functions_have_no_motor_number stdout ----

thread 'non_motor_functions_have_no_motor_number' (1750064) panicked at crates/ap-servo/src/function.rs:586:18:
attempt to subtract with overflow

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1750061) panicked at crates/ap-servo/tests/classify.rs:28:9:
assertion `left == right` failed: motor 0 maps to function 33 which maps back to None
  left: None
 right: Some(0)

failures:
    every_motor_round_trips_through_its_function
    non_motor_functions_have_no_motor_number
    the_two_motor_predicates_agree

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
