*** crates/ap-servo/src/function.rs:585:9: replace Function::motor_num -> Option<u8> with None

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace Function::motor_num -> Option<u8> with None
@@ -577,19 +577,11 @@
     /// The zero-based motor this function drives, upstream
     /// `get_motor_num`. `None` for anything that is not a motor.
     ///
     /// The exact inverse of [`Self::motor`], written once rather than
     /// transcribed a second time -- a round-trip test pins the pair
     /// together, which no amount of re-reading the three ranges would.
     #[must_use]
     pub const fn motor_num(self) -> Option<u8> {
-        if self.0 >= Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0 {
-            Some(self.0 - Self::MOTOR1.0)
-        } else if self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0 {
-            Some(8 + (self.0 - Self::MOTOR9.0))
-        } else if self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0 {
-            Some(12 + (self.0 - Self::MOTOR13.0))
-        } else {
-            None
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1747141) panicked at crates/ap-servo/tests/classify.rs:28:9:
assertion `left == right` failed: motor 0 maps to function 33 which maps back to None
  left: None
 right: Some(0)

---- the_two_motor_predicates_agree stdout ----

thread 'the_two_motor_predicates_agree' (1747145) panicked at crates/ap-servo/tests/classify.rs:63:9:
assertion `left == right` failed: function 33: is_motor and motor_num disagree
  left: true
 right: false

failures:
    every_motor_round_trips_through_its_function
    the_two_motor_predicates_agree

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
