*** crates/ap-servo/src/function.rs:585:9: replace Function::motor_num -> Option<u8> with Some(0)

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace Function::motor_num -> Option<u8> with Some(0)
@@ -577,19 +577,11 @@
     /// The zero-based motor this function drives, upstream
     /// `get_motor_num`. `None` for anything that is not a motor.
     ///
     /// The exact inverse of [`Self::motor`], written once rather than
     /// transcribed a second time -- a round-trip test pins the pair
     /// together, which no amount of re-reading the three ranges would.
     #[must_use]
     pub const fn motor_num(self) -> Option<u8> {
-        if self.0 >= Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0 {
-            Some(self.0 - Self::MOTOR1.0)
-        } else if self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0 {
-            Some(8 + (self.0 - Self::MOTOR9.0))
-        } else if self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0 {
-            Some(12 + (self.0 - Self::MOTOR13.0))
-        } else {
-            None
-        }
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 }

---- the_two_motor_predicates_agree stdout ----

thread 'the_two_motor_predicates_agree' (1747501) panicked at crates/ap-servo/tests/classify.rs:63:9:
assertion `left == right` failed: function 0: is_motor and motor_num disagree
  left: false
 right: true

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1747485) panicked at crates/ap-servo/tests/classify.rs:28:9:
assertion `left == right` failed: motor 1 maps to function 34 which maps back to Some(0)
  left: Some(0)
 right: Some(1)

---- non_motor_functions_have_no_motor_number stdout ----

thread 'non_motor_functions_have_no_motor_number' (1747498) panicked at crates/ap-servo/tests/classify.rs:50:9:
assertion `left == right` failed: function 0 is not a motor
  left: Some(0)
 right: None

failures:
    every_motor_round_trips_through_its_function
    non_motor_functions_have_no_motor_number
    the_two_motor_predicates_agree

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
