*** crates/ap-servo/src/function.rs:586:25: replace - with + in Function::motor_num

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace - with + in Function::motor_num
@@ -578,17 +578,17 @@
     /// `get_motor_num`. `None` for anything that is not a motor.
     ///
     /// The exact inverse of [`Self::motor`], written once rather than
     /// transcribed a second time -- a round-trip test pins the pair
     /// together, which no amount of re-reading the three ranges would.
     #[must_use]
     pub const fn motor_num(self) -> Option<u8> {
         if self.0 >= Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0 {
-            Some(self.0 - Self::MOTOR1.0)
+            Some(self.0 + /* ~ changed by cargo-mutants ~ */ Self::MOTOR1.0)
         } else if self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0 {
             Some(8 + (self.0 - Self::MOTOR9.0))
         } else if self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0 {
             Some(12 + (self.0 - Self::MOTOR13.0))
         } else {
             None
         }
     }

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1751696) panicked at crates/ap-servo/tests/classify.rs:28:9:
assertion `left == right` failed: motor 0 maps to function 33 which maps back to Some(66)
  left: Some(66)
 right: Some(0)

failures:
    every_motor_round_trips_through_its_function

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
