*** crates/ap-servo/src/function.rs:587:54: replace <= with > in Function::motor_num

*** mutation diff:
--- crates/ap-servo/src/function.rs
+++ replace <= with > in Function::motor_num
@@ -579,17 +579,17 @@
     ///
     /// The exact inverse of [`Self::motor`], written once rather than
     /// transcribed a second time -- a round-trip test pins the pair
     /// together, which no amount of re-reading the three ranges would.
     #[must_use]
     pub const fn motor_num(self) -> Option<u8> {
         if self.0 >= Self::MOTOR1.0 && self.0 <= Self::MOTOR8.0 {
             Some(self.0 - Self::MOTOR1.0)
-        } else if self.0 >= Self::MOTOR9.0 && self.0 <= Self::MOTOR12.0 {
+        } else if self.0 >= Self::MOTOR9.0 && self.0 > /* ~ changed by cargo-mutants ~ */ Self::MOTOR12.0 {
             Some(8 + (self.0 - Self::MOTOR9.0))
         } else if self.0 >= Self::MOTOR13.0 && self.0 <= Self::MOTOR32.0 {
             Some(12 + (self.0 - Self::MOTOR13.0))
         } else {
             None
         }
     }
 }

---- non_motor_functions_have_no_motor_number stdout ----

thread 'non_motor_functions_have_no_motor_number' (1754478) panicked at crates/ap-servo/tests/classify.rs:50:9:
assertion `left == right` failed: function 184 is not a motor
  left: Some(110)
 right: None

---- the_two_motor_predicates_agree stdout ----

thread 'the_two_motor_predicates_agree' (1754481) panicked at crates/ap-servo/tests/classify.rs:63:9:
assertion `left == right` failed: function 82: is_motor and motor_num disagree
  left: true
 right: false

---- every_motor_round_trips_through_its_function stdout ----

thread 'every_motor_round_trips_through_its_function' (1754477) panicked at crates/ap-servo/tests/classify.rs:28:9:
assertion `left == right` failed: motor 8 maps to function 82 which maps back to None
  left: None
 right: Some(8)

failures:
    every_motor_round_trips_through_its_function
    non_motor_functions_have_no_motor_number
    the_two_motor_predicates_agree

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
