*** crates/ap-servo/src/lib.rs:132:45: replace || with && in ServoChannel::pwm_from_range

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace || with && in ServoChannel::pwm_from_range
@@ -124,17 +124,17 @@
 
     /// Pulse width for a `0..high_out` value, upstream `pwm_from_range`.
     ///
     /// A misconfigured channel — maximum not above minimum, or no range set —
     /// produces the minimum rather than an error. That is upstream's choice
     /// and it is the safe direction for a throttle.
     #[must_use]
     pub fn pwm_from_range(&self, scaled_value: f32) -> u16 {
-        if self.servo_max <= self.servo_min || self.high_out == 0 {
+        if self.servo_max <= self.servo_min && /* ~ changed by cargo-mutants ~ */ self.high_out == 0 {
             return self.servo_min;
         }
         let high = f32::from(self.high_out);
         let mut v = constrain_value(scaled_value, 0.0, high);
         if self.reversed {
             v = high - v;
         }
         let span = f32::from(self.servo_max) - f32::from(self.servo_min);

---- pwm_conversion_matches_upstream stdout ----
1088 conversions compared, 476 of them degenerate

thread 'pwm_conversion_matches_upstream' (1668307) panicked at crates/ap-servo/tests/servo_parity.rs:116:5:
8 range conversion(s) disagree; first few:
  range min=2000 trim=1500 max=1000 high=4500 rev=false v=45: port 1990, upstream 2000
  range min=2000 trim=1500 max=1000 high=4500 rev=false v=100: port 1978, upstream 2000
  range min=2000 trim=1500 max=1000 high=4500 rev=false v=4500: port 1000, upstream 2000
  range min=2000 trim=1500 max=1000 high=4500 rev=false v=9000: port 1000, upstream 2000
  range min=2000 trim=1500 max=1000 high=4500 rev=false v=2249.9: port 1501, upstream 2000
  range min=2000 trim=1500 max=1000 high=4500 rev=true v=0: port 1000, upstream 2000
  range min=2000 trim=1500 max=1000 high=4500 rev=true v=1: port 1001, upstream 2000
  range min=2000 trim=1500 max=1000

failures:
    pwm_conversion_matches_upstream

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
