*** crates/ap-servo/src/lib.rs:132:9: replace ServoChannel::pwm_from_range -> u16 with 0

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace ServoChannel::pwm_from_range -> u16 with 0
@@ -124,27 +124,17 @@
 
     /// Pulse width for a `0..high_out` value, upstream `pwm_from_range`.
     ///
     /// A misconfigured channel — maximum not above minimum, or no range set —
     /// produces the minimum rather than an error. That is upstream's choice
     /// and it is the safe direction for a throttle.
     #[must_use]
     pub fn pwm_from_range(&self, scaled_value: f32) -> u16 {
-        if self.servo_max <= self.servo_min || self.high_out == 0 {
-            return self.servo_min;
-        }
-        let high = f32::from(self.high_out);
-        let mut v = constrain_value(scaled_value, 0.0, high);
-        if self.reversed {
-            v = high - v;
-        }
-        let span = f32::from(self.servo_max) - f32::from(self.servo_min);
-        self.servo_min
-            .wrapping_add(truncate_to_u16((v * span) / high))
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Pulse width for a `-high_out..high_out` value, upstream
     /// `pwm_from_angle`.
     ///
     /// The two halves are scaled independently, against `trim..max` above and
     /// `min..trim` below, so a trim that is not centred still reaches both
     /// endpoints at full deflection.

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1665392) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 0 (estop false, scaled 0): 0 != upstream 1000
  left: 0
 right: 1000

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
