*** crates/ap-servo/src/lib.rs:153:26: replace == with != in ServoChannel::pwm_from_angle

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace == with != in ServoChannel::pwm_from_angle
@@ -145,17 +145,17 @@
     /// Pulse width for a `-high_out..high_out` value, upstream
     /// `pwm_from_angle`.
     ///
     /// The two halves are scaled independently, against `trim..max` above and
     /// `min..trim` below, so a trim that is not centred still reaches both
     /// endpoints at full deflection.
     #[must_use]
     pub fn pwm_from_angle(&self, scaled_value: f32) -> u16 {
-        if self.high_out == 0 {
+        if self.high_out != /* ~ changed by cargo-mutants ~ */ 0 {
             return self.servo_trim;
         }
         let mut v = scaled_value;
         if self.reversed {
             v = -v;
         }
         let high = f32::from(self.high_out);
         v = constrain_value(v, -high, high);

---- an_off_centre_trim_still_reaches_both_endpoints stdout ----

thread 'an_off_centre_trim_still_reaches_both_endpoints' (1678518) panicked at crates/ap-servo/tests/servo_parity.rs:146:5:
assertion `left == right` failed
  left: 1200
 right: 2000

---- full_deflection_reaches_the_endpoints stdout ----

thread 'full_deflection_reaches_the_endpoints' (1678519) panicked at crates/ap-servo/tests/servo_parity.rs:131:5:
assertion `left == right` failed
  left: 1500
 right: 2000

---- pwm_conversion_matches_upstream stdout ----
1088 conversions compared, 476 of them degenerate

thread 'pwm_conversion_matches_upstream' (1678532) panicked at crates/ap-servo/tests/servo_parity.rs:110:5:
8 angle conversion(s) disagree; first few:
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=45: port 1500, upstream 1505
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=-45: port 1500, upstream 1495
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=100: port 1500, upstream 1511
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=-100: port 1500, upstream 1489
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=4500: port 1500, upstream 2000
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=-4500: port 1500, upstream 1000
  angle min=1000 trim=1500 max=2000 high=4500 rev=false v=9000: port 1500, upstream 2000
  angle min=1000 trim=1500 ma

failures:
    an_off_centre_trim_still_reaches_both_endpoints
    full_deflection_reaches_the_endpoints
    pwm_conversion_matches_upstream

test result: FAILED. 0 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
