*** crates/ap-servo/src/lib.rs:163:14: replace > with < in ServoChannel::pwm_from_angle

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace > with < in ServoChannel::pwm_from_angle
@@ -155,17 +155,17 @@
         }
         let mut v = scaled_value;
         if self.reversed {
             v = -v;
         }
         let high = f32::from(self.high_out);
         v = constrain_value(v, -high, high);
 
-        if v > 0.0 {
+        if v < /* ~ changed by cargo-mutants ~ */ 0.0 {
             let span = f32::from(self.servo_max) - f32::from(self.servo_trim);
             self.servo_trim
                 .wrapping_add(truncate_to_u16((v * span) / high))
         } else {
             let span = f32::from(self.servo_trim) - f32::from(self.servo_min);
             self.servo_trim
                 .wrapping_sub(truncate_to_u16((-v * span) / high))
         }

---- an_off_centre_trim_still_reaches_both_endpoints stdout ----

thread 'an_off_centre_trim_still_reaches_both_endpoints' (1681429) panicked at crates/ap-servo/tests/servo_parity.rs:146:5:
assertion `left == right` failed
  left: 1400
 right: 2000

---- pwm_conversion_matches_upstream stdout ----
1088 conversions compared, 476 of them degenerate

thread 'pwm_conversion_matches_upstream' (1681431) panicked at crates/ap-servo/tests/servo_parity.rs:110:5:
8 angle conversion(s) disagree; first few:
  angle min=1000 trim=1200 max=2000 high=4500 rev=false v=45: port 1202, upstream 1208
  angle min=1000 trim=1200 max=2000 high=4500 rev=false v=-45: port 1192, upstream 1198
  angle min=1000 trim=1200 max=2000 high=4500 rev=false v=100: port 1204, upstream 1217
  angle min=1000 trim=1200 max=2000 high=4500 rev=false v=-100: port 1183, upstream 1196
  angle min=1000 trim=1200 max=2000 high=4500 rev=false v=4500: port 1400, upstream 2000
  angle min=1000 trim=1200 max=2000 high=4500 rev=false v=-4500: port 400, upstream 1000
  angle min=1000 trim=1200 max=2000 high=4500 rev=false v=9000: port 1400, upstream 2000
  angle min=1000 trim=1200 max

failures:
    an_off_centre_trim_still_reaches_both_endpoints
    pwm_conversion_matches_upstream

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
