*** crates/ap-servo/src/lib.rs:163:14: replace > with >= in ServoChannel::pwm_from_angle

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace > with >= in ServoChannel::pwm_from_angle
@@ -155,17 +155,17 @@
         }
         let mut v = scaled_value;
         if self.reversed {
             v = -v;
         }
         let high = f32::from(self.high_out);
         v = constrain_value(v, -high, high);
 
-        if v > 0.0 {
+        if v >= /* ~ changed by cargo-mutants ~ */ 0.0 {
             let span = f32::from(self.servo_max) - f32::from(self.servo_trim);
             self.servo_trim
                 .wrapping_add(truncate_to_u16((v * span) / high))
         } else {
             let span = f32::from(self.servo_trim) - f32::from(self.servo_min);
             self.servo_trim
                 .wrapping_sub(truncate_to_u16((-v * span) / high))
         }

*** result: Success
