*** crates/ap-servo/src/lib.rs:192:9: replace ServoChannel::output_norm -> f32 with 1.0

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace ServoChannel::output_norm -> f32 with 1.0
@@ -184,32 +184,17 @@
     /// Normalised output in `-1..1` about the midpoint of the travel,
     /// upstream `get_output_norm`.
     ///
     /// Note the midpoint here is the mean of minimum and maximum, *not* the
     /// trim — so a channel with an off-centre trim reports a non-zero
     /// normalised output when it is sitting at its own neutral.
     #[must_use]
     pub fn output_norm(&self, output_pwm: u16) -> f32 {
-        let mid = (self.servo_max + self.servo_min) / 2;
-        if mid <= self.servo_min {
-            return 0.0;
-        }
-        let ret = if output_pwm < mid {
-            f32::from(mid - output_pwm) / -f32::from(mid - self.servo_min)
-        } else if output_pwm > mid {
-            f32::from(output_pwm - mid) / f32::from(self.servo_max - mid)
-        } else {
-            0.0
-        };
-        if self.reversed {
-            -ret
-        } else {
-            ret
-        }
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A named endpoint of a channel's travel, upstream `SRV_Channel::Limit`.
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub enum Limit {
     /// The neutral position.
     Trim,

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1695621) panicked at crates/ap-servo/tests/slew_parity.rs:801:5:
the bottom of the travel should read -1, got 1

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1695624) panicked at crates/ap-servo/tests/slew_parity.rs:1115:9:
0.5 should read back as 0.5, got 1

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1695622) panicked at crates/ap-servo/tests/slew_parity.rs:746:9:
row 0 norm: 1 != upstream -1 (diff 2)

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream
    the_remaining_function_operations_do_something

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
