*** crates/ap-servo/src/lib.rs:196:33: replace < with > in ServoChannel::output_norm

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace < with > in ServoChannel::output_norm
@@ -188,17 +188,17 @@
     /// trim — so a channel with an off-centre trim reports a non-zero
     /// normalised output when it is sitting at its own neutral.
     #[must_use]
     pub fn output_norm(&self, output_pwm: u16) -> f32 {
         let mid = (self.servo_max + self.servo_min) / 2;
         if mid <= self.servo_min {
             return 0.0;
         }
-        let ret = if output_pwm < mid {
+        let ret = if output_pwm > /* ~ changed by cargo-mutants ~ */ mid {
             f32::from(mid - output_pwm) / -f32::from(mid - self.servo_min)
         } else if output_pwm > mid {
             f32::from(output_pwm - mid) / f32::from(self.servo_max - mid)
         } else {
             0.0
         };
         if self.reversed {
             -ret

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1701638) panicked at crates/ap-servo/src/lib.rs:197:23:
attempt to subtract with overflow

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1701643) panicked at crates/ap-servo/src/lib.rs:197:23:
attempt to subtract with overflow

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1701639) panicked at crates/ap-servo/tests/slew_parity.rs:746:9:
row 0 norm: 0 != upstream -1 (diff 1)

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream
    the_remaining_function_operations_do_something

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
