*** crates/ap-servo/src/lib.rs:198:30: replace > with == in ServoChannel::output_norm

*** mutation diff:
--- crates/ap-servo/src/lib.rs
+++ replace > with == in ServoChannel::output_norm
@@ -190,17 +190,17 @@
     #[must_use]
     pub fn output_norm(&self, output_pwm: u16) -> f32 {
         let mid = (self.servo_max + self.servo_min) / 2;
         if mid <= self.servo_min {
             return 0.0;
         }
         let ret = if output_pwm < mid {
             f32::from(mid - output_pwm) / -f32::from(mid - self.servo_min)
-        } else if output_pwm > mid {
+        } else if output_pwm == /* ~ changed by cargo-mutants ~ */ mid {
             f32::from(output_pwm - mid) / f32::from(self.servo_max - mid)
         } else {
             0.0
         };
         if self.reversed {
             -ret
         } else {
             ret

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1709003) panicked at crates/ap-servo/tests/slew_parity.rs:1115:9:
0.5 should read back as 0.5, got 0

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1708997) panicked at crates/ap-servo/tests/slew_parity.rs:805:5:
the top of the travel should read +1, got 0

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1708998) panicked at crates/ap-servo/tests/slew_parity.rs:746:9:
row 21 norm: 0 != upstream 0.055 (diff 0.055)

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream
    the_remaining_function_operations_do_something

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
