*** crates/ap-servo/src/output_channel.rs:115:31: replace && with || in OutputChannel::calc_pwm

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace && with || in OutputChannel::calc_pwm
@@ -107,17 +107,17 @@
     /// docs for why that outranks even an emergency stop.
     pub fn calc_pwm(&mut self, output_scaled: f32, ctx: &OutputContext) {
         if self.ch_num < 32 && (ctx.have_pwm_mask & (1_u32 << self.ch_num)) != 0 {
             return;
         }
 
         let mut output_scaled = output_scaled;
         let mut force = false;
-        if ctx.emergency_stop && self.function.should_e_stop() {
+        if ctx.emergency_stop || /* ~ changed by cargo-mutants ~ */ self.function.should_e_stop() {
             output_scaled = 0.0;
             force = true;
         }
 
         if !force && self.override_active {
             return;
         }

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1776901) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 2 (estop false, scaled 0): 1000 != upstream 1777
  left: 1000
 right: 1777

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
