*** crates/ap-servo/src/output_channel.rs:138:9: replace OutputChannel::output_norm -> f32 with 1.0

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace OutputChannel::output_norm -> f32 with 1.0
@@ -130,17 +130,17 @@
     /// not the trim. A channel trimmed away from centre reads non-zero at
     /// rest, which is correct: this reports where the surface sits within its
     /// range, not how far it is from where it likes to sit.
     ///
     /// The arithmetic lives on [`ServoChannel::output_norm`], since it depends
     /// only on the configuration and the width.
     #[must_use]
     pub fn output_norm(&self) -> f32 {
-        self.config.output_norm(self.output_pwm)
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set a normalised output, upstream `set_output_norm`.
     ///
     /// `-1` to `1` about the mid point. Goes through
     /// [`Self::set_output_pwm`], so it is a direct pulse write and takes the
     /// mask with it — not the scaled path.
     pub fn set_output_norm(&mut self, value: f32) -> bool {

---- the_normalised_read_handles_the_awkward_shapes stdout ----

thread 'the_normalised_read_handles_the_awkward_shapes' (1780276) panicked at crates/ap-servo/tests/slew_parity.rs:801:5:
the bottom of the travel should read -1, got 1

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1780279) panicked at crates/ap-servo/tests/slew_parity.rs:1115:9:
0.5 should read back as 0.5, got 1

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1780277) panicked at crates/ap-servo/tests/slew_parity.rs:746:9:
row 0 norm: 1 != upstream -1 (diff 2)

failures:
    the_normalised_read_handles_the_awkward_shapes
    the_normalised_read_matches_upstream
    the_remaining_function_operations_do_something

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
