*** crates/ap-servo/src/output_channel.rs:147:28: replace * with + in OutputChannel::set_output_norm

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace * with + in OutputChannel::set_output_norm
@@ -139,12 +139,12 @@
     }
 
     /// Set a normalised output, upstream `set_output_norm`.
     ///
     /// `-1` to `1` about the mid point. Goes through
     /// [`Self::set_output_pwm`], so it is a direct pulse write and takes the
     /// mask with it — not the scaled path.
     pub fn set_output_norm(&mut self, value: f32) -> bool {
-        let scaled = value * f32::from(self.config.high_out);
+        let scaled = value + /* ~ changed by cargo-mutants ~ */ f32::from(self.config.high_out);
         self.set_output_pwm(self.config.pwm_from_scaled_value(scaled), false)
     }
 }

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1783582) panicked at crates/ap-servo/tests/slew_parity.rs:1115:9:
0.5 should read back as 0.5, got 1

failures:
    the_remaining_function_operations_do_something

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
