*** crates/ap-servo/src/output_channel.rs:81:9: replace OutputChannel::override_active -> bool with true

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace OutputChannel::override_active -> bool with true
@@ -73,17 +73,17 @@
     pub fn output_pwm(&self) -> u16 {
         self.output_pwm
     }
 
     /// Whether an override is holding this channel, upstream
     /// `override_active`.
     #[must_use]
     pub fn override_active(&self) -> bool {
-        self.override_active
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Upstream `set_override`.
     pub fn set_override(&mut self, active: bool) {
         self.override_active = active;
     }
 
     /// Set the pulse directly, upstream `set_output_pwm`.

*** result: Success
