*** crates/ap-servo/src/output_channel.rs:86:9: replace OutputChannel::set_override with ()

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace OutputChannel::set_override with ()
@@ -78,17 +78,17 @@
     /// `override_active`.
     #[must_use]
     pub fn override_active(&self) -> bool {
         self.override_active
     }
 
     /// Upstream `set_override`.
     pub fn set_override(&mut self, active: bool) {
-        self.override_active = active;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the pulse directly, upstream `set_output_pwm`.
     ///
     /// Returns whether it took. An active override refuses an unforced write,
     /// and the caller needs to know, because upstream's version also sets this
     /// channel's bit in the shared pulse-width mask — and only when the write
     /// actually happened.

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1767002) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 2 (estop false, scaled 0): 1000 != upstream 1777
  left: 1000
 right: 1777

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
