*** crates/ap-servo/src/output_channel.rs:96:33: replace && with || in OutputChannel::set_output_pwm

*** mutation diff:
--- crates/ap-servo/src/output_channel.rs
+++ replace && with || in OutputChannel::set_output_pwm
@@ -88,17 +88,17 @@
 
     /// Set the pulse directly, upstream `set_output_pwm`.
     ///
     /// Returns whether it took. An active override refuses an unforced write,
     /// and the caller needs to know, because upstream's version also sets this
     /// channel's bit in the shared pulse-width mask — and only when the write
     /// actually happened.
     pub fn set_output_pwm(&mut self, pwm: u16, force: bool) -> bool {
-        if self.override_active && !force {
+        if self.override_active || /* ~ changed by cargo-mutants ~ */ !force {
             return false;
         }
         self.output_pwm = pwm;
         true
     }
 
     /// Compute the pulse from a scaled value, upstream `calc_pwm`.
     ///

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1768946) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 1 (estop false, scaled 0): 1000 != upstream 1234
  left: 1000
 right: 1234

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
