*** crates/ap-servo/src/registry.rs:133:9: replace Registry::output_channel_mask -> ChannelMask with Default::default()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::output_channel_mask -> ChannelMask with Default::default()
@@ -125,23 +125,17 @@
     /// Upstream also builds the masks lazily here if they have never been
     /// built. This does not, because the channel assignments are an argument
     /// to [`Self::update_aux_servo_function`] rather than global state it
     /// could reach for — so a caller that has not built them gets the honest
     /// answer for an empty registry instead of a hidden rebuild. See
     /// [`Self::initialised`].
     #[must_use]
     pub fn output_channel_mask(&self, function: Function) -> ChannelMask {
-        if function.valid() {
-            self.functions
-                .get(usize::from(function.0))
-                .map_or(self.invalid_mask, |f| f.channel_mask)
-        } else {
-            self.invalid_mask
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// The channels whose own `SERVOn_FUNCTION` is not a defined function,
     /// upstream `invalid_mask`.
     #[must_use]
     pub fn invalid_mask(&self) -> ChannelMask {
         self.invalid_mask
     }

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1785135) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 1 (estop false, scaled 0): 1000 != upstream 1234
  left: 1000
 right: 1234

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
