*** crates/ap-servo/src/registry.rs:186:36: replace |= with &= in Registry::update_aux_servo_function

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace |= with &= in Registry::update_aux_servo_function
@@ -178,17 +178,17 @@
                 break;
             }
             let bit = 1_u32 << i;
             if !function.valid() {
                 self.invalid_mask |= bit;
                 continue;
             }
             if let Some(entry) = self.functions.get_mut(usize::from(function.0)) {
-                entry.channel_mask |= bit;
+                entry.channel_mask &= /* ~ changed by cargo-mutants ~ */ bit;
             }
         }
 
         self.initialised = true;
     }
 
     /// Write a function's scaled value, upstream `set_output_scaled`.
     ///

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1794097) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 1 (estop false, scaled 0): 1000 != upstream 1234
  left: 1000
 right: 1234

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
