*** crates/ap-servo/src/registry.rs:208:28: replace &= with |= in Registry::set_output_scaled

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace &= with |= in Registry::set_output_scaled
@@ -200,17 +200,17 @@
     pub fn set_output_scaled(&mut self, function: Function, value: f32) {
         if !function.valid() {
             return;
         }
         let Some(entry) = self.functions.get_mut(usize::from(function.0)) else {
             return;
         };
         entry.output_scaled = value;
-        self.have_pwm_mask &= !entry.channel_mask;
+        self.have_pwm_mask |= /* ~ changed by cargo-mutants ~ */ !entry.channel_mask;
     }
 
     /// Read a function's scaled value, upstream `get_output_scaled`.
     ///
     /// Zero for an undefined function. Note this is a plain zero, not
     /// [`INVALID_MASK`]'s equivalent — upstream distinguishes invalid from
     /// unset for the channel mask but not for the value, and the port
     /// reproduces that rather than tidying it.

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1794159) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 0 (estop false, scaled 0): 0 != upstream 1000
  left: 0
 right: 1000

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
