*** crates/ap-servo/src/registry.rs:248:12: delete ! in Registry::set_slew_rate

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::set_slew_rate
@@ -240,17 +240,17 @@
     /// Returns false only for an invalid function or a full table.
     pub fn set_slew_rate(
         &mut self,
         function: Function,
         slew_rate: f32,
         range: u16,
         dt: f32,
     ) -> bool {
-        if !function.valid() {
+        if  /* ~ changed by cargo-mutants ~ */function.valid() {
             return false;
         }
         let max_change = f32::from(range) * slew_rate * 0.01 * dt;
 
         for entry in self.slew.iter_mut().flatten() {
             if entry.func == function {
                 entry.max_change = max_change;
                 return true;

---- a_full_slew_table_leaves_the_function_unlimited stdout ----

thread 'a_full_slew_table_leaves_the_function_unlimited' (1800638) panicked at crates/ap-servo/tests/slew_parity.rs:215:9:
entry 0 should fit

---- a_disabled_limit_still_tracks_the_output stdout ----

thread 'a_disabled_limit_still_tracks_the_output' (1800635) panicked at crates/ap-servo/tests/slew_parity.rs:198:5:
the first limited step should leave 399.8, got 0

---- a_new_entry_starts_from_the_current_output stdout ----

thread 'a_new_entry_starts_from_the_current_output' (1800641) panicked at crates/ap-servo/tests/slew_parity.rs:294:5:
assertion failed: reg.set_slew_rate(thr, 10.0, 100, dt)

failures:
    a_disabled_limit_still_tracks_the_output
    a_full_slew_table_leaves_the_function_unlimited
    a_new_entry_starts_from_the_current_output
    the_slew_limiter_matches_upstream

test result: FAILED. 12 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
