*** crates/ap-servo/src/registry.rs:248:9: replace Registry::set_slew_rate -> bool with true

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::set_slew_rate -> bool with true
@@ -240,40 +240,17 @@
     /// Returns false only for an invalid function or a full table.
     pub fn set_slew_rate(
         &mut self,
         function: Function,
         slew_rate: f32,
         range: u16,
         dt: f32,
     ) -> bool {
-        if !function.valid() {
-            return false;
-        }
-        let max_change = f32::from(range) * slew_rate * 0.01 * dt;
-
-        for entry in self.slew.iter_mut().flatten() {
-            if entry.func == function {
-                entry.max_change = max_change;
-                return true;
-            }
-        }
-
-        let current = self.output_scaled(function);
-        for slot in &mut self.slew {
-            if slot.is_none() {
-                *slot = Some(SlewEntry {
-                    func: function,
-                    last_scaled_output: current,
-                    max_change,
-                });
-                return true;
-            }
-        }
-        false
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Force a function's slew history, upstream `set_slew_last_scaled_output`.
     ///
     /// For a caller that has moved the output by some route the slew limiter
     /// did not see, and wants the next limited step measured from there rather
     /// than from the stale value.
     pub fn set_slew_last_scaled_output(&mut self, function: Function, value: f32) {

---- a_disabled_limit_still_tracks_the_output stdout ----

thread 'a_disabled_limit_still_tracks_the_output' (1798539) panicked at crates/ap-servo/tests/slew_parity.rs:198:5:
the first limited step should leave 399.8, got 0

---- a_new_entry_starts_from_the_current_output stdout ----

thread 'a_new_entry_starts_from_the_current_output' (1798551) panicked at crates/ap-servo/tests/slew_parity.rs:308:5:
expected 250.2, got 1000

---- a_full_slew_table_leaves_the_function_unlimited stdout ----

thread 'a_full_slew_table_leaves_the_function_unlimited' (1798547) panicked at crates/ap-servo/tests/slew_parity.rs:220:5:
assertion `left == right` failed
  left: 0
 right: 16

failures:
    a_disabled_limit_still_tracks_the_output
    a_full_slew_table_leaves_the_function_unlimited
    a_new_entry_starts_from_the_current_output
    the_slew_limiter_matches_upstream

test result: FAILED. 12 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
