*** crates/ap-servo/src/registry.rs:251:55: replace * with + in Registry::set_slew_rate

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace * with + in Registry::set_slew_rate
@@ -243,17 +243,17 @@
         function: Function,
         slew_rate: f32,
         range: u16,
         dt: f32,
     ) -> bool {
         if !function.valid() {
             return false;
         }
-        let max_change = f32::from(range) * slew_rate * 0.01 * dt;
+        let max_change = f32::from(range) * slew_rate + /* ~ changed by cargo-mutants ~ */ 0.01 * dt;
 
         for entry in self.slew.iter_mut().flatten() {
             if entry.func == function {
                 entry.max_change = max_change;
                 return true;
             }
         }

---- a_disabled_limit_still_tracks_the_output stdout ----

thread 'a_disabled_limit_still_tracks_the_output' (1802269) panicked at crates/ap-servo/tests/slew_parity.rs:190:5:
assertion `left == right` failed: a zero rate must not limit
  left: 0.009999998
 right: 400.0

---- a_new_entry_starts_from_the_current_output stdout ----

thread 'a_new_entry_starts_from_the_current_output' (1802273) panicked at crates/ap-servo/tests/slew_parity.rs:308:5:
expected 250.2, got 1000

---- the_slew_limiter_matches_upstream stdout ----

thread 'the_slew_limiter_matches_upstream' (1802284) panicked at crates/ap-servo/tests/slew_parity.rs:99:13:
step 40 peek_thr: 90 != upstream 1.1999999 (diff 88.8)

failures:
    a_disabled_limit_still_tracks_the_output
    a_new_entry_starts_from_the_current_output
    peeking_does_not_advance_the_slew_history
    the_slew_limiter_matches_upstream

test result: FAILED. 12 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
