*** crates/ap-servo/src/registry.rs:305:12: delete ! in Registry::slew_limited_output_scaled

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::slew_limited_output_scaled
@@ -297,17 +297,17 @@
     /// value that never moves. Both follow from what this is: a question about
     /// what the output *would* be, not a step of the filter.
     ///
     /// The `&self` is load-bearing: folding the peek and the step together is
     /// not a bug this port can express. Upstream's equivalent is a non-const
     /// static method and relies on the author not writing the assignment.
     #[must_use]
     pub fn slew_limited_output_scaled(&self, function: Function) -> f32 {
-        if !function.valid() {
+        if  /* ~ changed by cargo-mutants ~ */function.valid() {
             return 0.0;
         }
         let value = self.output_scaled(function);
         for entry in self.slew.iter().flatten() {
             if entry.func == function {
                 if !is_positive(entry.max_change) {
                     // Zero or negative reads as disabled. Upstream breaks
                     // rather than continuing the search, which would only

---- peeking_does_not_advance_the_slew_history stdout ----

thread 'peeking_does_not_advance_the_slew_history' (1809609) panicked at crates/ap-servo/tests/slew_parity.rs:156:9:
peek 0: 0 != upstream 500

---- the_slew_limiter_matches_upstream stdout ----

thread 'the_slew_limiter_matches_upstream' (1809623) panicked at crates/ap-servo/tests/slew_parity.rs:99:13:
step 40 peek_thr: 0 != upstream 1.1999999 (diff 1.1999999)

failures:
    peeking_does_not_advance_the_slew_history
    the_slew_limiter_matches_upstream

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
