*** crates/ap-servo/src/registry.rs:310:27: replace == with != in Registry::slew_limited_output_scaled

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace == with != in Registry::slew_limited_output_scaled
@@ -302,17 +302,17 @@
     /// static method and relies on the author not writing the assignment.
     #[must_use]
     pub fn slew_limited_output_scaled(&self, function: Function) -> f32 {
         if !function.valid() {
             return 0.0;
         }
         let value = self.output_scaled(function);
         for entry in self.slew.iter().flatten() {
-            if entry.func == function {
+            if entry.func != /* ~ changed by cargo-mutants ~ */ function {
                 if !is_positive(entry.max_change) {
                     // Zero or negative reads as disabled. Upstream breaks
                     // rather than continuing the search, which would only
                     // differ if a function could appear twice — it cannot,
                     // because `set_slew_rate` updates in place.
                     break;
                 }
                 return value.clamp(

---- the_slew_limiter_matches_upstream stdout ----

thread 'the_slew_limiter_matches_upstream' (1812308) panicked at crates/ap-servo/tests/slew_parity.rs:99:13:
step 40 peek_thr: 90 != upstream 1.1999999 (diff 88.8)

failures:
    the_slew_limiter_matches_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
