*** crates/ap-servo/src/registry.rs:311:20: delete ! in Registry::slew_limited_output_scaled

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::slew_limited_output_scaled
@@ -303,17 +303,17 @@
     #[must_use]
     pub fn slew_limited_output_scaled(&self, function: Function) -> f32 {
         if !function.valid() {
             return 0.0;
         }
         let value = self.output_scaled(function);
         for entry in self.slew.iter().flatten() {
             if entry.func == function {
-                if !is_positive(entry.max_change) {
+                if  /* ~ changed by cargo-mutants ~ */is_positive(entry.max_change) {
                     // Zero or negative reads as disabled. Upstream breaks
                     // rather than continuing the search, which would only
                     // differ if a function could appear twice — it cannot,
                     // because `set_slew_rate` updates in place.
                     break;
                 }
                 return value.clamp(
                     entry.last_scaled_output - entry.max_change,

---- the_slew_limiter_matches_upstream stdout ----

thread 'the_slew_limiter_matches_upstream' (1812510) panicked at crates/ap-servo/tests/slew_parity.rs:99:13:
step 40 peek_thr: 90 != upstream 1.1999999 (diff 88.8)

---- peeking_does_not_advance_the_slew_history stdout ----

thread 'peeking_does_not_advance_the_slew_history' (1812503) panicked at crates/ap-servo/tests/slew_parity.rs:156:9:
peek 0: 20 != upstream 500

failures:
    peeking_does_not_advance_the_slew_history
    the_slew_limiter_matches_upstream

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
