*** crates/ap-servo/src/registry.rs:319:46: replace - with + in Registry::slew_limited_output_scaled

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace - with + in Registry::slew_limited_output_scaled
@@ -311,17 +311,17 @@
                 if !is_positive(entry.max_change) {
                     // Zero or negative reads as disabled. Upstream breaks
                     // rather than continuing the search, which would only
                     // differ if a function could appear twice — it cannot,
                     // because `set_slew_rate` updates in place.
                     break;
                 }
                 return value.clamp(
-                    entry.last_scaled_output - entry.max_change,
+                    entry.last_scaled_output + /* ~ changed by cargo-mutants ~ */ entry.max_change,
                     entry.last_scaled_output + entry.max_change,
                 );
             }
         }
         value
     }
 
     /// Enforce every slew limit and advance the history, upstream the first

---- the_slew_limiter_matches_upstream stdout ----

thread 'the_slew_limiter_matches_upstream' (1813297) panicked at crates/ap-servo/tests/slew_parity.rs:99:13:
step 0 peek_thr: 1.1999999 != upstream 0 (diff 1.1999999)

failures:
    the_slew_limiter_matches_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
