*** crates/ap-servo/src/registry.rs:348:46: replace - with / in Registry::apply_slew_limits

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace - with / in Registry::apply_slew_limits
@@ -340,17 +340,17 @@
             if !entry.func.valid() {
                 continue;
             }
             let Some(f) = self.functions.get_mut(usize::from(entry.func.0)) else {
                 continue;
             };
             if is_positive(entry.max_change) {
                 f.output_scaled = f.output_scaled.clamp(
-                    entry.last_scaled_output - entry.max_change,
+                    entry.last_scaled_output / /* ~ changed by cargo-mutants ~ */ entry.max_change,
                     entry.last_scaled_output + entry.max_change,
                 );
             }
             entry.last_scaled_output = f.output_scaled;
         }
     }
 
     /// Hold a channel at a pulse width for a while, upstream

---- a_disabled_limit_still_tracks_the_output stdout ----

thread 'a_disabled_limit_still_tracks_the_output' (1818080) panicked at /rustc/88d9e12ae178fab0fb5cc050a94da85685d449ea/library/core/src/num/f32.rs:1566:9:
min > max, or either was NaN. min = 2000.0001, max = 400.2

---- a_new_entry_starts_from_the_current_output stdout ----

thread 'a_new_entry_starts_from_the_current_output' (1818084) panicked at /rustc/88d9e12ae178fab0fb5cc050a94da85685d449ea/library/core/src/num/f32.rs:1566:9:
min > max, or either was NaN. min = 1250.0001, max = 250.2

---- the_slew_limiter_matches_upstream stdout ----

thread 'the_slew_limiter_matches_upstream' (1818098) panicked at crates/ap-servo/tests/slew_parity.rs:99:13:
step 120 after_thr: 75.00001 != upstream 88.8 (diff 13.799995)

failures:
    a_disabled_limit_still_tracks_the_output
    a_new_entry_starts_from_the_current_output
    peeking_does_not_advance_the_slew_history
    the_slew_limiter_matches_upstream

test result: FAILED. 12 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
