*** crates/ap-servo/src/registry.rs:442:26: replace -= with /= in Registry::step_override_counters

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace -= with /= in Registry::step_override_counters
@@ -434,17 +434,17 @@
         for (chan, channel) in channels.iter_mut().enumerate() {
             let Some(counter) = self.override_counter.get_mut(chan) else {
                 break;
             };
             if *counter == 0 {
                 channel.set_override(false);
             } else {
                 channel.set_override(true);
-                *counter -= 1;
+                *counter /= /* ~ changed by cargo-mutants ~ */ 1;
             }
         }
     }
 
     /// Loops of override left on a channel, for callers that want to know.
     #[must_use]
     pub fn override_counter(&self, chan: usize) -> u16 {
         self.override_counter.get(chan).copied().unwrap_or(0)

---- the_override_timeout_matches_upstream stdout ----

thread 'the_override_timeout_matches_upstream' (1825654) panicked at crates/ap-servo/tests/slew_parity.rs:402:9:
assertion `left == right` failed: step 13: pulse width 1205 != upstream 1318
  left: 1205
 right: 1318

failures:
    the_override_timeout_matches_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
