*** crates/ap-servo/src/registry.rs:450:9: replace Registry::override_counter -> u16 with 1

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::override_counter -> u16 with 1
@@ -442,17 +442,17 @@
                 *counter -= 1;
             }
         }
     }
 
     /// Loops of override left on a channel, for callers that want to know.
     #[must_use]
     pub fn override_counter(&self, chan: usize) -> u16 {
-        self.override_counter.get(chan).copied().unwrap_or(0)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// How many slew entries are in use, so a caller can tell it has not
     /// silently exhausted the table.
     #[must_use]
     pub fn slew_entries(&self) -> usize {
         self.slew.iter().flatten().count()
     }

---- a_long_timeout_on_a_fast_loop_saturates stdout ----

thread 'a_long_timeout_on_a_fast_loop_saturates' (1827397) panicked at crates/ap-servo/tests/slew_parity.rs:530:5:
assertion `left == right` failed: the count must saturate; wrapping would turn the longest override into one of a few hundred loops
  left: 1
 right: 65535

---- a_sub_loop_timeout_still_gets_one_loop stdout ----

thread 'a_sub_loop_timeout_still_gets_one_loop' (1827400) panicked at crates/ap-servo/tests/slew_parity.rs:447:9:
assertion `left == right` failed: 0 ms on a 2500 us loop should be 0 loops
  left: 1
 right: 0

---- the_override_timeout_matches_upstream stdout ----

thread 'the_override_timeout_matches_upstream' (1827409) panicked at crates/ap-servo/tests/slew_parity.rs:416:5:
the override must both hold and lapse (60 held, 0 tracked)

failures:
    a_long_timeout_on_a_fast_loop_saturates
    a_sub_loop_timeout_still_gets_one_loop
    the_override_timeout_matches_upstream

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
