*** crates/ap-servo/src/registry.rs:469:9: replace Registry::set_have_pwm with ()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::set_have_pwm with ()
@@ -461,17 +461,17 @@
     #[must_use]
     pub fn have_pwm_mask(&self) -> ChannelMask {
         self.have_pwm_mask
     }
 
     /// Mark channels as carrying a pulse width, upstream's writes to
     /// `have_pwm_mask` from `set_output_pwm`.
     pub fn set_have_pwm(&mut self, channel_mask: ChannelMask) {
-        self.have_pwm_mask |= channel_mask;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Claim a channel for a function if nothing else wants either, upstream
     /// `set_aux_channel_default`.
     ///
     /// Returns whether the function ended up assigned. Three outcomes, and the
     /// distinction between the last two is the point:
     ///

---- writing_a_scaled_value_clears_the_pulse_width_mask stdout ----

thread 'writing_a_scaled_value_clears_the_pulse_width_mask' (1830818) panicked at crates/ap-servo/tests/srv_functions.rs:228:5:
assertion `left == right` failed
  left: 0
 right: 15

failures:
    writing_a_scaled_value_clears_the_pulse_width_mask

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
