*** crates/ap-servo/src/registry.rs:504:29: replace == with != in Registry::set_aux_channel_default

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace == with != in Registry::set_aux_channel_default
@@ -496,17 +496,17 @@
             return true;
         }
 
         let Some(current) = channel_functions.get_mut(usize::from(channel)) else {
             return false;
         };
 
         if *current != Function::NONE {
-            return *current == function;
+            return *current != /* ~ changed by cargo-mutants ~ */ function;
         }
 
         *current = function;
         if function.valid() && channel < 32 {
             if let Some(entry) = self.functions.get_mut(usize::from(function.0)) {
                 entry.channel_mask |= 1_u32 << channel;
             }
         }

*** result: Success
