*** crates/ap-servo/src/registry.rs:532:47: replace == with != in Registry::set_output_pwm

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace == with != in Registry::set_output_pwm
@@ -524,17 +524,17 @@
     /// that accepted it enter the pulse-width mask. Marking a refused channel
     /// would make the scaled path skip a channel it should be driving.
     pub fn set_output_pwm(
         &mut self,
         channels: &mut [OutputChannel],
         function: Function,
         value: u16,
     ) {
-        if self.output_channel_mask(function) == 0 {
+        if self.output_channel_mask(function) != /* ~ changed by cargo-mutants ~ */ 0 {
             return;
         }
         for ch in channels.iter_mut() {
             if ch.function != function {
                 continue;
             }
             if ch.set_output_pwm(value, false) && ch.ch_num < 32 {
                 self.have_pwm_mask |= 1_u32 << ch.ch_num;

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1841364) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 1 (estop false, scaled 0): 1000 != upstream 1234
  left: 1000
 right: 1234

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
