*** crates/ap-servo/src/registry.rs:532:9: replace Registry::set_output_pwm with ()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::set_output_pwm with ()
@@ -524,27 +524,17 @@
     /// that accepted it enter the pulse-width mask. Marking a refused channel
     /// would make the scaled path skip a channel it should be driving.
     pub fn set_output_pwm(
         &mut self,
         channels: &mut [OutputChannel],
         function: Function,
         value: u16,
     ) {
-        if self.output_channel_mask(function) == 0 {
-            return;
-        }
-        for ch in channels.iter_mut() {
-            if ch.function != function {
-                continue;
-            }
-            if ch.set_output_pwm(value, false) && ch.ch_num < 32 {
-                self.have_pwm_mask |= 1_u32 << ch.ch_num;
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Convert every channel's scaled value to a pulse, upstream
     /// `SRV_Channels::calc_pwm`.
     ///
     /// Each channel reads the scaled value of its own function. A channel
     /// whose function this build does not define is left alone: there is no
     /// scaled value to convert, and writing a zero would drive an output on

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1841020) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 1 (estop false, scaled 0): 1000 != upstream 1234
  left: 1000
 right: 1234

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
