*** crates/ap-servo/src/registry.rs:540:36: replace |= with &= in Registry::set_output_pwm

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace |= with &= in Registry::set_output_pwm
@@ -532,17 +532,17 @@
         if self.output_channel_mask(function) == 0 {
             return;
         }
         for ch in channels.iter_mut() {
             if ch.function != function {
                 continue;
             }
             if ch.set_output_pwm(value, false) && ch.ch_num < 32 {
-                self.have_pwm_mask |= 1_u32 << ch.ch_num;
+                self.have_pwm_mask &= /* ~ changed by cargo-mutants ~ */ 1_u32 << ch.ch_num;
             }
         }
     }
 
     /// Convert every channel's scaled value to a pulse, upstream
     /// `SRV_Channels::calc_pwm`.
     ///
     /// Each channel reads the scaled value of its own function. A channel

---- the_calc_pwm_priority_matches_upstream stdout ----

thread 'the_calc_pwm_priority_matches_upstream' (1845945) panicked at crates/ap-servo/tests/calc_pwm.rs:124:13:
assertion `left == right` failed: case 0 channel 1 (estop false, scaled 0): 1000 != upstream 1234
  left: 1000
 right: 1234

failures:
    the_calc_pwm_priority_matches_upstream

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
