*** crates/ap-servo/src/registry.rs:575:9: replace Registry::function_assigned -> bool with false

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::function_assigned -> bool with false
@@ -567,17 +567,17 @@
             ch.calc_pwm(self.output_scaled(ch.function), &ctx);
         }
     }
 
     /// Whether any channel carries this function, upstream
     /// `function_assigned`.
     #[must_use]
     pub fn function_assigned(&self, function: Function) -> bool {
-        function.valid() && self.output_channel_mask(function) != 0
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// The first channel carrying a function, upstream `find_channel`.
     ///
     /// First, not only — a function may drive several channels, and the
     /// callers that use this are asking a question with one answer (what is
     /// this surface doing) rather than commanding all of them.
     #[must_use]

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1849890) panicked at crates/ap-servo/tests/slew_parity.rs:1095:9:
assertion `left == right` failed
  left: 1500
 right: 1750

---- the_function_setters_match_upstream stdout ----

thread 'the_function_setters_match_upstream' (1849881) panicked at crates/ap-servo/tests/slew_parity.rs:652:17:
assertion `left == right` failed: case 0 channel 6 out_pwm
  left: 0
 right: 1500

failures:
    the_function_setters_match_upstream
    the_remaining_function_operations_do_something

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
