*** crates/ap-servo/src/registry.rs:634:9: replace Registry::set_output_to_trim with ()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::set_output_to_trim with ()
@@ -626,22 +626,17 @@
     ///
     /// Almost. `function_assigned` consults the channel mask, which is rebuilt
     /// by [`Self::update_aux_servo_function`] — so between a channel's function
     /// changing and that rebuild, the guard and the loop disagree, and the
     /// guarded version would skip work the unguarded one does. Reproduced
     /// unguarded, matching upstream, rather than making the port stricter than
     /// the thing it is meant to reproduce.
     pub fn set_output_to_trim(&mut self, channels: &mut [OutputChannel], function: Function) {
-        for ch in channels.iter_mut() {
-            if ch.function == function {
-                let trim = ch.config.servo_trim;
-                ch.set_output_pwm(trim, false);
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Move the trim of every channel with this function, upstream
     /// `set_trim_to_pwm_for`.
     pub fn set_trim_to_pwm_for(channels: &mut [OutputChannel], function: Function, pwm: u16) {
         for ch in channels.iter_mut() {
             if ch.function == function {
                 ch.config.servo_trim = pwm;

---- the_function_setters_match_upstream stdout ----

thread 'the_function_setters_match_upstream' (1858390) panicked at crates/ap-servo/tests/slew_parity.rs:652:17:
assertion `left == right` failed: case 4 channel 6 out_pwm
  left: 0
 right: 1500

failures:
    the_function_setters_match_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
