*** crates/ap-servo/src/registry.rs:717:9: replace Registry::output_pwm_for -> Option<u16> with Some(0)

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::output_pwm_for -> Option<u16> with Some(0)
@@ -709,28 +709,17 @@
     /// Recomputes first, for the same reason and with the same caveat as
     /// [`Self::output_norm`].
     pub fn output_pwm_for(
         &self,
         channels: &mut [OutputChannel],
         function: Function,
         emergency_stop: bool,
     ) -> Option<u16> {
-        let chan = self.find_channel(function)?;
-        if !function.valid() {
-            return None;
-        }
-        let ch = channels.get_mut(chan)?;
-        let ctx = OutputContext {
-            have_pwm_mask: self.have_pwm_mask,
-            emergency_stop,
-        };
-        let scaled = self.output_scaled(function);
-        ch.calc_pwm(scaled, &ctx);
-        Some(ch.output_pwm())
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Nudge the trim of every channel with this function, upstream
     /// `adjust_trim`.
     ///
     /// Three things about this are surprising and all three are deliberate.
     ///
     /// **The magnitude of `v` is ignored.** Only its sign is read, and the

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1868100) panicked at crates/ap-servo/tests/slew_parity.rs:741:9:
assertion `left == right` failed: row 0 pwm
  left: 0
 right: 1100

failures:
    the_normalised_read_matches_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
