*** crates/ap-servo/src/registry.rs:718:12: delete ! in Registry::output_pwm_for

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete ! in Registry::output_pwm_for
@@ -710,17 +710,17 @@
     /// [`Self::output_norm`].
     pub fn output_pwm_for(
         &self,
         channels: &mut [OutputChannel],
         function: Function,
         emergency_stop: bool,
     ) -> Option<u16> {
         let chan = self.find_channel(function)?;
-        if !function.valid() {
+        if  /* ~ changed by cargo-mutants ~ */function.valid() {
             return None;
         }
         let ch = channels.get_mut(chan)?;
         let ctx = OutputContext {
             have_pwm_mask: self.have_pwm_mask,
             emergency_stop,
         };
         let scaled = self.output_scaled(function);

---- the_normalised_read_matches_upstream stdout ----

thread 'the_normalised_read_matches_upstream' (1869253) panicked at crates/ap-servo/tests/slew_parity.rs:738:14:
assigned function

failures:
    the_normalised_read_matches_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
