*** crates/ap-servo/src/registry.rs:758:9: replace Registry::adjust_trim with ()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::adjust_trim with ()
@@ -750,40 +750,17 @@
     /// **A degenerate channel is skipped rather than clamped.** With `max` at
     /// or below `min` there is no travel to express the trim as a fraction of,
     /// so the channel is left alone instead of being given an arbitrary
     /// answer.
     ///
     /// Reversal flips the sense before any of that, so a nudge means the same
     /// thing to the pilot on a reversed channel.
     pub fn adjust_trim(&mut self, channels: &mut [OutputChannel], function: Function, v: f32) {
-        if is_zero(v) {
-            return;
-        }
-        for (i, ch) in channels.iter_mut().enumerate() {
-            if ch.function != function {
-                continue;
-            }
-            let change = if ch.config.reversed { -v } else { v };
-            let min = ch.config.servo_min;
-            let max = ch.config.servo_max;
-            if max <= min {
-                continue;
-            }
-            let trim_scaled = f32::from(ch.config.servo_trim - min) / f32::from(max - min);
-            let new_trim = if change > 0.0 && trim_scaled < 0.6 {
-                ch.config.servo_trim + 1
-            } else if change < 0.0 && trim_scaled > 0.4 {
-                ch.config.servo_trim - 1
-            } else {
-                continue;
-            };
-            ch.config.servo_trim = new_trim;
-            self.trimmed_mask |= 1u32 << i;
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Which channels have had their trim nudged, upstream `trimmed_mask`.
     #[must_use]
     pub fn trimmed_mask(&self) -> ChannelMask {
         self.trimmed_mask
     }

---- a_negligible_but_nonzero_adjustment_does_nothing stdout ----

thread 'a_negligible_but_nonzero_adjustment_does_nothing' (1869886) panicked at crates/ap-servo/tests/slew_parity.rs:1055:5:
assertion `left == right` failed: a real adjustment must still work
  left: 1500
 right: 1501

---- the_trim_adjustment_matches_upstream stdout ----

thread 'the_trim_adjustment_matches_upstream' (1869918) panicked at crates/ap-servo/tests/slew_parity.rs:919:9:
assertion `left == right` failed: step 0 channel 11 trim
  left: 1500
 right: 1501

failures:
    a_negligible_but_nonzero_adjustment_does_nothing
    the_trim_adjustment_matches_upstream

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
