*** crates/ap-servo/src/registry.rs:762:28: replace != with == in Registry::adjust_trim

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace != with == in Registry::adjust_trim
@@ -754,17 +754,17 @@
     ///
     /// Reversal flips the sense before any of that, so a nudge means the same
     /// thing to the pilot on a reversed channel.
     pub fn adjust_trim(&mut self, channels: &mut [OutputChannel], function: Function, v: f32) {
         if is_zero(v) {
             return;
         }
         for (i, ch) in channels.iter_mut().enumerate() {
-            if ch.function != function {
+            if ch.function == /* ~ changed by cargo-mutants ~ */ function {
                 continue;
             }
             let change = if ch.config.reversed { -v } else { v };
             let min = ch.config.servo_min;
             let max = ch.config.servo_max;
             if max <= min {
                 continue;
             }

---- a_negligible_but_nonzero_adjustment_does_nothing stdout ----

thread 'a_negligible_but_nonzero_adjustment_does_nothing' (1870863) panicked at crates/ap-servo/tests/slew_parity.rs:1055:5:
assertion `left == right` failed: a real adjustment must still work
  left: 1500
 right: 1501

---- the_trim_adjustment_matches_upstream stdout ----

thread 'the_trim_adjustment_matches_upstream' (1870888) panicked at crates/ap-servo/tests/slew_parity.rs:919:9:
assertion `left == right` failed: step 0 channel 11 trim
  left: 1500
 right: 1501

failures:
    a_negligible_but_nonzero_adjustment_does_nothing
    the_trim_adjustment_matches_upstream

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
