*** crates/ap-servo/src/registry.rs:765:50: delete - in Registry::adjust_trim

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ delete - in Registry::adjust_trim
@@ -757,17 +757,17 @@
     pub fn adjust_trim(&mut self, channels: &mut [OutputChannel], function: Function, v: f32) {
         if is_zero(v) {
             return;
         }
         for (i, ch) in channels.iter_mut().enumerate() {
             if ch.function != function {
                 continue;
             }
-            let change = if ch.config.reversed { -v } else { v };
+            let change = if ch.config.reversed {  /* ~ changed by cargo-mutants ~ */v } else { v };
             let min = ch.config.servo_min;
             let max = ch.config.servo_max;
             if max <= min {
                 continue;
             }
             let trim_scaled = f32::from(ch.config.servo_trim - min) / f32::from(max - min);
             let new_trim = if change > 0.0 && trim_scaled < 0.6 {
                 ch.config.servo_trim + 1

---- the_trim_adjustment_matches_upstream stdout ----

thread 'the_trim_adjustment_matches_upstream' (1872258) panicked at crates/ap-servo/tests/slew_parity.rs:919:9:
assertion `left == right` failed: step 0 channel 12 trim
  left: 1501
 right: 1499

failures:
    the_trim_adjustment_matches_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
