*** crates/ap-servo/src/registry.rs:768:20: replace <= with > in Registry::adjust_trim

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace <= with > in Registry::adjust_trim
@@ -760,17 +760,17 @@
         }
         for (i, ch) in channels.iter_mut().enumerate() {
             if ch.function != function {
                 continue;
             }
             let change = if ch.config.reversed { -v } else { v };
             let min = ch.config.servo_min;
             let max = ch.config.servo_max;
-            if max <= min {
+            if max > /* ~ changed by cargo-mutants ~ */ min {
                 continue;
             }
             let trim_scaled = f32::from(ch.config.servo_trim - min) / f32::from(max - min);
             let new_trim = if change > 0.0 && trim_scaled < 0.6 {
                 ch.config.servo_trim + 1
             } else if change < 0.0 && trim_scaled > 0.4 {
                 ch.config.servo_trim - 1
             } else {

---- a_negligible_but_nonzero_adjustment_does_nothing stdout ----

thread 'a_negligible_but_nonzero_adjustment_does_nothing' (1871976) panicked at crates/ap-servo/tests/slew_parity.rs:1055:5:
assertion `left == right` failed: a real adjustment must still work
  left: 1500
 right: 1501

---- adjust_trim_skips_a_channel_with_no_travel stdout ----

thread 'adjust_trim_skips_a_channel_with_no_travel' (1871996) panicked at crates/ap-servo/src/registry.rs:771:41:
attempt to subtract with overflow

---- the_trim_adjustment_matches_upstream stdout ----

thread 'the_trim_adjustment_matches_upstream' (1872033) panicked at crates/ap-servo/tests/slew_parity.rs:919:9:
assertion `left == right` failed: step 0 channel 11 trim
  left: 1500
 right: 1501

failures:
    a_negligible_but_nonzero_adjustment_does_nothing
    adjust_trim_skips_a_channel_with_no_travel
    the_trim_adjustment_matches_upstream

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
