*** crates/ap-servo/src/registry.rs:771:62: replace - with / in Registry::adjust_trim

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace - with / in Registry::adjust_trim
@@ -763,17 +763,17 @@
                 continue;
             }
             let change = if ch.config.reversed { -v } else { v };
             let min = ch.config.servo_min;
             let max = ch.config.servo_max;
             if max <= min {
                 continue;
             }
-            let trim_scaled = f32::from(ch.config.servo_trim - min) / f32::from(max - min);
+            let trim_scaled = f32::from(ch.config.servo_trim / /* ~ changed by cargo-mutants ~ */ min) / f32::from(max - min);
             let new_trim = if change > 0.0 && trim_scaled < 0.6 {
                 ch.config.servo_trim + 1
             } else if change < 0.0 && trim_scaled > 0.4 {
                 ch.config.servo_trim - 1
             } else {
                 continue;
             };
             ch.config.servo_trim = new_trim;

---- the_trim_adjustment_matches_upstream stdout ----

thread 'the_trim_adjustment_matches_upstream' (1875622) panicked at crates/ap-servo/tests/slew_parity.rs:919:9:
assertion `left == right` failed: step 0 channel 12 trim
  left: 1500
 right: 1499

failures:
    the_trim_adjustment_matches_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
