*** crates/ap-servo/src/registry.rs:798:9: replace Registry::take_trimmed -> ChannelMask with Default::default()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::take_trimmed -> ChannelMask with Default::default()
@@ -790,17 +790,17 @@
     /// Take the set of nudged channels and clear it, upstream `save_trim`.
     ///
     /// Upstream writes each one to storage here. Storage is not this type's
     /// business, so the set is handed back and cleared — the caller saves.
     /// Clearing regardless is upstream's behaviour: a save that fails is not
     /// retried, and the alternative would be an unbounded set of pending
     /// writes.
     pub fn take_trimmed(&mut self) -> ChannelMask {
-        core::mem::take(&mut self.trimmed_mask)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set every matching channel's trim to its current output, upstream
     /// `set_trim_to_servo_out_for`.
     ///
     /// The "trim to where it is now" operation, for a pilot who has flown the
     /// surface to where they want it to rest.
     pub fn set_trim_to_servo_out_for(&self, channels: &mut [OutputChannel], function: Function) {

---- the_trim_adjustment_matches_upstream stdout ----

thread 'the_trim_adjustment_matches_upstream' (1894019) panicked at crates/ap-servo/tests/slew_parity.rs:946:5:
assertion `left == right` failed
  left: 0
 right: 6144

failures:
    the_trim_adjustment_matches_upstream

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
