*** crates/ap-servo/src/registry.rs:807:9: replace Registry::set_trim_to_servo_out_for with ()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::set_trim_to_servo_out_for with ()
@@ -799,24 +799,17 @@
     }
 
     /// Set every matching channel's trim to its current output, upstream
     /// `set_trim_to_servo_out_for`.
     ///
     /// The "trim to where it is now" operation, for a pilot who has flown the
     /// surface to where they want it to rest.
     pub fn set_trim_to_servo_out_for(&self, channels: &mut [OutputChannel], function: Function) {
-        if !self.function_assigned(function) {
-            return;
-        }
-        for ch in channels.iter_mut() {
-            if ch.function == function {
-                ch.config.servo_trim = ch.output_pwm();
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Drive every matching channel to a normalised value, upstream
     /// `set_output_norm`.
     pub fn set_output_norm(&self, channels: &mut [OutputChannel], function: Function, value: f32) {
         if !self.function_assigned(function) {
             return;
         }

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1895293) panicked at crates/ap-servo/tests/slew_parity.rs:1095:9:
assertion `left == right` failed
  left: 1500
 right: 1750

failures:
    the_remaining_function_operations_do_something

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
