*** crates/ap-servo/src/registry.rs:846:9: replace Registry::for_each_failsafe_target with ()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::for_each_failsafe_target with ()
@@ -838,28 +838,17 @@
         channels: &[OutputChannel],
         function: Function,
         limit: Option<Limit>,
         pwm: u16,
         mut visit: F,
     ) where
         F: FnMut(u8, u16),
     {
-        if !self.function_assigned(function) {
-            return;
-        }
-        for ch in channels {
-            if ch.function == function {
-                let value = match limit {
-                    Some(l) => ch.config.limit_pwm(l),
-                    None => pwm,
-                };
-                visit(ch.ch_num, value);
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Visit every non-motor channel with its trim, upstream
     /// `setup_failsafe_trim_all_non_motors`.
     ///
     /// Motors are excluded because a failsafe that drove them to trim would
     /// command whatever trim happens to mean for a motor — on a multirotor,
     /// mid-throttle. Leaving them out means their failsafe stays wherever it

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1899839) panicked at crates/ap-servo/tests/slew_parity.rs:1137:9:
assertion `left == right` failed: explicit width, both channels
  left: []
 right: [(2, 1666), (5, 1666)]

failures:
    the_remaining_function_operations_do_something

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
