*** crates/ap-servo/src/registry.rs:850:28: replace == with != in Registry::for_each_failsafe_target

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace == with != in Registry::for_each_failsafe_target
@@ -842,17 +842,17 @@
         mut visit: F,
     ) where
         F: FnMut(u8, u16),
     {
         if !self.function_assigned(function) {
             return;
         }
         for ch in channels {
-            if ch.function == function {
+            if ch.function != /* ~ changed by cargo-mutants ~ */ function {
                 let value = match limit {
                     Some(l) => ch.config.limit_pwm(l),
                     None => pwm,
                 };
                 visit(ch.ch_num, value);
             }
         }
     }

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1901807) panicked at crates/ap-servo/tests/slew_parity.rs:1137:9:
assertion `left == right` failed: explicit width, both channels
 right: [(2, 1666), (5, 1666)]

failures:
    the_remaining_function_operations_do_something

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
