*** crates/ap-servo/src/registry.rs:871:9: replace Registry::for_each_non_motor_trim with ()

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace Registry::for_each_non_motor_trim with ()
@@ -863,21 +863,17 @@
     /// Motors are excluded because a failsafe that drove them to trim would
     /// command whatever trim happens to mean for a motor — on a multirotor,
     /// mid-throttle. Leaving them out means their failsafe stays wherever it
     /// was set deliberately.
     pub fn for_each_non_motor_trim<F>(channels: &[OutputChannel], mut visit: F)
     where
         F: FnMut(u8, u16),
     {
-        for ch in channels {
-            if !ch.function.is_motor() {
-                visit(ch.ch_num, ch.config.servo_trim);
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether every channel in `mask` is digital, upstream
     /// `have_digital_outputs(mask)`.
     ///
     /// An empty mask is false, not vacuously true. Upstream tests `mask != 0`
     /// first, and it matters: "all of no channels are digital" would otherwise
     /// send a vehicle with no motors assigned down the digital path.

---- the_remaining_function_operations_do_something stdout ----

thread 'the_remaining_function_operations_do_something' (1901676) panicked at crates/ap-servo/tests/slew_parity.rs:1176:9:
non-motors are included

failures:
    the_remaining_function_operations_do_something

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
