*** crates/ap-servo/src/registry.rs:886:19: replace && with || in Registry::have_digital_outputs

*** mutation diff:
--- crates/ap-servo/src/registry.rs
+++ replace && with || in Registry::have_digital_outputs
@@ -878,11 +878,11 @@
     /// Whether every channel in `mask` is digital, upstream
     /// `have_digital_outputs(mask)`.
     ///
     /// An empty mask is false, not vacuously true. Upstream tests `mask != 0`
     /// first, and it matters: "all of no channels are digital" would otherwise
     /// send a vehicle with no motors assigned down the digital path.
     #[must_use]
     pub fn have_digital_outputs(mask: ChannelMask, digital_mask: ChannelMask) -> bool {
-        mask != 0 && (mask & digital_mask) == mask
+        mask != 0 || /* ~ changed by cargo-mutants ~ */ (mask & digital_mask) == mask
     }
 }

---- an_empty_mask_is_not_digital stdout ----

thread 'an_empty_mask_is_not_digital' (1904899) panicked at crates/ap-servo/tests/srv_functions.rs:134:9:
empty mask against digital 0x0 should be false

---- the_digital_output_test_matches_upstream stdout ----

thread 'the_digital_output_test_matches_upstream' (1904906) panicked at crates/ap-servo/tests/srv_functions.rs:116:9:
assertion `left == right` failed: step 0 mask 0x0 against digital 0xf
  left: true
 right: false

failures:
    an_empty_mask_is_not_digital
    the_digital_output_test_matches_upstream

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
